dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h



/*
 --------------------------------------------------------------------------
 --             - ATxmega32D4P.h -
 --
 --     This file declares the internal register addresses for ATxmega32D4P.
 --
 --     Used with IAR System's iccAVR and aAVR.
 --
 --     Copyright (c) 2008 Atmel Corporation. All rights reserved.
 --
 --     \asf_license_start
 --
 --     Redistribution and use in source and binary forms, with or without
 --     modification, are permitted provided that the following conditions are met:
 --
 --     1. Redistributions of source code must retain the above copyright notice,
 --        this list of conditions and the following disclaimer.
 --
 --     2. Redistributions in binary form must reproduce the above copyright notice,
 --        this list of conditions and the following disclaimer in the documentation
 --        and/or other materials provided with the distribution.
 --
 --     3. The name of Atmel may not be used to endorse or promote products derived
 --        from this software without specific prior written permission.
 --
 --     4. This software may only be redistributed and used in connection with an
 --        Atmel microcontroller product.
 --
 --     THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 --     WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 --     MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 --     EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 --     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 --     DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 --     OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 --     HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 --     STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 --     ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 --     POSSIBILITY OF SUCH DAMAGE.
 --
 --     \asf_license_stop
 --
 --------------------------------------------------------------------------
*/


#include <Atmel/iomacro_xmega.h>

#ifdef  __IAR_SYSTEMS_ICC__
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#pragma language=save
#pragma language=extended
#endif


#if TID_GUARD(3)
#error This file should only be compiled with iccavr or aavr whith processor option -v3
#endif /* TID_GUARD(3) */



#if !defined(__ATxmega32D4P_H) && defined(__IAR_SYSTEMS_ICC__)

/*
 ---------------------------------------------------------------------------
 ----------------------------------------------------------------------------
 --
 -- Device signature
 --
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
*/

#define SIGNATURE_000 0x1E
#define SIGNATURE_001 0x95
#define SIGNATURE_002 0x41


/*
 ---------------------------------------------------------------------------
 ----------------------------------------------------------------------------
 --
 -- IO module structures.
 --
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
*/


/** @addtogroup xocd On-Chip Debug System
 *  @{
 */

/// On-Chip Debug System
typedef struct OCD_struct {
	register8_t OCDR0; ///< OCD Register 0
	register8_t OCDR1; ///< OCD Register 1
} OCD_t;

/** @} */

/** @addtogroup clk Clock System
 *  @{
 */

/// Clock System
typedef struct CLK_struct {
	register8_t CTRL; ///< Control Register
	register8_t PSCTRL; ///< Prescaler Control Register
	register8_t LOCK; ///< Lock register
	register8_t RTCCTRL; ///< RTC Control Register
} CLK_t;

/// Power Reduction
typedef struct PR_struct {
	register8_t PRGEN; ///< General Power Reduction
	register8_t PRPA; ///< Power Reduction Port A
	register8_t PRPB; ///< Power Reduction Port B
	register8_t PRPC; ///< Power Reduction Port C
	register8_t PRPD; ///< Power Reduction Port D
	register8_t PRPE; ///< Power Reduction Port E
	register8_t PRPF; ///< Power Reduction Port F
} PR_t;

/** @} */

/** @addtogroup sleep Sleep Controller
 *  @{
 */

/// Sleep Controller
typedef struct SLEEP_struct {
	register8_t CTRL; ///< Control Register
} SLEEP_t;

/** @} */

/** @addtogroup osc Oscillator
 *  @{
 */

/// Oscillator
typedef struct OSC_struct {
	register8_t CTRL; ///< Control Register
	register8_t STATUS; ///< Status Register
	register8_t XOSCCTRL; ///< External Oscillator Control Register
	register8_t XOSCFAIL; ///< External Oscillator Failure Detection Register
	register8_t RC32KCAL; ///< 32kHz Internal Oscillator Calibration Register
	register8_t PLLCTRL; ///< PLL Control REgister
	register8_t DFLLCTRL; ///< DFLL Control Register
} OSC_t;

/** @} */

/** @addtogroup dfll DFLL
 *  @{
 */

/// DFLL
typedef struct DFLL_struct {
	register8_t CTRL; ///< Control Register
	register8_t reserved_0x01; ///< reserved
	register8_t CALA; ///< Calibration Register A
	register8_t CALB; ///< Calibration Register B
	register8_t COMP0; ///< Oscillator Compare Register 0
	register8_t COMP1; ///< Oscillator Compare Register 1
	register8_t COMP2; ///< Oscillator Compare Register 2
	register8_t reserved_0x07; ///< reserved
} DFLL_t;

/** @} */

/** @addtogroup rst Reset
 *  @{
 */

/// Reset
typedef struct RST_struct {
	register8_t STATUS; ///< Status Register
	register8_t CTRL; ///< Control Register
} RST_t;

/** @} */

/** @addtogroup wdt Watch-Dog Timer
 *  @{
 */

/// Watch-Dog Timer
typedef struct WDT_struct {
	register8_t CTRL; ///< Control
	register8_t WINCTRL; ///< Windowed Mode Control
	register8_t STATUS; ///< Status
} WDT_t;

/** @} */

/** @addtogroup mcu MCU Control
 *  @{
 */

/// MCU Control
typedef struct MCU_struct {
	register8_t DEVID0; ///< Device ID byte 0
	register8_t DEVID1; ///< Device ID byte 1
	register8_t DEVID2; ///< Device ID byte 2
	register8_t REVID; ///< Revision ID
	register8_t JTAGUID; ///< JTAG User ID
	register8_t reserved_0x05; ///< reserved
	register8_t MCUCR; ///< MCU Control
	register8_t reserved_0x07; ///< reserved
	register8_t EVSYSLOCK; ///< Event System Lock
	register8_t AWEXLOCK; ///< AWEX Lock
	register8_t reserved_0x0A; ///< reserved
	register8_t reserved_0x0B; ///< reserved
} MCU_t;

/** @} */

/** @addtogroup pmic Programmable Multi-level Interrupt Controller
 *  @{
 */

/// Programmable Multi-level Interrupt Controller
typedef struct PMIC_struct {
	register8_t STATUS; ///< Status Register
	register8_t INTPRI; ///< Interrupt Priority
	register8_t CTRL; ///< Control Register
} PMIC_t;

/** @} */

/** @addtogroup evsys Event System
 *  @{
 */

