dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Event System
typedef struct EVSYS_struct {
	register8_t CH0MUX; ///< Event Channel 0 Multiplexer
	register8_t CH1MUX; ///< Event Channel 1 Multiplexer
	register8_t CH2MUX; ///< Event Channel 2 Multiplexer
	register8_t CH3MUX; ///< Event Channel 3 Multiplexer
	register8_t reserved_0x04; ///< reserved
	register8_t reserved_0x05; ///< reserved
	register8_t reserved_0x06; ///< reserved
	register8_t reserved_0x07; ///< reserved
	register8_t CH0CTRL; ///< Channel 0 Control Register
	register8_t CH1CTRL; ///< Channel 1 Control Register
	register8_t CH2CTRL; ///< Channel 2 Control Register
	register8_t CH3CTRL; ///< Channel 3 Control Register
	register8_t reserved_0x0C; ///< reserved
	register8_t reserved_0x0D; ///< reserved
	register8_t reserved_0x0E; ///< reserved
	register8_t reserved_0x0F; ///< reserved
	register8_t STROBE; ///< Event Strobe
	register8_t DATA; ///< Event Data
} EVSYS_t;

/** @} */

/** @addtogroup nvm Non Volatile Memory Controller
 *  @{
 */

/// Non-volatile Memory Controller
typedef struct NVM_struct {
	register8_t ADDR0; ///< Address Register 0
	register8_t ADDR1; ///< Address Register 1
	register8_t ADDR2; ///< Address Register 2
	register8_t reserved_0x03; ///< reserved
	register8_t DATA0; ///< Data Register 0
	register8_t DATA1; ///< Data Register 1
	register8_t DATA2; ///< Data Register 2
	register8_t reserved_0x07; ///< reserved
	register8_t reserved_0x08; ///< reserved
	register8_t reserved_0x09; ///< reserved
	register8_t CMD; ///< Command
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t INTCTRL; ///< Interrupt Control
	register8_t reserved_0x0E; ///< reserved
	register8_t STATUS; ///< Status
	register8_t LOCKBITS; ///< Lock Bits
} NVM_t;

/// Lock Bits
typedef struct NVM_LOCKBITS_struct {
	register8_t LOCKBITS; ///< Lock Bits
} NVM_LOCKBITS_t;

/// Fuses
typedef struct NVM_FUSES_struct {
	register8_t FUSEBYTE0; ///< User ID
	register8_t FUSEBYTE1; ///< Watchdog Configuration
	register8_t FUSEBYTE2; ///< Reset Configuration
	register8_t reserved_0x03; ///< reserved
	register8_t FUSEBYTE4; ///< Start-up Configuration
	register8_t FUSEBYTE5; ///< EESAVE and BOD Level
} NVM_FUSES_t;

/// Production Signatures
typedef struct NVM_PROD_SIGNATURES_struct {
	register8_t RCOSC2M; ///< RCOSC 2MHz Calibration Value
	register8_t reserved_0x01; ///< reserved
	register8_t RCOSC32K; ///< RCOSC 32kHz Calibration Value
	register8_t RCOSC32M; ///< RCOSC 32MHz Calibration Value
	register8_t reserved_0x04; ///< reserved
	register8_t reserved_0x05; ///< reserved
	register8_t reserved_0x06; ///< reserved
	register8_t reserved_0x07; ///< reserved
	register8_t LOTNUM0; ///< Lot Number Byte 0, ASCII
	register8_t LOTNUM1; ///< Lot Number Byte 1, ASCII
	register8_t LOTNUM2; ///< Lot Number Byte 2, ASCII
	register8_t LOTNUM3; ///< Lot Number Byte 3, ASCII
	register8_t LOTNUM4; ///< Lot Number Byte 4, ASCII
	register8_t LOTNUM5; ///< Lot Number Byte 5, ASCII
	register8_t reserved_0x0E; ///< reserved
	register8_t reserved_0x0F; ///< reserved
	register8_t WAFNUM; ///< Wafer Number
	register8_t reserved_0x11; ///< reserved
	register8_t COORDX0; ///< Wafer Coordinate X Byte 0
	register8_t COORDX1; ///< Wafer Coordinate X Byte 1
	register8_t COORDY0; ///< Wafer Coordinate Y Byte 0
	register8_t COORDY1; ///< Wafer Coordinate Y Byte 1
	register8_t reserved_0x16; ///< reserved
	register8_t reserved_0x17; ///< reserved
	register8_t reserved_0x18; ///< reserved
	register8_t reserved_0x19; ///< reserved
	register8_t reserved_0x1A; ///< reserved
	register8_t reserved_0x1B; ///< reserved
	register8_t reserved_0x1C; ///< reserved
	register8_t reserved_0x1D; ///< reserved
	register8_t reserved_0x1E; ///< reserved
	register8_t reserved_0x1F; ///< reserved
	register8_t ADCACAL0; ///< ADCA Calibration Byte 0
	register8_t ADCACAL1; ///< ADCA Calibration Byte 1
	register8_t reserved_0x22; ///< reserved
	register8_t reserved_0x23; ///< reserved
	register8_t ADCBCAL0; ///< ADCB Calibration Byte 0
	register8_t ADCBCAL1; ///< ADCB Calibration Byte 1
	register8_t reserved_0x26; ///< reserved
	register8_t reserved_0x27; ///< reserved
	register8_t reserved_0x28; ///< reserved
	register8_t reserved_0x29; ///< reserved
	register8_t reserved_0x2A; ///< reserved
	register8_t reserved_0x2B; ///< reserved
	register8_t reserved_0x2C; ///< reserved
	register8_t reserved_0x2D; ///< reserved
	register8_t TEMPSENSE0; ///< Temperature Sensor Calibration Byte 0
	register8_t TEMPSENSE1; ///< Temperature Sensor Calibration Byte 0
	register8_t reserved_0x30; ///< reserved
	register8_t reserved_0x31; ///< reserved
	register8_t reserved_0x32; ///< reserved
	register8_t reserved_0x33; ///< reserved
	register8_t reserved_0x34; ///< reserved
	register8_t reserved_0x35; ///< reserved
	register8_t reserved_0x36; ///< reserved
	register8_t reserved_0x37; ///< reserved
	register8_t reserved_0x38; ///< reserved
	register8_t reserved_0x39; ///< reserved
	register8_t reserved_0x3A; ///< reserved
	register8_t reserved_0x3B; ///< reserved
	register8_t reserved_0x3C; ///< reserved
	register8_t reserved_0x3D; ///< reserved
	register8_t reserved_0x3E; ///< reserved
} NVM_PROD_SIGNATURES_t;

/** @} */

/** @addtogroup ac Analog Comparator
 *  @{
 */

/// Analog Comparator
typedef struct AC_struct {
	register8_t AC0CTRL; ///< Comparator 0 Control
	register8_t AC1CTRL; ///< Comparator 1 Control
	register8_t AC0MUXCTRL; ///< Comparator 0 MUX Control
	register8_t AC1MUXCTRL; ///< Comparator 1 MUX Control
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t WINCTRL; ///< Window Mode Control
	register8_t STATUS; ///< Status
} AC_t;

/** @} */

/** @addtogroup adc Analog/Digital Converter
 *  @{
 */

/// ADC Channel
typedef struct ADC_CH_struct {
	register8_t CTRL; ///< Control Register
	register8_t MUXCTRL; ///< MUX Control
	register8_t INTCTRL; ///< Channel Interrupt Control
	register8_t INTFLAGS; ///< Interrupt Flags
	WORDREGISTER(RES); ///< Channel Result
	register8_t reserved_0x6; ///< reserved
	register8_t reserved_0x7; ///< reserved
} ADC_CH_t;

/// Analog-to-Digital Converter
typedef struct ADC_struct {
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t REFCTRL; ///< Reference Control
	register8_t EVCTRL; ///< Event Control
	register8_t PRESCALER; ///< Clock Prescaler
	register8_t reserved_0x05; ///< reserved
	register8_t INTFLAGS; ///< Interrupt Flags
	register8_t TEMP; ///< ACD Temporary Register
	register8_t reserved_0x08; ///< reserved
	register8_t reserved_0x09; ///< reserved
	register8_t reserved_0x0A; ///< reserved
	register8_t reserved_0x0B; ///< reserved
	WORDREGISTER(CAL); ///< Calibration Value
	register8_t reserved_0x0E; ///< reserved
	register8_t reserved_0x0F; ///< reserved
	WORDREGISTER(CH0RES); ///< Channel 0 Result
	register8_t reserved_0x12; ///< reserved
	register8_t reserved_0x13; ///< reserved
	register8_t reserved_0x14; ///< reserved
	register8_t reserved_0x15; ///< reserved
	register8_t reserved_0x16; ///< reserved
	register8_t reserved_0x17; ///< reserved
	WORDREGISTER(CMP); ///< Compare Value
	register8_t reserved_0x1A; ///< reserved
	register8_t reserved_0x1B; ///< reserved
	register8_t reserved_0x1C; ///< reserved
	register8_t reserved_0x1D; ///< reserved
	register8_t reserved_0x1E; ///< reserved
	register8_t reserved_0x1F; ///< reserved
	ADC_CH_t CH0; ///< ADC Channel 0
} ADC_t;

/** @} */

/** @addtogroup rtc Real-Time Clounter
 *  @{
 */

/// Real-Time Counter
typedef struct RTC_struct {
	register8_t CTRL; ///< Control Register
	register8_t STATUS; ///< Status Register
	register8_t INTCTRL; ///< Interrupt Control Register
	register8_t INTFLAGS; ///< Interrupt Flags
	register8_t TEMP; ///< Temporary register
	register8_t reserved_0x05; ///< reserved
	register8_t reserved_0x06; ///< reserved
	register8_t reserved_0x07; ///< reserved
	WORDREGISTER(CNT); ///< Count Register
	WORDREGISTER(PER); ///< Period Register
	WORDREGISTER(COMP); ///< Compare Register
} RTC_t;

/** @} */

