dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @addtogroup ebi External Bus Interface
 *  @{
 */

/// EBI Chip Select Module
typedef struct EBI_CS_struct {
	register8_t CTRLA; ///< Chip Select Control Register A
	register8_t CTRLB; ///< Chip Select Control Register B
	WORDREGISTER(BASEADDR); ///< Chip Select Base Address
} EBI_CS_t;

/// External Bus Interface
typedef struct EBI_struct {
	register8_t CTRL; ///< Control
	register8_t SDRAMCTRLA; ///< SDRAM Control Register A
	register8_t reserved_0x02; ///< reserved
	register8_t reserved_0x03; ///< reserved
	WORDREGISTER(REFRESH); ///< SDRAM Refresh Period
	WORDREGISTER(INITDLY); ///< SDRAM Initialization Delay
	register8_t SDRAMCTRLB; ///< SDRAM Control Register B
	register8_t SDRAMCTRLC; ///< SDRAM Control Register C
	register8_t reserved_0x0A; ///< reserved
	register8_t reserved_0x0B; ///< reserved
	register8_t reserved_0x0C; ///< reserved
	register8_t reserved_0x0D; ///< reserved
	register8_t reserved_0x0E; ///< reserved
	register8_t reserved_0x0F; ///< reserved
	EBI_CS_t CS0; ///< Chip Select 0
	EBI_CS_t CS1; ///< Chip Select 1
	EBI_CS_t CS2; ///< Chip Select 2
	EBI_CS_t CS3; ///< Chip Select 3
} EBI_t;

/** @} */

/** @addtogroup twi Two-Wire Interface
 *  @{
 */

/// -- no doc!
typedef struct TWI_MASTER_struct {
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t CTRLC; ///< Control Register C
	register8_t STATUS; ///< Status Register
	register8_t BAUD; ///< Baurd Rate Control Register
	register8_t ADDR; ///< Address Register
	register8_t DATA; ///< Data Register
} TWI_MASTER_t;

/// -- no doc!
typedef struct TWI_SLAVE_struct {
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t STATUS; ///< Status Register
	register8_t ADDR; ///< Address Register
	register8_t DATA; ///< Data Register
	register8_t ADDRMASK; ///< Address Mask Register
} TWI_SLAVE_t;

/// Two-Wire Interface
typedef struct TWI_struct {
	register8_t CTRL; ///< TWI Common Control Register
	TWI_MASTER_t MASTER; ///< TWI master module
	TWI_SLAVE_t SLAVE; ///< TWI slave module
} TWI_t;

/** @} */

/** @addtogroup port Port Configuration
 *  @{
 */

/// I/O port Configuration
typedef struct PORTCFG_struct {
	register8_t MPCMASK; ///< Multi-pin Configuration Mask
	register8_t reserved_0x01; ///< reserved
	register8_t VPCTRLA; ///< Virtual Port Control Register A
	register8_t VPCTRLB; ///< Virtual Port Control Register B
	register8_t CLKEVOUT; ///< Clock and Event Out Register
} PORTCFG_t;

/// Virtual Port
typedef struct VPORT_struct {
	register8_t DIR; ///< I/O Port Data Direction
	register8_t OUT; ///< I/O Port Output
	register8_t IN; ///< I/O Port Input
	register8_t INTFLAGS; ///< Interrupt Flag Register
} VPORT_t;

/// I/O Ports
typedef struct PORT_struct {
	register8_t DIR; ///< I/O Port Data Direction
	register8_t DIRSET; ///< I/O Port Data Direction Set
	register8_t DIRCLR; ///< I/O Port Data Direction Clear
	register8_t DIRTGL; ///< I/O Port Data Direction Toggle
	register8_t OUT; ///< I/O Port Output
	register8_t OUTSET; ///< I/O Port Output Set
	register8_t OUTCLR; ///< I/O Port Output Clear
	register8_t OUTTGL; ///< I/O Port Output Toggle
	register8_t IN; ///< I/O port Input
	register8_t INTCTRL; ///< Interrupt Control Register
	register8_t INT0MASK; ///< Port Interrupt 0 Mask
	register8_t INT1MASK; ///< Port Interrupt 1 Mask
	register8_t INTFLAGS; ///< Interrupt Flag Register
	register8_t reserved_0x0D; ///< reserved
	register8_t reserved_0x0E; ///< reserved
	register8_t reserved_0x0F; ///< reserved
	register8_t PIN0CTRL; ///< Pin 0 Control Register
	register8_t PIN1CTRL; ///< Pin 1 Control Register
	register8_t PIN2CTRL; ///< Pin 2 Control Register
	register8_t PIN3CTRL; ///< Pin 3 Control Register
	register8_t PIN4CTRL; ///< Pin 4 Control Register
	register8_t PIN5CTRL; ///< Pin 5 Control Register
	register8_t PIN6CTRL; ///< Pin 6 Control Register
	register8_t PIN7CTRL; ///< Pin 7 Control Register
} PORT_t;

/** @} */

/** @addtogroup tc 16-bit Timer/Counter With PWM
 *  @{
 */

/// 16-bit Timer/Counter 0
typedef struct TC0_struct {
	register8_t CTRLA; ///< Control  Register A
	register8_t CTRLB; ///< Control Register B
	register8_t CTRLC; ///< Control register C
	register8_t CTRLD; ///< Control Register D
	register8_t CTRLE; ///< Control Register E
	register8_t reserved_0x05; ///< reserved
	register8_t INTCTRLA; ///< Interrupt Control Register A
	register8_t INTCTRLB; ///< Interrupt Control Register B
	register8_t CTRLFCLR; ///< Control Register F Clear
	register8_t CTRLFSET; ///< Control Register F Set
	register8_t CTRLGCLR; ///< Control Register G Clear
	register8_t CTRLGSET; ///< Control Register G Set
	register8_t INTFLAGS; ///< Interrupt Flag Register
	register8_t reserved_0x0D; ///< reserved
	register8_t reserved_0x0E; ///< reserved
	register8_t TEMP; ///< Temporary Register For 16-bit Access
	register8_t reserved_0x10; ///< reserved
	register8_t reserved_0x11; ///< reserved
	register8_t reserved_0x12; ///< reserved
	register8_t reserved_0x13; ///< reserved
	register8_t reserved_0x14; ///< reserved
	register8_t reserved_0x15; ///< reserved
	register8_t reserved_0x16; ///< reserved
	register8_t reserved_0x17; ///< reserved
	register8_t reserved_0x18; ///< reserved
	register8_t reserved_0x19; ///< reserved
	register8_t reserved_0x1A; ///< reserved
	register8_t reserved_0x1B; ///< reserved
	register8_t reserved_0x1C; ///< reserved
	register8_t reserved_0x1D; ///< reserved
	register8_t reserved_0x1E; ///< reserved
	register8_t reserved_0x1F; ///< reserved
	WORDREGISTER(CNT); ///< Count
	register8_t reserved_0x22; ///< reserved
	register8_t reserved_0x23; ///< reserved
	register8_t reserved_0x24; ///< reserved
	register8_t reserved_0x25; ///< reserved
	WORDREGISTER(PER); ///< Period
	WORDREGISTER(CCA); ///< Compare or Capture A
	WORDREGISTER(CCB); ///< Compare or Capture B
	WORDREGISTER(CCC); ///< Compare or Capture C
	WORDREGISTER(CCD); ///< Compare or Capture D
	register8_t reserved_0x30; ///< reserved
	register8_t reserved_0x31; ///< reserved
	register8_t reserved_0x32; ///< reserved
	register8_t reserved_0x33; ///< reserved
	register8_t reserved_0x34; ///< reserved
	register8_t reserved_0x35; ///< reserved
	WORDREGISTER(PERBUF); ///< Period Buffer
	WORDREGISTER(CCABUF); ///< Compare Or Capture A Buffer
	WORDREGISTER(CCBBUF); ///< Compare Or Capture B Buffer
	WORDREGISTER(CCCBUF); ///< Compare Or Capture C Buffer
	WORDREGISTER(CCDBUF); ///< Compare Or Capture D Buffer
} TC0_t;

/// 16-bit Timer/Counter 1
typedef struct TC1_struct {
	register8_t CTRLA; ///< Control  Register A
	register8_t CTRLB; ///< Control Register B
	register8_t CTRLC; ///< Control register C
	register8_t CTRLD; ///< Control Register D
	register8_t CTRLE; ///< Control Register E
	register8_t reserved_0x05; ///< reserved
	register8_t INTCTRLA; ///< Interrupt Control Register A
	register8_t INTCTRLB; ///< Interrupt Control Register B
	register8_t CTRLFCLR; ///< Control Register F Clear
	register8_t CTRLFSET; ///< Control Register F Set
	register8_t CTRLGCLR; ///< Control Register G Clear
	register8_t CTRLGSET; ///< Control Register G Set
	register8_t INTFLAGS; ///< Interrupt Flag Register
	register8_t reserved_0x0D; ///< reserved
	register8_t reserved_0x0E; ///< reserved
	register8_t TEMP; ///< Temporary Register For 16-bit Access
	register8_t reserved_0x10; ///< reserved
	register8_t reserved_0x11; ///< reserved
	register8_t reserved_0x12; ///< reserved
	register8_t reserved_0x13; ///< reserved
	register8_t reserved_0x14; ///< reserved
	register8_t reserved_0x15; ///< reserved
	register8_t reserved_0x16; ///< reserved
	register8_t reserved_0x17; ///< reserved
	register8_t reserved_0x18; ///< reserved
	register8_t reserved_0x19; ///< reserved
	register8_t reserved_0x1A; ///< reserved
	register8_t reserved_0x1B; ///< reserved
	register8_t reserved_0x1C; ///< reserved
	register8_t reserved_0x1D; ///< reserved
	register8_t reserved_0x1E; ///< reserved
	register8_t reserved_0x1F; ///< reserved
	WORDREGISTER(CNT); ///< Count
	register8_t reserved_0x22; ///< reserved
	register8_t reserved_0x23; ///< reserved
	register8_t reserved_0x24; ///< reserved
	register8_t reserved_0x25; ///< reserved
	WORDREGISTER(PER); ///< Period
	WORDREGISTER(CCA); ///< Compare or Capture A
	WORDREGISTER(CCB); ///< Compare or Capture B
	register8_t reserved_0x2C; ///< reserved
	register8_t reserved_0x2D; ///< reserved
	register8_t reserved_0x2E; ///< reserved
	register8_t reserved_0x2F; ///< reserved
	register8_t reserved_0x30; ///< reserved
	register8_t reserved_0x31; ///< reserved
	register8_t reserved_0x32; ///< reserved
	register8_t reserved_0x33; ///< reserved
	register8_t reserved_0x34; ///< reserved
	register8_t reserved_0x35; ///< reserved
	WORDREGISTER(PERBUF); ///< Period Buffer
	WORDREGISTER(CCABUF); ///< Compare Or Capture A Buffer
	WORDREGISTER(CCBBUF); ///< Compare Or Capture B Buffer
} TC1_t;

