dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Advanced Waveform Extension
typedef struct AWEX_struct {
	register8_t CTRL; ///< Control Register
	register8_t reserved_0x01; ///< reserved
	register8_t FDEMASK; ///< Fault Detection Event Mask
	register8_t FDCTRL; ///< Fault Detection Control Register
	register8_t STATUS; ///< Status Register
	register8_t reserved_0x05; ///< reserved
	register8_t DTBOTH; ///< Dead Time Both Sides
	register8_t DTBOTHBUF; ///< Dead Time Both Sides Buffer
	register8_t DTLS; ///< Dead Time Low Side
	register8_t DTHS; ///< Dead Time High Side
	register8_t DTLSBUF; ///< Dead Time Low Side Buffer
	register8_t DTHSBUF; ///< Dead Time High Side Buffer
	register8_t OUTOVEN; ///< Output Override Enable
} AWEX_t;

/// High-Resolution Extension
typedef struct HIRES_struct {
	register8_t CTRLA; ///< Control Register
} HIRES_t;

/** @} */

/** @addtogroup usart Universal Asynchronous Receiver-Transmitter
 *  @{
 */

/// Universal Synchronous/Asynchronous Receiver/Transmitter
typedef struct USART_struct {
	register8_t DATA; ///< Data Register
	register8_t STATUS; ///< Status Register
	register8_t reserved_0x02; ///< reserved
	register8_t CTRLA; ///< Control Register A
	register8_t CTRLB; ///< Control Register B
	register8_t CTRLC; ///< Control Register C
	register8_t BAUDCTRLA; ///< Baud Rate Control Register A
	register8_t BAUDCTRLB; ///< Baud Rate Control Register B
} USART_t;

/** @} */

/** @addtogroup spi Serial Peripheral Interface
 *  @{
 */

/// Serial Peripheral Interface
typedef struct SPI_struct {
	register8_t CTRL; ///< Control Register
	register8_t INTCTRL; ///< Interrupt Control Register
	register8_t STATUS; ///< Status Register
	register8_t DATA; ///< Data Register
} SPI_t;

/** @} */

/** @addtogroup ircom IR Communication Module
 *  @{
 */

/// IR Communication Module
typedef struct IRCOM_struct {
	register8_t CTRL; ///< Control Register
	register8_t TXPLCTRL; ///< IrDA Transmitter Pulse Length Control Register
	register8_t RXPLCTRL; ///< IrDA Receiver Pulse Length Control Register
} IRCOM_t;

/** @} */


#endif // !defined(__ATxmega32D4P_H) && defined(__IAR_SYSTEMS_ICC__)



/* Include the SFR part if this file has not been included before,
 * OR this file is included by the assembler (SFRs must be defined in
 * each assembler module). */

#if !defined(__ATxmega32D4P_H) || defined(__IAR_SYSTEMS_ASM__)

/*
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
 --
 -- IO register group instances.
 -- Here we define the IO module instances and map
 -- them to their respective locations in memory.
 --
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
*/

#if !defined(__IAR_SYSTEMS_ASM__)

/** @addtogroup modules_base Module Base Pointers
 *  @{
 */

#define GPIO0		(*(register8_t *) 0x00)		///< General Purpose IO Register 0
#define GPIO1		(*(register8_t *) 0x01)		///< General Purpose IO Register 1
#define GPIO2		(*(register8_t *) 0x02)		///< General Purpose IO Register 2
#define GPIO3		(*(register8_t *) 0x03)		///< General Purpose IO Register 3
#define GPIO4		(*(register8_t *) 0x04)		///< General Purpose IO Register 4
#define GPIO5		(*(register8_t *) 0x05)		///< General Purpose IO Register 5
#define GPIO6		(*(register8_t *) 0x06)		///< General Purpose IO Register 6
#define GPIO7		(*(register8_t *) 0x07)		///< General Purpose IO Register 7
#define GPIO8		(*(register8_t *) 0x08)		///< General Purpose IO Register 8
#define GPIO9		(*(register8_t *) 0x09)		///< General Purpose IO Register 9
#define GPIOA		(*(register8_t *) 0x0A)		///< General Purpose IO Register 10
#define GPIOB		(*(register8_t *) 0x0B)		///< General Purpose IO Register 11
#define GPIOC		(*(register8_t *) 0x0C)		///< General Purpose IO Register 12
#define GPIOD		(*(register8_t *) 0x0D)		///< General Purpose IO Register 13
#define GPIOE		(*(register8_t *) 0x0E)		///< General Purpose IO Register 14
#define GPIOF		(*(register8_t *) 0x0F)		///< General Purpose IO Register 15

#define CCP   		(*(register8_t *) 0x34)		///< Configuration Change Protection
#define RAMPD		(*(register8_t *) 0x38)		///< Ramp D
#define RAMPX		(*(register8_t *) 0x39)		///< Ramp X
#define RAMPY		(*(register8_t *) 0x3A)		///< Ramp Y
#define RAMPZ		(*(register8_t *) 0x3B)		///< Ramp Z
#define EIND 		(*(register8_t *) 0x3C)		///< Extended Indirect Jump
#define SPL  		(*(register8_t *) 0x3D)		///< Stack Pointer Low
#define SPH  		(*(register8_t *) 0x3E)		///< Stack Pointer High
#define SREG 		(*(register8_t *) 0x3F)		///< Status Register


#define OCD		(*(OCD_t *) 0x002E)		///< On-Chip Debug System
#define CLK		(*(CLK_t *) 0x0040)		///< Clock System
#define SLEEP		(*(SLEEP_t *) 0x0048)		///< Sleep Controller
#define OSC		(*(OSC_t *) 0x0050)		///< Oscillator Control
#define DFLLRC32M		(*(DFLL_t *) 0x0060)		///< DFLL for 32MHz RC Oscillator
#define DFLLRC2M		(*(DFLL_t *) 0x0068)		///< DFLL for 2MHz RC Oscillator
#define PR		(*(PR_t *) 0x0070)		///< Power Reduction
#define RST		(*(RST_t *) 0x0078)		///< Reset Controller
#define WDT		(*(WDT_t *) 0x0080)		///< Watch-Dog Timer
#define MCU		(*(MCU_t *) 0x0090)		///< MCU Control
#define PMIC		(*(PMIC_t *) 0x00A0)		///< Programmable Interrupt Controller
#define EVSYS		(*(EVSYS_t *) 0x0180)		///< Event System
#define NVM		(*(NVM_t *) 0x01C0)		///< Non Volatile Memory Controller
#define ACA		(*(AC_t *) 0x0380)		///< Analog Comparator A
#define ADCA		(*(ADC_t *) 0x0200)		///< Analog to Digital Converter A
#define DACB		(*(DAC_t *) 0x0320)		///< Digital to Analog Converter B
#define RTC		(*(RTC_t *) 0x0400)		///< Real-Time Counter
#define TWIC		(*(TWI_t *) 0x480)		///< Two-Wire Interface C
#define TWIE		(*(TWI_t *) 0x4A0)		///< Two-Wire Interface E
#define PORTCFG		(*(PORTCFG_t *) 0x00B0)		///< Port Configuration
#define VPORT0		(*(VPORT_t *) 0x0010)		///< Virtual Port 0
#define VPORT1		(*(VPORT_t *) 0x0014)		///< Virtual Port 1
#define VPORT2		(*(VPORT_t *) 0x0018)		///< Virtual Port 2
#define VPORT3		(*(VPORT_t *) 0x001C)		///< Virtual Port 3
#define PORTA		(*(PORT_t *) 0x0600)		///< Port A
#define PORTB		(*(PORT_t *) 0x0620)		///< Port B
#define PORTC		(*(PORT_t *) 0x0640)		///< Port C
#define PORTD		(*(PORT_t *) 0x0660)		///< Port D
#define PORTE		(*(PORT_t *) 0x0680)		///< Port E
#define PORTR		(*(PORT_t *) 0x07E0)		///< Port R
#define TCC0		(*(TC0_t *) 0x800)		///< Timer/Counter C0
#define TCC1		(*(TC1_t *) 0x840)		///< Timer/Counter C1
#define AWEXC		(*(AWEX_t *) 0x880)		///< Advanced Waveform Extension C
#define HIRESC		(*(HIRES_t *) 0x890)		///< High-Resolution Extension C
#define USARTC0		(*(USART_t *) 0x8A0)		///< Universal Asynchronous Receiver-Transmitter C0
#define SPIC		(*(SPI_t *) 0x8C0)		///< Serial Peripheral Interface C
#define TCD0		(*(TC0_t *) 0x900)		///< Timer/Counter D0
#define USARTD0		(*(USART_t *) 0x9A0)		///< Universal Asynchronous Receiver-Transmitter D0
#define SPID		(*(SPI_t *) 0x9C0)		///< Serial Peripheral Interface D
#define TCE0		(*(TC0_t *) 0xA00)		///< Timer/Counter E0
#define IRCOM		(*(IRCOM_t *) 0x8F8)		///< IR Communication Module

/** @} */

#endif // !defined(__IAR_SYSTEMS_ASM__)

#if defined(__IAR_SYSTEMS_ASM__)


