dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
 --
 -- Fully qualified IO register names for use with the assembler
 --
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
*/

/* SFRs are local in assembler modules (so this file may need to be */
/* included in more than one module in the same source file), */
/* but #defines must only be made once per source file. */


/*
 --------------------------------------------------------------------------
 -- GPIO - General Purpose IO Registers
 --------------------------------------------------------------------------
*/

sfrb GPIO0 = 0x0000		///< General Purpose IO Register 0
sfrb GPIO1 = 0x0001		///< General Purpose IO Register 1
sfrb GPIO2 = 0x0002		///< General Purpose IO Register 2
sfrb GPIO3 = 0x0003		///< General Purpose IO Register 3
sfrb GPIO4 = 0x0004		///< General Purpose IO Register 4
sfrb GPIO5 = 0x0005		///< General Purpose IO Register 5
sfrb GPIO6 = 0x0006		///< General Purpose IO Register 6
sfrb GPIO7 = 0x0007		///< General Purpose IO Register 7
sfrb GPIO8 = 0x0008		///< General Purpose IO Register 8
sfrb GPIO9 = 0x0009		///< General Purpose IO Register 9
sfrb GPIOA = 0x000A		///< General Purpose IO Register 10
sfrb GPIOB = 0x000B		///< General Purpose IO Register 11
sfrb GPIOC = 0x000C		///< General Purpose IO Register 12
sfrb GPIOD = 0x000D		///< General Purpose IO Register 13
sfrb GPIOE = 0x000E		///< General Purpose IO Register 14
sfrb GPIOF = 0x000F		///< General Purpose IO Register 15

/*
 ---------------------------------------------------------------------------
 -- CPU - CPU Registers
 ---------------------------------------------------------------------------
*/

sfrb CCP = 0x0034		///< Configuration Change Protection
sfrb RAMPD = 0x0038		///< Ramp D
sfrb RAMPX = 0x0039		///< Ramp X
sfrb RAMPY = 0x003A		///< Ramp Y
sfrb RAMPZ = 0x003B		///< Ramp Z
sfrb EIND = 0x003C		///< Extended Indirect Jump
sfrb SPL = 0x003D		///< Stack Pointer Low
sfrb SPH = 0x003E		///< Stack Pointer High
sfrb SREG = 0x003F		///< Status Register



/*
 --------------------------------------------------------------------------
 -- OCD - On-Chip Debug System
 --------------------------------------------------------------------------
*/

sfrb OCD_OCDR0 = 0x002E		///< OCD Register 0
sfrb OCD_OCDR1 = 0x002F		///< OCD Register 1

/*
 --------------------------------------------------------------------------
 -- CLK - Clock System
 --------------------------------------------------------------------------
*/

sfrb CLK_CTRL = 0x0040		///< Control Register
sfrb CLK_PSCTRL = 0x0041		///< Prescaler Control Register
sfrb CLK_LOCK = 0x0042		///< Lock register
sfrb CLK_RTCCTRL = 0x0043		///< RTC Control Register

/*
 --------------------------------------------------------------------------
 -- SLEEP - Sleep Controller
 --------------------------------------------------------------------------
*/

sfrb SLEEP_CTRL = 0x0048		///< Control Register

/*
 --------------------------------------------------------------------------
 -- OSC - Oscillator Control
 --------------------------------------------------------------------------
*/

sfrb OSC_CTRL = 0x0050		///< Control Register
sfrb OSC_STATUS = 0x0051		///< Status Register
sfrb OSC_XOSCCTRL = 0x0052		///< External Oscillator Control Register
sfrb OSC_XOSCFAIL = 0x0053		///< External Oscillator Failure Detection Register
sfrb OSC_RC32KCAL = 0x0054		///< 32kHz Internal Oscillator Calibration Register
sfrb OSC_PLLCTRL = 0x0055		///< PLL Control REgister
sfrb OSC_DFLLCTRL = 0x0056		///< DFLL Control Register

/*
 --------------------------------------------------------------------------
 -- DFLLRC32M - DFLL for 32MHz RC Oscillator
 --------------------------------------------------------------------------
*/

sfrb DFLLRC32M_CTRL = 0x0060		///< Control Register
sfrb DFLLRC32M_CALA = 0x0062		///< Calibration Register A
sfrb DFLLRC32M_CALB = 0x0063		///< Calibration Register B
sfrb DFLLRC32M_COMP0 = 0x0064		///< Oscillator Compare Register 0
sfrb DFLLRC32M_COMP1 = 0x0065		///< Oscillator Compare Register 1
sfrb DFLLRC32M_COMP2 = 0x0066		///< Oscillator Compare Register 2

/*
 --------------------------------------------------------------------------
 -- DFLLRC2M - DFLL for 2MHz RC Oscillator
 --------------------------------------------------------------------------
*/

sfrb DFLLRC2M_CTRL = 0x0068		///< Control Register
sfrb DFLLRC2M_CALA = 0x006A		///< Calibration Register A
sfrb DFLLRC2M_CALB = 0x006B		///< Calibration Register B
sfrb DFLLRC2M_COMP0 = 0x006C		///< Oscillator Compare Register 0
sfrb DFLLRC2M_COMP1 = 0x006D		///< Oscillator Compare Register 1
sfrb DFLLRC2M_COMP2 = 0x006E		///< Oscillator Compare Register 2

/*
 --------------------------------------------------------------------------
 -- PR - Power Reduction
 --------------------------------------------------------------------------
*/

sfrb PR_PRGEN = 0x0070		///< General Power Reduction
sfrb PR_PRPA = 0x0071		///< Power Reduction Port A
sfrb PR_PRPB = 0x0072		///< Power Reduction Port B
sfrb PR_PRPC = 0x0073		///< Power Reduction Port C
sfrb PR_PRPD = 0x0074		///< Power Reduction Port D
sfrb PR_PRPE = 0x0075		///< Power Reduction Port E
sfrb PR_PRPF = 0x0076		///< Power Reduction Port F

/*
 --------------------------------------------------------------------------
 -- RST - Reset Controller
 --------------------------------------------------------------------------
*/

sfrb RST_STATUS = 0x0078		///< Status Register
sfrb RST_CTRL = 0x0079		///< Control Register

/*
 --------------------------------------------------------------------------
 -- WDT - Watch-Dog Timer
 --------------------------------------------------------------------------
*/

sfrb WDT_CTRL = 0x0080		///< Control
sfrb WDT_WINCTRL = 0x0081		///< Windowed Mode Control
sfrb WDT_STATUS = 0x0082		///< Status

