dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- MCU - MCU Control
 --------------------------------------------------------------------------
*/

sfrb MCU_DEVID0 = 0x0090		///< Device ID byte 0
sfrb MCU_DEVID1 = 0x0091		///< Device ID byte 1
sfrb MCU_DEVID2 = 0x0092		///< Device ID byte 2
sfrb MCU_REVID = 0x0093		///< Revision ID
sfrb MCU_JTAGUID = 0x0094		///< JTAG User ID
sfrb MCU_MCUCR = 0x0096		///< MCU Control
sfrb MCU_EVSYSLOCK = 0x0098		///< Event System Lock
sfrb MCU_AWEXLOCK = 0x0099		///< AWEX Lock

/*
 --------------------------------------------------------------------------
 -- PMIC - Programmable Interrupt Controller
 --------------------------------------------------------------------------
*/

sfrb PMIC_STATUS = 0x00A0		///< Status Register
sfrb PMIC_INTPRI = 0x00A1		///< Interrupt Priority
sfrb PMIC_CTRL = 0x00A2		///< Control Register

/*
 --------------------------------------------------------------------------
 -- EVSYS - Event System
 --------------------------------------------------------------------------
*/

sfrb EVSYS_CH0MUX = 0x0180		///< Event Channel 0 Multiplexer
sfrb EVSYS_CH1MUX = 0x0181		///< Event Channel 1 Multiplexer
sfrb EVSYS_CH2MUX = 0x0182		///< Event Channel 2 Multiplexer
sfrb EVSYS_CH3MUX = 0x0183		///< Event Channel 3 Multiplexer
sfrb EVSYS_CH0CTRL = 0x0188		///< Channel 0 Control Register
sfrb EVSYS_CH1CTRL = 0x0189		///< Channel 1 Control Register
sfrb EVSYS_CH2CTRL = 0x018A		///< Channel 2 Control Register
sfrb EVSYS_CH3CTRL = 0x018B		///< Channel 3 Control Register
sfrb EVSYS_STROBE = 0x0190		///< Event Strobe
sfrb EVSYS_DATA = 0x0191		///< Event Data

/*
 --------------------------------------------------------------------------
 -- NVM - Non Volatile Memory
 --------------------------------------------------------------------------
*/

sfrb NVM_ADDR0 = 0x01C0		///< Address Register 0
sfrb NVM_ADDR1 = 0x01C1		///< Address Register 1
sfrb NVM_ADDR2 = 0x01C2		///< Address Register 2
sfrb NVM_DATA0 = 0x01C4		///< Data Register 0
sfrb NVM_DATA1 = 0x01C5		///< Data Register 1
sfrb NVM_DATA2 = 0x01C6		///< Data Register 2
sfrb NVM_CMD = 0x01CA		///< Command
sfrb NVM_CTRLA = 0x01CB		///< Control Register A
sfrb NVM_CTRLB = 0x01CC		///< Control Register B
sfrb NVM_INTCTRL = 0x01CD		///< Interrupt Control
sfrb NVM_STATUS = 0x01CF		///< Status
sfrb NVM_LOCKBITS = 0x01D0		///< Lock Bits

/*
 --------------------------------------------------------------------------
 -- ACA - Analog Comparator A
 --------------------------------------------------------------------------
*/

sfrb ACA_AC0CTRL = 0x0380		///< Comparator 0 Control
sfrb ACA_AC1CTRL = 0x0381		///< Comparator 1 Control
sfrb ACA_AC0MUXCTRL = 0x0382		///< Comparator 0 MUX Control
sfrb ACA_AC1MUXCTRL = 0x0383		///< Comparator 1 MUX Control
sfrb ACA_CTRLA = 0x0384		///< Control Register A
sfrb ACA_CTRLB = 0x0385		///< Control Register B
sfrb ACA_WINCTRL = 0x0386		///< Window Mode Control
sfrb ACA_STATUS = 0x0387		///< Status

/*
 --------------------------------------------------------------------------
 -- ADCA - Analog to Digital Converter A
 --------------------------------------------------------------------------
*/

sfrb ADCA_CTRLA = 0x0200		///< Control Register A
sfrb ADCA_CTRLB = 0x0201		///< Control Register B
sfrb ADCA_REFCTRL = 0x0202		///< Reference Control
sfrb ADCA_EVCTRL = 0x0203		///< Event Control
sfrb ADCA_PRESCALER = 0x0204		///< Clock Prescaler
sfrb ADCA_INTFLAGS = 0x0206		///< Interrupt Flags
sfrb ADCA_TEMP = 0x0207		///< ACD Temporary Register
sfrb ADCA_CALL = 0x020C		///< Calibration Value
sfrb ADCA_CALH = (0x020C+1)	///< Calibration Value
sfrb ADCA_CH0RESL = 0x0210		///< Channel 0 Result
sfrb ADCA_CH0RESH = (0x0210+1)	///< Channel 0 Result
sfrb ADCA_CMPL = 0x0218		///< Compare Value
sfrb ADCA_CMPH = (0x0218+1)	///< Compare Value
sfrb ADCA_CH0_CTRL = 0x0220		///< Control Register
sfrb ADCA_CH0_MUXCTRL = 0x0221		///< MUX Control
sfrb ADCA_CH0_INTCTRL = 0x0222		///< Channel Interrupt Control
sfrb ADCA_CH0_INTFLAGS = 0x0223		///< Interrupt Flags
sfrb ADCA_CH0_RESL = 0x0224		///< Channel Result
sfrb ADCA_CH0_RESH = (0x0224+1)	///< Channel Result

/*
 --------------------------------------------------------------------------
 -- DACB - Digital to Analog Converter B
 --------------------------------------------------------------------------
*/


/*
 --------------------------------------------------------------------------
 -- RTC - Real-Time Counter
 --------------------------------------------------------------------------
*/

sfrb RTC_CTRL = 0x0400		///< Control Register
sfrb RTC_STATUS = 0x0401		///< Status Register
sfrb RTC_INTCTRL = 0x0402		///< Interrupt Control Register
sfrb RTC_INTFLAGS = 0x0403		///< Interrupt Flags
sfrb RTC_TEMP = 0x0404		///< Temporary register
sfrb RTC_CNTL = 0x0408		///< Count Register
sfrb RTC_CNTH = (0x0408+1)	///< Count Register
sfrb RTC_PERL = 0x040A		///< Period Register
sfrb RTC_PERH = (0x040A+1)	///< Period Register
sfrb RTC_COMPL = 0x040C		///< Compare Register
sfrb RTC_COMPH = (0x040C+1)	///< Compare Register

/*
 --------------------------------------------------------------------------
 -- TWIC - Two-Wire Interface C
 --------------------------------------------------------------------------
*/

sfrb TWIC_CTRL = 0x0480		///< TWI Common Control Register
sfrb TWIC_MASTER_CTRLA = 0x0481		///< Control Register A
sfrb TWIC_MASTER_CTRLB = 0x0482		///< Control Register B
sfrb TWIC_MASTER_CTRLC = 0x0483		///< Control Register C
sfrb TWIC_MASTER_STATUS = 0x0484		///< Status Register
sfrb TWIC_MASTER_BAUD = 0x0485		///< Baurd Rate Control Register
sfrb TWIC_MASTER_ADDR = 0x0486		///< Address Register
sfrb TWIC_MASTER_DATA = 0x0487		///< Data Register
sfrb TWIC_SLAVE_CTRLA = 0x0488		///< Control Register A
sfrb TWIC_SLAVE_CTRLB = 0x0489		///< Control Register B
sfrb TWIC_SLAVE_STATUS = 0x048A		///< Status Register
sfrb TWIC_SLAVE_ADDR = 0x048B		///< Address Register
sfrb TWIC_SLAVE_DATA = 0x048C		///< Data Register
sfrb TWIC_SLAVE_ADDRMASK = 0x048D		///< Address Mask Register

