dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- TWIE - Two-Wire Interface E
 --------------------------------------------------------------------------
*/

sfrb TWIE_CTRL = 0x04A0		///< TWI Common Control Register
sfrb TWIE_MASTER_CTRLA = 0x04A1		///< Control Register A
sfrb TWIE_MASTER_CTRLB = 0x04A2		///< Control Register B
sfrb TWIE_MASTER_CTRLC = 0x04A3		///< Control Register C
sfrb TWIE_MASTER_STATUS = 0x04A4		///< Status Register
sfrb TWIE_MASTER_BAUD = 0x04A5		///< Baurd Rate Control Register
sfrb TWIE_MASTER_ADDR = 0x04A6		///< Address Register
sfrb TWIE_MASTER_DATA = 0x04A7		///< Data Register
sfrb TWIE_SLAVE_CTRLA = 0x04A8		///< Control Register A
sfrb TWIE_SLAVE_CTRLB = 0x04A9		///< Control Register B
sfrb TWIE_SLAVE_STATUS = 0x04AA		///< Status Register
sfrb TWIE_SLAVE_ADDR = 0x04AB		///< Address Register
sfrb TWIE_SLAVE_DATA = 0x04AC		///< Data Register
sfrb TWIE_SLAVE_ADDRMASK = 0x04AD		///< Address Mask Register

/*
 --------------------------------------------------------------------------
 -- PORT_CFG - Port Configuration
 --------------------------------------------------------------------------
*/

sfrb PORTCFG_MPCMASK = 0x00B0		///< Multi-pin Configuration Mask
sfrb PORTCFG_VPCTRLA = 0x00B2		///< Virtual Port Control Register A
sfrb PORTCFG_VPCTRLB = 0x00B3		///< Virtual Port Control Register B
sfrb PORTCFG_CLKEVOUT = 0x00B4		///< Clock and Event Out Register

/*
 --------------------------------------------------------------------------
 -- VPORT0 - Virtual Port 0
 --------------------------------------------------------------------------
*/

sfrb VPORT0_DIR = 0x0010		///< I/O Port Data Direction
sfrb VPORT0_OUT = 0x0011		///< I/O Port Output
sfrb VPORT0_IN = 0x0012		///< I/O Port Input
sfrb VPORT0_INTFLAGS = 0x0013		///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT1 - Virtual Port 1
 --------------------------------------------------------------------------
*/

sfrb VPORT1_DIR = 0x0014		///< I/O Port Data Direction
sfrb VPORT1_OUT = 0x0015		///< I/O Port Output
sfrb VPORT1_IN = 0x0016		///< I/O Port Input
sfrb VPORT1_INTFLAGS = 0x0017		///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT2 - Virtual Port 2
 --------------------------------------------------------------------------
*/

sfrb VPORT2_DIR = 0x0018		///< I/O Port Data Direction
sfrb VPORT2_OUT = 0x0019		///< I/O Port Output
sfrb VPORT2_IN = 0x001A		///< I/O Port Input
sfrb VPORT2_INTFLAGS = 0x001B		///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT3 - Virtual Port 3
 --------------------------------------------------------------------------
*/

sfrb VPORT3_DIR = 0x001C		///< I/O Port Data Direction
sfrb VPORT3_OUT = 0x001D		///< I/O Port Output
sfrb VPORT3_IN = 0x001E		///< I/O Port Input
sfrb VPORT3_INTFLAGS = 0x001F		///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- PORTA - Port A
 --------------------------------------------------------------------------
*/

sfrb PORTA_DIR = 0x0600		///< I/O Port Data Direction
sfrb PORTA_DIRSET = 0x0601		///< I/O Port Data Direction Set
sfrb PORTA_DIRCLR = 0x0602		///< I/O Port Data Direction Clear
sfrb PORTA_DIRTGL = 0x0603		///< I/O Port Data Direction Toggle
sfrb PORTA_OUT = 0x0604		///< I/O Port Output
sfrb PORTA_OUTSET = 0x0605		///< I/O Port Output Set
sfrb PORTA_OUTCLR = 0x0606		///< I/O Port Output Clear
sfrb PORTA_OUTTGL = 0x0607		///< I/O Port Output Toggle
sfrb PORTA_IN = 0x0608		///< I/O port Input
sfrb PORTA_INTCTRL = 0x0609		///< Interrupt Control Register
sfrb PORTA_INT0MASK = 0x060A		///< Port Interrupt 0 Mask
sfrb PORTA_INT1MASK = 0x060B		///< Port Interrupt 1 Mask
sfrb PORTA_INTFLAGS = 0x060C		///< Interrupt Flag Register
sfrb PORTA_PIN0CTRL = 0x0610		///< Pin 0 Control Register
sfrb PORTA_PIN1CTRL = 0x0611		///< Pin 1 Control Register
sfrb PORTA_PIN2CTRL = 0x0612		///< Pin 2 Control Register
sfrb PORTA_PIN3CTRL = 0x0613		///< Pin 3 Control Register
sfrb PORTA_PIN4CTRL = 0x0614		///< Pin 4 Control Register
sfrb PORTA_PIN5CTRL = 0x0615		///< Pin 5 Control Register
sfrb PORTA_PIN6CTRL = 0x0616		///< Pin 6 Control Register
sfrb PORTA_PIN7CTRL = 0x0617		///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTB - Port B
 --------------------------------------------------------------------------
*/

sfrb PORTB_DIR = 0x0620		///< I/O Port Data Direction
sfrb PORTB_DIRSET = 0x0621		///< I/O Port Data Direction Set
sfrb PORTB_DIRCLR = 0x0622		///< I/O Port Data Direction Clear
sfrb PORTB_DIRTGL = 0x0623		///< I/O Port Data Direction Toggle
sfrb PORTB_OUT = 0x0624		///< I/O Port Output
sfrb PORTB_OUTSET = 0x0625		///< I/O Port Output Set
sfrb PORTB_OUTCLR = 0x0626		///< I/O Port Output Clear
sfrb PORTB_OUTTGL = 0x0627		///< I/O Port Output Toggle
sfrb PORTB_IN = 0x0628		///< I/O port Input
sfrb PORTB_INTCTRL = 0x0629		///< Interrupt Control Register
sfrb PORTB_INT0MASK = 0x062A		///< Port Interrupt 0 Mask
sfrb PORTB_INT1MASK = 0x062B		///< Port Interrupt 1 Mask
sfrb PORTB_INTFLAGS = 0x062C		///< Interrupt Flag Register
sfrb PORTB_PIN0CTRL = 0x0630		///< Pin 0 Control Register
sfrb PORTB_PIN1CTRL = 0x0631		///< Pin 1 Control Register
sfrb PORTB_PIN2CTRL = 0x0632		///< Pin 2 Control Register
sfrb PORTB_PIN3CTRL = 0x0633		///< Pin 3 Control Register
sfrb PORTB_PIN4CTRL = 0x0634		///< Pin 4 Control Register
sfrb PORTB_PIN5CTRL = 0x0635		///< Pin 5 Control Register
sfrb PORTB_PIN6CTRL = 0x0636		///< Pin 6 Control Register
sfrb PORTB_PIN7CTRL = 0x0637		///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTC - Port C
 --------------------------------------------------------------------------
*/

sfrb PORTC_DIR = 0x0640		///< I/O Port Data Direction
sfrb PORTC_DIRSET = 0x0641		///< I/O Port Data Direction Set
sfrb PORTC_DIRCLR = 0x0642		///< I/O Port Data Direction Clear
sfrb PORTC_DIRTGL = 0x0643		///< I/O Port Data Direction Toggle
sfrb PORTC_OUT = 0x0644		///< I/O Port Output
sfrb PORTC_OUTSET = 0x0645		///< I/O Port Output Set
sfrb PORTC_OUTCLR = 0x0646		///< I/O Port Output Clear
sfrb PORTC_OUTTGL = 0x0647		///< I/O Port Output Toggle
sfrb PORTC_IN = 0x0648		///< I/O port Input
sfrb PORTC_INTCTRL = 0x0649		///< Interrupt Control Register
sfrb PORTC_INT0MASK = 0x064A		///< Port Interrupt 0 Mask
sfrb PORTC_INT1MASK = 0x064B		///< Port Interrupt 1 Mask
sfrb PORTC_INTFLAGS = 0x064C		///< Interrupt Flag Register
sfrb PORTC_PIN0CTRL = 0x0650		///< Pin 0 Control Register
sfrb PORTC_PIN1CTRL = 0x0651		///< Pin 1 Control Register
sfrb PORTC_PIN2CTRL = 0x0652		///< Pin 2 Control Register
sfrb PORTC_PIN3CTRL = 0x0653		///< Pin 3 Control Register
sfrb PORTC_PIN4CTRL = 0x0654		///< Pin 4 Control Register
sfrb PORTC_PIN5CTRL = 0x0655		///< Pin 5 Control Register
sfrb PORTC_PIN6CTRL = 0x0656		///< Pin 6 Control Register
sfrb PORTC_PIN7CTRL = 0x0657		///< Pin 7 Control Register

