dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- PORTD - Port D
 --------------------------------------------------------------------------
*/

sfrb PORTD_DIR = 0x0660		///< I/O Port Data Direction
sfrb PORTD_DIRSET = 0x0661		///< I/O Port Data Direction Set
sfrb PORTD_DIRCLR = 0x0662		///< I/O Port Data Direction Clear
sfrb PORTD_DIRTGL = 0x0663		///< I/O Port Data Direction Toggle
sfrb PORTD_OUT = 0x0664		///< I/O Port Output
sfrb PORTD_OUTSET = 0x0665		///< I/O Port Output Set
sfrb PORTD_OUTCLR = 0x0666		///< I/O Port Output Clear
sfrb PORTD_OUTTGL = 0x0667		///< I/O Port Output Toggle
sfrb PORTD_IN = 0x0668		///< I/O port Input
sfrb PORTD_INTCTRL = 0x0669		///< Interrupt Control Register
sfrb PORTD_INT0MASK = 0x066A		///< Port Interrupt 0 Mask
sfrb PORTD_INT1MASK = 0x066B		///< Port Interrupt 1 Mask
sfrb PORTD_INTFLAGS = 0x066C		///< Interrupt Flag Register
sfrb PORTD_PIN0CTRL = 0x0670		///< Pin 0 Control Register
sfrb PORTD_PIN1CTRL = 0x0671		///< Pin 1 Control Register
sfrb PORTD_PIN2CTRL = 0x0672		///< Pin 2 Control Register
sfrb PORTD_PIN3CTRL = 0x0673		///< Pin 3 Control Register
sfrb PORTD_PIN4CTRL = 0x0674		///< Pin 4 Control Register
sfrb PORTD_PIN5CTRL = 0x0675		///< Pin 5 Control Register
sfrb PORTD_PIN6CTRL = 0x0676		///< Pin 6 Control Register
sfrb PORTD_PIN7CTRL = 0x0677		///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTE - Port E
 --------------------------------------------------------------------------
*/

sfrb PORTE_DIR = 0x0680		///< I/O Port Data Direction
sfrb PORTE_DIRSET = 0x0681		///< I/O Port Data Direction Set
sfrb PORTE_DIRCLR = 0x0682		///< I/O Port Data Direction Clear
sfrb PORTE_DIRTGL = 0x0683		///< I/O Port Data Direction Toggle
sfrb PORTE_OUT = 0x0684		///< I/O Port Output
sfrb PORTE_OUTSET = 0x0685		///< I/O Port Output Set
sfrb PORTE_OUTCLR = 0x0686		///< I/O Port Output Clear
sfrb PORTE_OUTTGL = 0x0687		///< I/O Port Output Toggle
sfrb PORTE_IN = 0x0688		///< I/O port Input
sfrb PORTE_INTCTRL = 0x0689		///< Interrupt Control Register
sfrb PORTE_INT0MASK = 0x068A		///< Port Interrupt 0 Mask
sfrb PORTE_INT1MASK = 0x068B		///< Port Interrupt 1 Mask
sfrb PORTE_INTFLAGS = 0x068C		///< Interrupt Flag Register
sfrb PORTE_PIN0CTRL = 0x0690		///< Pin 0 Control Register
sfrb PORTE_PIN1CTRL = 0x0691		///< Pin 1 Control Register
sfrb PORTE_PIN2CTRL = 0x0692		///< Pin 2 Control Register
sfrb PORTE_PIN3CTRL = 0x0693		///< Pin 3 Control Register
sfrb PORTE_PIN4CTRL = 0x0694		///< Pin 4 Control Register
sfrb PORTE_PIN5CTRL = 0x0695		///< Pin 5 Control Register
sfrb PORTE_PIN6CTRL = 0x0696		///< Pin 6 Control Register
sfrb PORTE_PIN7CTRL = 0x0697		///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTR - Port R
 --------------------------------------------------------------------------
*/

sfrb PORTR_DIR = 0x07E0		///< I/O Port Data Direction
sfrb PORTR_DIRSET = 0x07E1		///< I/O Port Data Direction Set
sfrb PORTR_DIRCLR = 0x07E2		///< I/O Port Data Direction Clear
sfrb PORTR_DIRTGL = 0x07E3		///< I/O Port Data Direction Toggle
sfrb PORTR_OUT = 0x07E4		///< I/O Port Output
sfrb PORTR_OUTSET = 0x07E5		///< I/O Port Output Set
sfrb PORTR_OUTCLR = 0x07E6		///< I/O Port Output Clear
sfrb PORTR_OUTTGL = 0x07E7		///< I/O Port Output Toggle
sfrb PORTR_IN = 0x07E8		///< I/O port Input
sfrb PORTR_INTCTRL = 0x07E9		///< Interrupt Control Register
sfrb PORTR_INT0MASK = 0x07EA		///< Port Interrupt 0 Mask
sfrb PORTR_INT1MASK = 0x07EB		///< Port Interrupt 1 Mask
sfrb PORTR_INTFLAGS = 0x07EC		///< Interrupt Flag Register
sfrb PORTR_PIN0CTRL = 0x07F0		///< Pin 0 Control Register
sfrb PORTR_PIN1CTRL = 0x07F1		///< Pin 1 Control Register
sfrb PORTR_PIN2CTRL = 0x07F2		///< Pin 2 Control Register
sfrb PORTR_PIN3CTRL = 0x07F3		///< Pin 3 Control Register
sfrb PORTR_PIN4CTRL = 0x07F4		///< Pin 4 Control Register
sfrb PORTR_PIN5CTRL = 0x07F5		///< Pin 5 Control Register
sfrb PORTR_PIN6CTRL = 0x07F6		///< Pin 6 Control Register
sfrb PORTR_PIN7CTRL = 0x07F7		///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- TCC0 - Timer/Counter C0
 --------------------------------------------------------------------------
*/

sfrb TCC0_CTRLA = 0x0800		///< Control  Register A
sfrb TCC0_CTRLB = 0x0801		///< Control Register B
sfrb TCC0_CTRLC = 0x0802		///< Control register C
sfrb TCC0_CTRLD = 0x0803		///< Control Register D
sfrb TCC0_CTRLE = 0x0804		///< Control Register E
sfrb TCC0_INTCTRLA = 0x0806		///< Interrupt Control Register A
sfrb TCC0_INTCTRLB = 0x0807		///< Interrupt Control Register B
sfrb TCC0_CTRLFCLR = 0x0808		///< Control Register F Clear
sfrb TCC0_CTRLFSET = 0x0809		///< Control Register F Set
sfrb TCC0_CTRLGCLR = 0x080A		///< Control Register G Clear
sfrb TCC0_CTRLGSET = 0x080B		///< Control Register G Set
sfrb TCC0_INTFLAGS = 0x080C		///< Interrupt Flag Register
sfrb TCC0_TEMP = 0x080F		///< Temporary Register For 16-bit Access
sfrb TCC0_CNTL = 0x0820		///< Count
sfrb TCC0_CNTH = (0x0820+1)	///< Count
sfrb TCC0_PERL = 0x0826		///< Period
sfrb TCC0_PERH = (0x0826+1)	///< Period
sfrb TCC0_CCAL = 0x0828		///< Compare or Capture A
sfrb TCC0_CCAH = (0x0828+1)	///< Compare or Capture A
sfrb TCC0_CCBL = 0x082A		///< Compare or Capture B
sfrb TCC0_CCBH = (0x082A+1)	///< Compare or Capture B
sfrb TCC0_CCCL = 0x082C		///< Compare or Capture C
sfrb TCC0_CCCH = (0x082C+1)	///< Compare or Capture C
sfrb TCC0_CCDL = 0x082E		///< Compare or Capture D
sfrb TCC0_CCDH = (0x082E+1)	///< Compare or Capture D
sfrb TCC0_PERBUFL = 0x0836		///< Period Buffer
sfrb TCC0_PERBUFH = (0x0836+1)	///< Period Buffer
sfrb TCC0_CCABUFL = 0x0838		///< Compare Or Capture A Buffer
sfrb TCC0_CCABUFH = (0x0838+1)	///< Compare Or Capture A Buffer
sfrb TCC0_CCBBUFL = 0x083A		///< Compare Or Capture B Buffer
sfrb TCC0_CCBBUFH = (0x083A+1)	///< Compare Or Capture B Buffer
sfrb TCC0_CCCBUFL = 0x083C		///< Compare Or Capture C Buffer
sfrb TCC0_CCCBUFH = (0x083C+1)	///< Compare Or Capture C Buffer
sfrb TCC0_CCDBUFL = 0x083E		///< Compare Or Capture D Buffer
sfrb TCC0_CCDBUFH = (0x083E+1)	///< Compare Or Capture D Buffer

