dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- TCC1 - Timer/Counter C1
 --------------------------------------------------------------------------
*/

sfrb TCC1_CTRLA = 0x0840		///< Control  Register A
sfrb TCC1_CTRLB = 0x0841		///< Control Register B
sfrb TCC1_CTRLC = 0x0842		///< Control register C
sfrb TCC1_CTRLD = 0x0843		///< Control Register D
sfrb TCC1_CTRLE = 0x0844		///< Control Register E
sfrb TCC1_INTCTRLA = 0x0846		///< Interrupt Control Register A
sfrb TCC1_INTCTRLB = 0x0847		///< Interrupt Control Register B
sfrb TCC1_CTRLFCLR = 0x0848		///< Control Register F Clear
sfrb TCC1_CTRLFSET = 0x0849		///< Control Register F Set
sfrb TCC1_CTRLGCLR = 0x084A		///< Control Register G Clear
sfrb TCC1_CTRLGSET = 0x084B		///< Control Register G Set
sfrb TCC1_INTFLAGS = 0x084C		///< Interrupt Flag Register
sfrb TCC1_TEMP = 0x084F		///< Temporary Register For 16-bit Access
sfrb TCC1_CNTL = 0x0860		///< Count
sfrb TCC1_CNTH = (0x0860+1)	///< Count
sfrb TCC1_PERL = 0x0866		///< Period
sfrb TCC1_PERH = (0x0866+1)	///< Period
sfrb TCC1_CCAL = 0x0868		///< Compare or Capture A
sfrb TCC1_CCAH = (0x0868+1)	///< Compare or Capture A
sfrb TCC1_CCBL = 0x086A		///< Compare or Capture B
sfrb TCC1_CCBH = (0x086A+1)	///< Compare or Capture B
sfrb TCC1_PERBUFL = 0x0876		///< Period Buffer
sfrb TCC1_PERBUFH = (0x0876+1)	///< Period Buffer
sfrb TCC1_CCABUFL = 0x0878		///< Compare Or Capture A Buffer
sfrb TCC1_CCABUFH = (0x0878+1)	///< Compare Or Capture A Buffer
sfrb TCC1_CCBBUFL = 0x087A		///< Compare Or Capture B Buffer
sfrb TCC1_CCBBUFH = (0x087A+1)	///< Compare Or Capture B Buffer

/*
 --------------------------------------------------------------------------
 -- AWEXC - Advanced Waveform Extension C
 --------------------------------------------------------------------------
*/

sfrb AWEXC_CTRL = 0x0880		///< Control Register
sfrb AWEXC_FDEMASK = 0x0882		///< Fault Detection Event Mask
sfrb AWEXC_FDCTRL = 0x0883		///< Fault Detection Control Register
sfrb AWEXC_STATUS = 0x0884		///< Status Register
sfrb AWEXC_DTBOTH = 0x0886		///< Dead Time Both Sides
sfrb AWEXC_DTBOTHBUF = 0x0887		///< Dead Time Both Sides Buffer
sfrb AWEXC_DTLS = 0x0888		///< Dead Time Low Side
sfrb AWEXC_DTHS = 0x0889		///< Dead Time High Side
sfrb AWEXC_DTLSBUF = 0x088A		///< Dead Time Low Side Buffer
sfrb AWEXC_DTHSBUF = 0x088B		///< Dead Time High Side Buffer
sfrb AWEXC_OUTOVEN = 0x088C		///< Output Override Enable

/*
 --------------------------------------------------------------------------
 -- HIRESC - High-Resolution Extension C
 --------------------------------------------------------------------------
*/

sfrb HIRESC_CTRLA = 0x0890		///< Control Register

/*
 --------------------------------------------------------------------------
 -- USARTC0 - Universal Asynchronous Receiver-Transmitter C0
 --------------------------------------------------------------------------
*/

sfrb USARTC0_DATA = 0x08A0		///< Data Register
sfrb USARTC0_STATUS = 0x08A1		///< Status Register
sfrb USARTC0_CTRLA = 0x08A3		///< Control Register A
sfrb USARTC0_CTRLB = 0x08A4		///< Control Register B
sfrb USARTC0_CTRLC = 0x08A5		///< Control Register C
sfrb USARTC0_BAUDCTRLA = 0x08A6		///< Baud Rate Control Register A
sfrb USARTC0_BAUDCTRLB = 0x08A7		///< Baud Rate Control Register B

/*
 --------------------------------------------------------------------------
 -- SPIC - Serial Peripheral Interface C
 --------------------------------------------------------------------------
*/

sfrb SPIC_CTRL = 0x08C0		///< Control Register
sfrb SPIC_INTCTRL = 0x08C1		///< Interrupt Control Register
sfrb SPIC_STATUS = 0x08C2		///< Status Register
sfrb SPIC_DATA = 0x08C3		///< Data Register

/*
 --------------------------------------------------------------------------
 -- TCD0 - Timer/Counter D0
 --------------------------------------------------------------------------
*/

sfrb TCD0_CTRLA = 0x0900		///< Control  Register A
sfrb TCD0_CTRLB = 0x0901		///< Control Register B
sfrb TCD0_CTRLC = 0x0902		///< Control register C
sfrb TCD0_CTRLD = 0x0903		///< Control Register D
sfrb TCD0_CTRLE = 0x0904		///< Control Register E
sfrb TCD0_INTCTRLA = 0x0906		///< Interrupt Control Register A
sfrb TCD0_INTCTRLB = 0x0907		///< Interrupt Control Register B
sfrb TCD0_CTRLFCLR = 0x0908		///< Control Register F Clear
sfrb TCD0_CTRLFSET = 0x0909		///< Control Register F Set
sfrb TCD0_CTRLGCLR = 0x090A		///< Control Register G Clear
sfrb TCD0_CTRLGSET = 0x090B		///< Control Register G Set
sfrb TCD0_INTFLAGS = 0x090C		///< Interrupt Flag Register
sfrb TCD0_TEMP = 0x090F		///< Temporary Register For 16-bit Access
sfrb TCD0_CNTL = 0x0920		///< Count
sfrb TCD0_CNTH = (0x0920+1)	///< Count
sfrb TCD0_PERL = 0x0926		///< Period
sfrb TCD0_PERH = (0x0926+1)	///< Period
sfrb TCD0_CCAL = 0x0928		///< Compare or Capture A
sfrb TCD0_CCAH = (0x0928+1)	///< Compare or Capture A
sfrb TCD0_CCBL = 0x092A		///< Compare or Capture B
sfrb TCD0_CCBH = (0x092A+1)	///< Compare or Capture B
sfrb TCD0_CCCL = 0x092C		///< Compare or Capture C
sfrb TCD0_CCCH = (0x092C+1)	///< Compare or Capture C
sfrb TCD0_CCDL = 0x092E		///< Compare or Capture D
sfrb TCD0_CCDH = (0x092E+1)	///< Compare or Capture D
sfrb TCD0_PERBUFL = 0x0936		///< Period Buffer
sfrb TCD0_PERBUFH = (0x0936+1)	///< Period Buffer
sfrb TCD0_CCABUFL = 0x0938		///< Compare Or Capture A Buffer
sfrb TCD0_CCABUFH = (0x0938+1)	///< Compare Or Capture A Buffer
sfrb TCD0_CCBBUFL = 0x093A		///< Compare Or Capture B Buffer
sfrb TCD0_CCBBUFH = (0x093A+1)	///< Compare Or Capture B Buffer
sfrb TCD0_CCCBUFL = 0x093C		///< Compare Or Capture C Buffer
sfrb TCD0_CCCBUFH = (0x093C+1)	///< Compare Or Capture C Buffer
sfrb TCD0_CCDBUFL = 0x093E		///< Compare Or Capture D Buffer
sfrb TCD0_CCDBUFH = (0x093E+1)	///< Compare Or Capture D Buffer

/*
 --------------------------------------------------------------------------
 -- USARTD0 - Universal Asynchronous Receiver-Transmitter D0
 --------------------------------------------------------------------------
*/

sfrb USARTD0_DATA = 0x09A0		///< Data Register
sfrb USARTD0_STATUS = 0x09A1		///< Status Register
sfrb USARTD0_CTRLA = 0x09A3		///< Control Register A
sfrb USARTD0_CTRLB = 0x09A4		///< Control Register B
sfrb USARTD0_CTRLC = 0x09A5		///< Control Register C
sfrb USARTD0_BAUDCTRLA = 0x09A6		///< Baud Rate Control Register A
sfrb USARTD0_BAUDCTRLB = 0x09A7		///< Baud Rate Control Register B

