dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- SPID - Serial Peripheral Interface D
 --------------------------------------------------------------------------
*/

sfrb SPID_CTRL = 0x09C0		///< Control Register
sfrb SPID_INTCTRL = 0x09C1		///< Interrupt Control Register
sfrb SPID_STATUS = 0x09C2		///< Status Register
sfrb SPID_DATA = 0x09C3		///< Data Register

/*
 --------------------------------------------------------------------------
 -- TCE0 - Timer/Counter E0
 --------------------------------------------------------------------------
*/

sfrb TCE0_CTRLA = 0x0A00		///< Control  Register A
sfrb TCE0_CTRLB = 0x0A01		///< Control Register B
sfrb TCE0_CTRLC = 0x0A02		///< Control register C
sfrb TCE0_CTRLD = 0x0A03		///< Control Register D
sfrb TCE0_CTRLE = 0x0A04		///< Control Register E
sfrb TCE0_INTCTRLA = 0x0A06		///< Interrupt Control Register A
sfrb TCE0_INTCTRLB = 0x0A07		///< Interrupt Control Register B
sfrb TCE0_CTRLFCLR = 0x0A08		///< Control Register F Clear
sfrb TCE0_CTRLFSET = 0x0A09		///< Control Register F Set
sfrb TCE0_CTRLGCLR = 0x0A0A		///< Control Register G Clear
sfrb TCE0_CTRLGSET = 0x0A0B		///< Control Register G Set
sfrb TCE0_INTFLAGS = 0x0A0C		///< Interrupt Flag Register
sfrb TCE0_TEMP = 0x0A0F		///< Temporary Register For 16-bit Access
sfrb TCE0_CNTL = 0x0A20		///< Count
sfrb TCE0_CNTH = (0x0A20+1)	///< Count
sfrb TCE0_PERL = 0x0A26		///< Period
sfrb TCE0_PERH = (0x0A26+1)	///< Period
sfrb TCE0_CCAL = 0x0A28		///< Compare or Capture A
sfrb TCE0_CCAH = (0x0A28+1)	///< Compare or Capture A
sfrb TCE0_CCBL = 0x0A2A		///< Compare or Capture B
sfrb TCE0_CCBH = (0x0A2A+1)	///< Compare or Capture B
sfrb TCE0_CCCL = 0x0A2C		///< Compare or Capture C
sfrb TCE0_CCCH = (0x0A2C+1)	///< Compare or Capture C
sfrb TCE0_CCDL = 0x0A2E		///< Compare or Capture D
sfrb TCE0_CCDH = (0x0A2E+1)	///< Compare or Capture D
sfrb TCE0_PERBUFL = 0x0A36		///< Period Buffer
sfrb TCE0_PERBUFH = (0x0A36+1)	///< Period Buffer
sfrb TCE0_CCABUFL = 0x0A38		///< Compare Or Capture A Buffer
sfrb TCE0_CCABUFH = (0x0A38+1)	///< Compare Or Capture A Buffer
sfrb TCE0_CCBBUFL = 0x0A3A		///< Compare Or Capture B Buffer
sfrb TCE0_CCBBUFH = (0x0A3A+1)	///< Compare Or Capture B Buffer
sfrb TCE0_CCCBUFL = 0x0A3C		///< Compare Or Capture C Buffer
sfrb TCE0_CCCBUFH = (0x0A3C+1)	///< Compare Or Capture C Buffer
sfrb TCE0_CCDBUFL = 0x0A3E		///< Compare Or Capture D Buffer
sfrb TCE0_CCDBUFH = (0x0A3E+1)	///< Compare Or Capture D Buffer

/*
 --------------------------------------------------------------------------
 -- IRCOM - IR Communication Module
 --------------------------------------------------------------------------
*/

sfrb IRCOM_CTRL = 0x08F8		///< Control Register
sfrb IRCOM_TXPLCTRL = 0x08F9		///< IrDA Transmitter Pulse Length Control Register
sfrb IRCOM_RXPLCTRL = 0x08FA		///< IrDA Receiver Pulse Length Control Register


#endif // defined(__IAR_SYSTEMS_ASM__)



#if defined(__IAR_SYSTEMS_ICC__)

/*
 ---------------------------------------------------------------------------
 ---------------------------------------------------------------------------
 --
 -- Fully qualified IO register names for use with the compiler
 --
 ----------------------------------------------------------------------------
 ----------------------------------------------------------------------------
*/



/*
 --------------------------------------------------------------------------
 -- OCD - On-Chip Debug System
 --------------------------------------------------------------------------
*/

#define OCD_OCDR0	OCD.OCDR0	///< OCD Register 0
#define OCD_OCDR1	OCD.OCDR1	///< OCD Register 1

/*
 --------------------------------------------------------------------------
 -- CLK - Clock System
 --------------------------------------------------------------------------
*/

#define CLK_CTRL	CLK.CTRL	///< Control Register
#define CLK_PSCTRL	CLK.PSCTRL	///< Prescaler Control Register
#define CLK_LOCK	CLK.LOCK	///< Lock register
#define CLK_RTCCTRL	CLK.RTCCTRL	///< RTC Control Register

/*
 --------------------------------------------------------------------------
 -- SLEEP - Sleep Controller
 --------------------------------------------------------------------------
*/

#define SLEEP_CTRL	SLEEP.CTRL	///< Control Register

/*
 --------------------------------------------------------------------------
 -- OSC - Oscillator Control
 --------------------------------------------------------------------------
*/

#define OSC_CTRL	OSC.CTRL	///< Control Register
#define OSC_STATUS	OSC.STATUS	///< Status Register
#define OSC_XOSCCTRL	OSC.XOSCCTRL	///< External Oscillator Control Register
#define OSC_XOSCFAIL	OSC.XOSCFAIL	///< External Oscillator Failure Detection Register
#define OSC_RC32KCAL	OSC.RC32KCAL	///< 32kHz Internal Oscillator Calibration Register
#define OSC_PLLCTRL	OSC.PLLCTRL	///< PLL Control REgister
#define OSC_DFLLCTRL	OSC.DFLLCTRL	///< DFLL Control Register

/*
 --------------------------------------------------------------------------
 -- DFLLRC32M - DFLL for 32MHz RC Oscillator
 --------------------------------------------------------------------------
*/

#define DFLLRC32M_CTRL	DFLLRC32M.CTRL	///< Control Register
#define DFLLRC32M_CALA	DFLLRC32M.CALA	///< Calibration Register A
#define DFLLRC32M_CALB	DFLLRC32M.CALB	///< Calibration Register B
#define DFLLRC32M_COMP0	DFLLRC32M.COMP0	///< Oscillator Compare Register 0
#define DFLLRC32M_COMP1	DFLLRC32M.COMP1	///< Oscillator Compare Register 1
#define DFLLRC32M_COMP2	DFLLRC32M.COMP2	///< Oscillator Compare Register 2

/*
 --------------------------------------------------------------------------
 -- DFLLRC2M - DFLL for 2MHz RC Oscillator
 --------------------------------------------------------------------------
*/

#define DFLLRC2M_CTRL	DFLLRC2M.CTRL	///< Control Register
#define DFLLRC2M_CALA	DFLLRC2M.CALA	///< Calibration Register A
#define DFLLRC2M_CALB	DFLLRC2M.CALB	///< Calibration Register B
#define DFLLRC2M_COMP0	DFLLRC2M.COMP0	///< Oscillator Compare Register 0
#define DFLLRC2M_COMP1	DFLLRC2M.COMP1	///< Oscillator Compare Register 1
#define DFLLRC2M_COMP2	DFLLRC2M.COMP2	///< Oscillator Compare Register 2

