dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- PR - Power Reduction
 --------------------------------------------------------------------------
*/

#define PR_PRGEN	PR.PRGEN	///< General Power Reduction
#define PR_PRPA	PR.PRPA	///< Power Reduction Port A
#define PR_PRPB	PR.PRPB	///< Power Reduction Port B
#define PR_PRPC	PR.PRPC	///< Power Reduction Port C
#define PR_PRPD	PR.PRPD	///< Power Reduction Port D
#define PR_PRPE	PR.PRPE	///< Power Reduction Port E
#define PR_PRPF	PR.PRPF	///< Power Reduction Port F

/*
 --------------------------------------------------------------------------
 -- RST - Reset Controller
 --------------------------------------------------------------------------
*/

#define RST_STATUS	RST.STATUS	///< Status Register
#define RST_CTRL	RST.CTRL	///< Control Register

/*
 --------------------------------------------------------------------------
 -- WDT - Watch-Dog Timer
 --------------------------------------------------------------------------
*/

#define WDT_CTRL	WDT.CTRL	///< Control
#define WDT_WINCTRL	WDT.WINCTRL	///< Windowed Mode Control
#define WDT_STATUS	WDT.STATUS	///< Status

/*
 --------------------------------------------------------------------------
 -- MCU - MCU Control
 --------------------------------------------------------------------------
*/

#define MCU_DEVID0	MCU.DEVID0	///< Device ID byte 0
#define MCU_DEVID1	MCU.DEVID1	///< Device ID byte 1
#define MCU_DEVID2	MCU.DEVID2	///< Device ID byte 2
#define MCU_REVID	MCU.REVID	///< Revision ID
#define MCU_JTAGUID	MCU.JTAGUID	///< JTAG User ID
#define MCU_MCUCR	MCU.MCUCR	///< MCU Control
#define MCU_EVSYSLOCK	MCU.EVSYSLOCK	///< Event System Lock
#define MCU_AWEXLOCK	MCU.AWEXLOCK	///< AWEX Lock

/*
 --------------------------------------------------------------------------
 -- PMIC - Programmable Interrupt Controller
 --------------------------------------------------------------------------
*/

#define PMIC_STATUS	PMIC.STATUS	///< Status Register
#define PMIC_INTPRI	PMIC.INTPRI	///< Interrupt Priority
#define PMIC_CTRL	PMIC.CTRL	///< Control Register

/*
 --------------------------------------------------------------------------
 -- EVSYS - Event System
 --------------------------------------------------------------------------
*/

#define EVSYS_CH0MUX	EVSYS.CH0MUX	///< Event Channel 0 Multiplexer
#define EVSYS_CH1MUX	EVSYS.CH1MUX	///< Event Channel 1 Multiplexer
#define EVSYS_CH2MUX	EVSYS.CH2MUX	///< Event Channel 2 Multiplexer
#define EVSYS_CH3MUX	EVSYS.CH3MUX	///< Event Channel 3 Multiplexer
#define EVSYS_CH0CTRL	EVSYS.CH0CTRL	///< Channel 0 Control Register
#define EVSYS_CH1CTRL	EVSYS.CH1CTRL	///< Channel 1 Control Register
#define EVSYS_CH2CTRL	EVSYS.CH2CTRL	///< Channel 2 Control Register
#define EVSYS_CH3CTRL	EVSYS.CH3CTRL	///< Channel 3 Control Register
#define EVSYS_STROBE	EVSYS.STROBE	///< Event Strobe
#define EVSYS_DATA	EVSYS.DATA	///< Event Data

/*
 --------------------------------------------------------------------------
 -- NVM - Non Volatile Memory
 --------------------------------------------------------------------------
*/

#define NVM_ADDR0	NVM.ADDR0	///< Address Register 0
#define NVM_ADDR1	NVM.ADDR1	///< Address Register 1
#define NVM_ADDR2	NVM.ADDR2	///< Address Register 2
#define NVM_DATA0	NVM.DATA0	///< Data Register 0
#define NVM_DATA1	NVM.DATA1	///< Data Register 1
#define NVM_DATA2	NVM.DATA2	///< Data Register 2
#define NVM_CMD	NVM.CMD	///< Command
#define NVM_CTRLA	NVM.CTRLA	///< Control Register A
#define NVM_CTRLB	NVM.CTRLB	///< Control Register B
#define NVM_INTCTRL	NVM.INTCTRL	///< Interrupt Control
#define NVM_STATUS	NVM.STATUS	///< Status
#define NVM_LOCKBITS	NVM.LOCKBITS	///< Lock Bits

/*
 --------------------------------------------------------------------------
 -- ACA - Analog Comparator A
 --------------------------------------------------------------------------
*/

#define ACA_AC0CTRL	ACA.AC0CTRL	///< Comparator 0 Control
#define ACA_AC1CTRL	ACA.AC1CTRL	///< Comparator 1 Control
#define ACA_AC0MUXCTRL	ACA.AC0MUXCTRL	///< Comparator 0 MUX Control
#define ACA_AC1MUXCTRL	ACA.AC1MUXCTRL	///< Comparator 1 MUX Control
#define ACA_CTRLA	ACA.CTRLA	///< Control Register A
#define ACA_CTRLB	ACA.CTRLB	///< Control Register B
#define ACA_WINCTRL	ACA.WINCTRL	///< Window Mode Control
#define ACA_STATUS	ACA.STATUS	///< Status

/*
 --------------------------------------------------------------------------
 -- ADCA - Analog to Digital Converter A
 --------------------------------------------------------------------------
*/

#define ADCA_CTRLA	ADCA.CTRLA	///< Control Register A
#define ADCA_CTRLB	ADCA.CTRLB	///< Control Register B
#define ADCA_REFCTRL	ADCA.REFCTRL	///< Reference Control
#define ADCA_EVCTRL	ADCA.EVCTRL	///< Event Control
#define ADCA_PRESCALER	ADCA.PRESCALER	///< Clock Prescaler
#define ADCA_INTFLAGS	ADCA.INTFLAGS	///< Interrupt Flags
#define ADCA_TEMP	ADCA.TEMP	///< ACD Temporary Register
#define ADCA_CAL	ADCA.CAL	///< Calibration Value
#define ADCA_CH0RES	ADCA.CH0RES	///< Channel 0 Result
#define ADCA_CMP	ADCA.CMP	///< Compare Value
#define ADCA_CH0_CTRL	ADCA.CH0.CTRL	///< Control Register
#define ADCA_CH0_MUXCTRL	ADCA.CH0.MUXCTRL	///< MUX Control
#define ADCA_CH0_INTCTRL	ADCA.CH0.INTCTRL	///< Channel Interrupt Control
#define ADCA_CH0_INTFLAGS	ADCA.CH0.INTFLAGS	///< Interrupt Flags
#define ADCA_CH0_RES	ADCA.CH0.RES	///< Channel Result

/*
 --------------------------------------------------------------------------
 -- DACB - Digital to Analog Converter B
 --------------------------------------------------------------------------
*/


/*
 --------------------------------------------------------------------------
 -- RTC - Real-Time Counter
 --------------------------------------------------------------------------
*/

#define RTC_CTRL	RTC.CTRL	///< Control Register
#define RTC_STATUS	RTC.STATUS	///< Status Register
#define RTC_INTCTRL	RTC.INTCTRL	///< Interrupt Control Register
#define RTC_INTFLAGS	RTC.INTFLAGS	///< Interrupt Flags
#define RTC_TEMP	RTC.TEMP	///< Temporary register
#define RTC_CNT	RTC.CNT	///< Count Register
#define RTC_PER	RTC.PER	///< Period Register
#define RTC_COMP	RTC.COMP	///< Compare Register

