dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- TWIC - Two-Wire Interface C
 --------------------------------------------------------------------------
*/

#define TWIC_CTRL	TWIC.CTRL	///< TWI Common Control Register
#define TWIC_MASTER_CTRLA	TWIC.MASTER.CTRLA	///< Control Register A
#define TWIC_MASTER_CTRLB	TWIC.MASTER.CTRLB	///< Control Register B
#define TWIC_MASTER_CTRLC	TWIC.MASTER.CTRLC	///< Control Register C
#define TWIC_MASTER_STATUS	TWIC.MASTER.STATUS	///< Status Register
#define TWIC_MASTER_BAUD	TWIC.MASTER.BAUD	///< Baurd Rate Control Register
#define TWIC_MASTER_ADDR	TWIC.MASTER.ADDR	///< Address Register
#define TWIC_MASTER_DATA	TWIC.MASTER.DATA	///< Data Register
#define TWIC_SLAVE_CTRLA	TWIC.SLAVE.CTRLA	///< Control Register A
#define TWIC_SLAVE_CTRLB	TWIC.SLAVE.CTRLB	///< Control Register B
#define TWIC_SLAVE_STATUS	TWIC.SLAVE.STATUS	///< Status Register
#define TWIC_SLAVE_ADDR	TWIC.SLAVE.ADDR	///< Address Register
#define TWIC_SLAVE_DATA	TWIC.SLAVE.DATA	///< Data Register
#define TWIC_SLAVE_ADDRMASK	TWIC.SLAVE.ADDRMASK	///< Address Mask Register

/*
 --------------------------------------------------------------------------
 -- TWIE - Two-Wire Interface E
 --------------------------------------------------------------------------
*/

#define TWIE_CTRL	TWIE.CTRL	///< TWI Common Control Register
#define TWIE_MASTER_CTRLA	TWIE.MASTER.CTRLA	///< Control Register A
#define TWIE_MASTER_CTRLB	TWIE.MASTER.CTRLB	///< Control Register B
#define TWIE_MASTER_CTRLC	TWIE.MASTER.CTRLC	///< Control Register C
#define TWIE_MASTER_STATUS	TWIE.MASTER.STATUS	///< Status Register
#define TWIE_MASTER_BAUD	TWIE.MASTER.BAUD	///< Baurd Rate Control Register
#define TWIE_MASTER_ADDR	TWIE.MASTER.ADDR	///< Address Register
#define TWIE_MASTER_DATA	TWIE.MASTER.DATA	///< Data Register
#define TWIE_SLAVE_CTRLA	TWIE.SLAVE.CTRLA	///< Control Register A
#define TWIE_SLAVE_CTRLB	TWIE.SLAVE.CTRLB	///< Control Register B
#define TWIE_SLAVE_STATUS	TWIE.SLAVE.STATUS	///< Status Register
#define TWIE_SLAVE_ADDR	TWIE.SLAVE.ADDR	///< Address Register
#define TWIE_SLAVE_DATA	TWIE.SLAVE.DATA	///< Data Register
#define TWIE_SLAVE_ADDRMASK	TWIE.SLAVE.ADDRMASK	///< Address Mask Register

/*
 --------------------------------------------------------------------------
 -- PORT_CFG - Port Configuration
 --------------------------------------------------------------------------
*/

#define PORTCFG_MPCMASK	PORTCFG.MPCMASK	///< Multi-pin Configuration Mask
#define PORTCFG_VPCTRLA	PORTCFG.VPCTRLA	///< Virtual Port Control Register A
#define PORTCFG_VPCTRLB	PORTCFG.VPCTRLB	///< Virtual Port Control Register B
#define PORTCFG_CLKEVOUT	PORTCFG.CLKEVOUT	///< Clock and Event Out Register

/*
 --------------------------------------------------------------------------
 -- VPORT0 - Virtual Port 0
 --------------------------------------------------------------------------
*/

#define VPORT0_DIR	VPORT0.DIR	///< I/O Port Data Direction
#define VPORT0_OUT	VPORT0.OUT	///< I/O Port Output
#define VPORT0_IN	VPORT0.IN	///< I/O Port Input
#define VPORT0_INTFLAGS	VPORT0.INTFLAGS	///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT1 - Virtual Port 1
 --------------------------------------------------------------------------
*/

#define VPORT1_DIR	VPORT1.DIR	///< I/O Port Data Direction
#define VPORT1_OUT	VPORT1.OUT	///< I/O Port Output
#define VPORT1_IN	VPORT1.IN	///< I/O Port Input
#define VPORT1_INTFLAGS	VPORT1.INTFLAGS	///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT2 - Virtual Port 2
 --------------------------------------------------------------------------
*/

#define VPORT2_DIR	VPORT2.DIR	///< I/O Port Data Direction
#define VPORT2_OUT	VPORT2.OUT	///< I/O Port Output
#define VPORT2_IN	VPORT2.IN	///< I/O Port Input
#define VPORT2_INTFLAGS	VPORT2.INTFLAGS	///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- VPORT3 - Virtual Port 3
 --------------------------------------------------------------------------
*/

#define VPORT3_DIR	VPORT3.DIR	///< I/O Port Data Direction
#define VPORT3_OUT	VPORT3.OUT	///< I/O Port Output
#define VPORT3_IN	VPORT3.IN	///< I/O Port Input
#define VPORT3_INTFLAGS	VPORT3.INTFLAGS	///< Interrupt Flag Register

/*
 --------------------------------------------------------------------------
 -- PORTA - Port A
 --------------------------------------------------------------------------
*/

#define PORTA_DIR	PORTA.DIR	///< I/O Port Data Direction
#define PORTA_DIRSET	PORTA.DIRSET	///< I/O Port Data Direction Set
#define PORTA_DIRCLR	PORTA.DIRCLR	///< I/O Port Data Direction Clear
#define PORTA_DIRTGL	PORTA.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTA_OUT	PORTA.OUT	///< I/O Port Output
#define PORTA_OUTSET	PORTA.OUTSET	///< I/O Port Output Set
#define PORTA_OUTCLR	PORTA.OUTCLR	///< I/O Port Output Clear
#define PORTA_OUTTGL	PORTA.OUTTGL	///< I/O Port Output Toggle
#define PORTA_IN	PORTA.IN	///< I/O port Input
#define PORTA_INTCTRL	PORTA.INTCTRL	///< Interrupt Control Register
#define PORTA_INT0MASK	PORTA.INT0MASK	///< Port Interrupt 0 Mask
#define PORTA_INT1MASK	PORTA.INT1MASK	///< Port Interrupt 1 Mask
#define PORTA_INTFLAGS	PORTA.INTFLAGS	///< Interrupt Flag Register
#define PORTA_PIN0CTRL	PORTA.PIN0CTRL	///< Pin 0 Control Register
#define PORTA_PIN1CTRL	PORTA.PIN1CTRL	///< Pin 1 Control Register
#define PORTA_PIN2CTRL	PORTA.PIN2CTRL	///< Pin 2 Control Register
#define PORTA_PIN3CTRL	PORTA.PIN3CTRL	///< Pin 3 Control Register
#define PORTA_PIN4CTRL	PORTA.PIN4CTRL	///< Pin 4 Control Register
#define PORTA_PIN5CTRL	PORTA.PIN5CTRL	///< Pin 5 Control Register
#define PORTA_PIN6CTRL	PORTA.PIN6CTRL	///< Pin 6 Control Register
#define PORTA_PIN7CTRL	PORTA.PIN7CTRL	///< Pin 7 Control Register

