dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- PORTB - Port B
 --------------------------------------------------------------------------
*/

#define PORTB_DIR	PORTB.DIR	///< I/O Port Data Direction
#define PORTB_DIRSET	PORTB.DIRSET	///< I/O Port Data Direction Set
#define PORTB_DIRCLR	PORTB.DIRCLR	///< I/O Port Data Direction Clear
#define PORTB_DIRTGL	PORTB.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTB_OUT	PORTB.OUT	///< I/O Port Output
#define PORTB_OUTSET	PORTB.OUTSET	///< I/O Port Output Set
#define PORTB_OUTCLR	PORTB.OUTCLR	///< I/O Port Output Clear
#define PORTB_OUTTGL	PORTB.OUTTGL	///< I/O Port Output Toggle
#define PORTB_IN	PORTB.IN	///< I/O port Input
#define PORTB_INTCTRL	PORTB.INTCTRL	///< Interrupt Control Register
#define PORTB_INT0MASK	PORTB.INT0MASK	///< Port Interrupt 0 Mask
#define PORTB_INT1MASK	PORTB.INT1MASK	///< Port Interrupt 1 Mask
#define PORTB_INTFLAGS	PORTB.INTFLAGS	///< Interrupt Flag Register
#define PORTB_PIN0CTRL	PORTB.PIN0CTRL	///< Pin 0 Control Register
#define PORTB_PIN1CTRL	PORTB.PIN1CTRL	///< Pin 1 Control Register
#define PORTB_PIN2CTRL	PORTB.PIN2CTRL	///< Pin 2 Control Register
#define PORTB_PIN3CTRL	PORTB.PIN3CTRL	///< Pin 3 Control Register
#define PORTB_PIN4CTRL	PORTB.PIN4CTRL	///< Pin 4 Control Register
#define PORTB_PIN5CTRL	PORTB.PIN5CTRL	///< Pin 5 Control Register
#define PORTB_PIN6CTRL	PORTB.PIN6CTRL	///< Pin 6 Control Register
#define PORTB_PIN7CTRL	PORTB.PIN7CTRL	///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTC - Port C
 --------------------------------------------------------------------------
*/

#define PORTC_DIR	PORTC.DIR	///< I/O Port Data Direction
#define PORTC_DIRSET	PORTC.DIRSET	///< I/O Port Data Direction Set
#define PORTC_DIRCLR	PORTC.DIRCLR	///< I/O Port Data Direction Clear
#define PORTC_DIRTGL	PORTC.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTC_OUT	PORTC.OUT	///< I/O Port Output
#define PORTC_OUTSET	PORTC.OUTSET	///< I/O Port Output Set
#define PORTC_OUTCLR	PORTC.OUTCLR	///< I/O Port Output Clear
#define PORTC_OUTTGL	PORTC.OUTTGL	///< I/O Port Output Toggle
#define PORTC_IN	PORTC.IN	///< I/O port Input
#define PORTC_INTCTRL	PORTC.INTCTRL	///< Interrupt Control Register
#define PORTC_INT0MASK	PORTC.INT0MASK	///< Port Interrupt 0 Mask
#define PORTC_INT1MASK	PORTC.INT1MASK	///< Port Interrupt 1 Mask
#define PORTC_INTFLAGS	PORTC.INTFLAGS	///< Interrupt Flag Register
#define PORTC_PIN0CTRL	PORTC.PIN0CTRL	///< Pin 0 Control Register
#define PORTC_PIN1CTRL	PORTC.PIN1CTRL	///< Pin 1 Control Register
#define PORTC_PIN2CTRL	PORTC.PIN2CTRL	///< Pin 2 Control Register
#define PORTC_PIN3CTRL	PORTC.PIN3CTRL	///< Pin 3 Control Register
#define PORTC_PIN4CTRL	PORTC.PIN4CTRL	///< Pin 4 Control Register
#define PORTC_PIN5CTRL	PORTC.PIN5CTRL	///< Pin 5 Control Register
#define PORTC_PIN6CTRL	PORTC.PIN6CTRL	///< Pin 6 Control Register
#define PORTC_PIN7CTRL	PORTC.PIN7CTRL	///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTD - Port D
 --------------------------------------------------------------------------
*/

#define PORTD_DIR	PORTD.DIR	///< I/O Port Data Direction
#define PORTD_DIRSET	PORTD.DIRSET	///< I/O Port Data Direction Set
#define PORTD_DIRCLR	PORTD.DIRCLR	///< I/O Port Data Direction Clear
#define PORTD_DIRTGL	PORTD.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTD_OUT	PORTD.OUT	///< I/O Port Output
#define PORTD_OUTSET	PORTD.OUTSET	///< I/O Port Output Set
#define PORTD_OUTCLR	PORTD.OUTCLR	///< I/O Port Output Clear
#define PORTD_OUTTGL	PORTD.OUTTGL	///< I/O Port Output Toggle
#define PORTD_IN	PORTD.IN	///< I/O port Input
#define PORTD_INTCTRL	PORTD.INTCTRL	///< Interrupt Control Register
#define PORTD_INT0MASK	PORTD.INT0MASK	///< Port Interrupt 0 Mask
#define PORTD_INT1MASK	PORTD.INT1MASK	///< Port Interrupt 1 Mask
#define PORTD_INTFLAGS	PORTD.INTFLAGS	///< Interrupt Flag Register
#define PORTD_PIN0CTRL	PORTD.PIN0CTRL	///< Pin 0 Control Register
#define PORTD_PIN1CTRL	PORTD.PIN1CTRL	///< Pin 1 Control Register
#define PORTD_PIN2CTRL	PORTD.PIN2CTRL	///< Pin 2 Control Register
#define PORTD_PIN3CTRL	PORTD.PIN3CTRL	///< Pin 3 Control Register
#define PORTD_PIN4CTRL	PORTD.PIN4CTRL	///< Pin 4 Control Register
#define PORTD_PIN5CTRL	PORTD.PIN5CTRL	///< Pin 5 Control Register
#define PORTD_PIN6CTRL	PORTD.PIN6CTRL	///< Pin 6 Control Register
#define PORTD_PIN7CTRL	PORTD.PIN7CTRL	///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- PORTE - Port E
 --------------------------------------------------------------------------
*/

#define PORTE_DIR	PORTE.DIR	///< I/O Port Data Direction
#define PORTE_DIRSET	PORTE.DIRSET	///< I/O Port Data Direction Set
#define PORTE_DIRCLR	PORTE.DIRCLR	///< I/O Port Data Direction Clear
#define PORTE_DIRTGL	PORTE.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTE_OUT	PORTE.OUT	///< I/O Port Output
#define PORTE_OUTSET	PORTE.OUTSET	///< I/O Port Output Set
#define PORTE_OUTCLR	PORTE.OUTCLR	///< I/O Port Output Clear
#define PORTE_OUTTGL	PORTE.OUTTGL	///< I/O Port Output Toggle
#define PORTE_IN	PORTE.IN	///< I/O port Input
#define PORTE_INTCTRL	PORTE.INTCTRL	///< Interrupt Control Register
#define PORTE_INT0MASK	PORTE.INT0MASK	///< Port Interrupt 0 Mask
#define PORTE_INT1MASK	PORTE.INT1MASK	///< Port Interrupt 1 Mask
#define PORTE_INTFLAGS	PORTE.INTFLAGS	///< Interrupt Flag Register
#define PORTE_PIN0CTRL	PORTE.PIN0CTRL	///< Pin 0 Control Register
#define PORTE_PIN1CTRL	PORTE.PIN1CTRL	///< Pin 1 Control Register
#define PORTE_PIN2CTRL	PORTE.PIN2CTRL	///< Pin 2 Control Register
#define PORTE_PIN3CTRL	PORTE.PIN3CTRL	///< Pin 3 Control Register
#define PORTE_PIN4CTRL	PORTE.PIN4CTRL	///< Pin 4 Control Register
#define PORTE_PIN5CTRL	PORTE.PIN5CTRL	///< Pin 5 Control Register
#define PORTE_PIN6CTRL	PORTE.PIN6CTRL	///< Pin 6 Control Register
#define PORTE_PIN7CTRL	PORTE.PIN7CTRL	///< Pin 7 Control Register

