dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- PORTR - Port R
 --------------------------------------------------------------------------
*/

#define PORTR_DIR	PORTR.DIR	///< I/O Port Data Direction
#define PORTR_DIRSET	PORTR.DIRSET	///< I/O Port Data Direction Set
#define PORTR_DIRCLR	PORTR.DIRCLR	///< I/O Port Data Direction Clear
#define PORTR_DIRTGL	PORTR.DIRTGL	///< I/O Port Data Direction Toggle
#define PORTR_OUT	PORTR.OUT	///< I/O Port Output
#define PORTR_OUTSET	PORTR.OUTSET	///< I/O Port Output Set
#define PORTR_OUTCLR	PORTR.OUTCLR	///< I/O Port Output Clear
#define PORTR_OUTTGL	PORTR.OUTTGL	///< I/O Port Output Toggle
#define PORTR_IN	PORTR.IN	///< I/O port Input
#define PORTR_INTCTRL	PORTR.INTCTRL	///< Interrupt Control Register
#define PORTR_INT0MASK	PORTR.INT0MASK	///< Port Interrupt 0 Mask
#define PORTR_INT1MASK	PORTR.INT1MASK	///< Port Interrupt 1 Mask
#define PORTR_INTFLAGS	PORTR.INTFLAGS	///< Interrupt Flag Register
#define PORTR_PIN0CTRL	PORTR.PIN0CTRL	///< Pin 0 Control Register
#define PORTR_PIN1CTRL	PORTR.PIN1CTRL	///< Pin 1 Control Register
#define PORTR_PIN2CTRL	PORTR.PIN2CTRL	///< Pin 2 Control Register
#define PORTR_PIN3CTRL	PORTR.PIN3CTRL	///< Pin 3 Control Register
#define PORTR_PIN4CTRL	PORTR.PIN4CTRL	///< Pin 4 Control Register
#define PORTR_PIN5CTRL	PORTR.PIN5CTRL	///< Pin 5 Control Register
#define PORTR_PIN6CTRL	PORTR.PIN6CTRL	///< Pin 6 Control Register
#define PORTR_PIN7CTRL	PORTR.PIN7CTRL	///< Pin 7 Control Register

/*
 --------------------------------------------------------------------------
 -- TCC0 - Timer/Counter C0
 --------------------------------------------------------------------------
*/

#define TCC0_CTRLA	TCC0.CTRLA	///< Control  Register A
#define TCC0_CTRLB	TCC0.CTRLB	///< Control Register B
#define TCC0_CTRLC	TCC0.CTRLC	///< Control register C
#define TCC0_CTRLD	TCC0.CTRLD	///< Control Register D
#define TCC0_CTRLE	TCC0.CTRLE	///< Control Register E
#define TCC0_INTCTRLA	TCC0.INTCTRLA	///< Interrupt Control Register A
#define TCC0_INTCTRLB	TCC0.INTCTRLB	///< Interrupt Control Register B
#define TCC0_CTRLFCLR	TCC0.CTRLFCLR	///< Control Register F Clear
#define TCC0_CTRLFSET	TCC0.CTRLFSET	///< Control Register F Set
#define TCC0_CTRLGCLR	TCC0.CTRLGCLR	///< Control Register G Clear
#define TCC0_CTRLGSET	TCC0.CTRLGSET	///< Control Register G Set
#define TCC0_INTFLAGS	TCC0.INTFLAGS	///< Interrupt Flag Register
#define TCC0_TEMP	TCC0.TEMP	///< Temporary Register For 16-bit Access
#define TCC0_CNT	TCC0.CNT	///< Count
#define TCC0_PER	TCC0.PER	///< Period
#define TCC0_CCA	TCC0.CCA	///< Compare or Capture A
#define TCC0_CCB	TCC0.CCB	///< Compare or Capture B
#define TCC0_CCC	TCC0.CCC	///< Compare or Capture C
#define TCC0_CCD	TCC0.CCD	///< Compare or Capture D
#define TCC0_PERBUF	TCC0.PERBUF	///< Period Buffer
#define TCC0_CCABUF	TCC0.CCABUF	///< Compare Or Capture A Buffer
#define TCC0_CCBBUF	TCC0.CCBBUF	///< Compare Or Capture B Buffer
#define TCC0_CCCBUF	TCC0.CCCBUF	///< Compare Or Capture C Buffer
#define TCC0_CCDBUF	TCC0.CCDBUF	///< Compare Or Capture D Buffer

/*
 --------------------------------------------------------------------------
 -- TCC1 - Timer/Counter C1
 --------------------------------------------------------------------------
*/

#define TCC1_CTRLA	TCC1.CTRLA	///< Control  Register A
#define TCC1_CTRLB	TCC1.CTRLB	///< Control Register B
#define TCC1_CTRLC	TCC1.CTRLC	///< Control register C
#define TCC1_CTRLD	TCC1.CTRLD	///< Control Register D
#define TCC1_CTRLE	TCC1.CTRLE	///< Control Register E
#define TCC1_INTCTRLA	TCC1.INTCTRLA	///< Interrupt Control Register A
#define TCC1_INTCTRLB	TCC1.INTCTRLB	///< Interrupt Control Register B
#define TCC1_CTRLFCLR	TCC1.CTRLFCLR	///< Control Register F Clear
#define TCC1_CTRLFSET	TCC1.CTRLFSET	///< Control Register F Set
#define TCC1_CTRLGCLR	TCC1.CTRLGCLR	///< Control Register G Clear
#define TCC1_CTRLGSET	TCC1.CTRLGSET	///< Control Register G Set
#define TCC1_INTFLAGS	TCC1.INTFLAGS	///< Interrupt Flag Register
#define TCC1_TEMP	TCC1.TEMP	///< Temporary Register For 16-bit Access
#define TCC1_CNT	TCC1.CNT	///< Count
#define TCC1_PER	TCC1.PER	///< Period
#define TCC1_CCA	TCC1.CCA	///< Compare or Capture A
#define TCC1_CCB	TCC1.CCB	///< Compare or Capture B
#define TCC1_PERBUF	TCC1.PERBUF	///< Period Buffer
#define TCC1_CCABUF	TCC1.CCABUF	///< Compare Or Capture A Buffer
#define TCC1_CCBBUF	TCC1.CCBBUF	///< Compare Or Capture B Buffer

/*
 --------------------------------------------------------------------------
 -- AWEXC - Advanced Waveform Extension C
 --------------------------------------------------------------------------
*/

#define AWEXC_CTRL	AWEXC.CTRL	///< Control Register
#define AWEXC_FDEMASK	AWEXC.FDEMASK	///< Fault Detection Event Mask
#define AWEXC_FDCTRL	AWEXC.FDCTRL	///< Fault Detection Control Register
#define AWEXC_STATUS	AWEXC.STATUS	///< Status Register
#define AWEXC_DTBOTH	AWEXC.DTBOTH	///< Dead Time Both Sides
#define AWEXC_DTBOTHBUF	AWEXC.DTBOTHBUF	///< Dead Time Both Sides Buffer
#define AWEXC_DTLS	AWEXC.DTLS	///< Dead Time Low Side
#define AWEXC_DTHS	AWEXC.DTHS	///< Dead Time High Side
#define AWEXC_DTLSBUF	AWEXC.DTLSBUF	///< Dead Time Low Side Buffer
#define AWEXC_DTHSBUF	AWEXC.DTHSBUF	///< Dead Time High Side Buffer
#define AWEXC_OUTOVEN	AWEXC.OUTOVEN	///< Output Override Enable

/*
 --------------------------------------------------------------------------
 -- HIRESC - High-Resolution Extension C
 --------------------------------------------------------------------------
*/

#define HIRESC_CTRLA	HIRESC.CTRLA	///< Control Register

/*
 --------------------------------------------------------------------------
 -- USARTC0 - Universal Asynchronous Receiver-Transmitter C0
 --------------------------------------------------------------------------
*/

#define USARTC0_DATA	USARTC0.DATA	///< Data Register
#define USARTC0_STATUS	USARTC0.STATUS	///< Status Register
#define USARTC0_CTRLA	USARTC0.CTRLA	///< Control Register A
#define USARTC0_CTRLB	USARTC0.CTRLB	///< Control Register B
#define USARTC0_CTRLC	USARTC0.CTRLC	///< Control Register C
#define USARTC0_BAUDCTRLA	USARTC0.BAUDCTRLA	///< Baud Rate Control Register A
#define USARTC0_BAUDCTRLB	USARTC0.BAUDCTRLB	///< Baud Rate Control Register B

