dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/*
 --------------------------------------------------------------------------
 -- SPIC - Serial Peripheral Interface C
 --------------------------------------------------------------------------
*/

#define SPIC_CTRL	SPIC.CTRL	///< Control Register
#define SPIC_INTCTRL	SPIC.INTCTRL	///< Interrupt Control Register
#define SPIC_STATUS	SPIC.STATUS	///< Status Register
#define SPIC_DATA	SPIC.DATA	///< Data Register

/*
 --------------------------------------------------------------------------
 -- TCD0 - Timer/Counter D0
 --------------------------------------------------------------------------
*/

#define TCD0_CTRLA	TCD0.CTRLA	///< Control  Register A
#define TCD0_CTRLB	TCD0.CTRLB	///< Control Register B
#define TCD0_CTRLC	TCD0.CTRLC	///< Control register C
#define TCD0_CTRLD	TCD0.CTRLD	///< Control Register D
#define TCD0_CTRLE	TCD0.CTRLE	///< Control Register E
#define TCD0_INTCTRLA	TCD0.INTCTRLA	///< Interrupt Control Register A
#define TCD0_INTCTRLB	TCD0.INTCTRLB	///< Interrupt Control Register B
#define TCD0_CTRLFCLR	TCD0.CTRLFCLR	///< Control Register F Clear
#define TCD0_CTRLFSET	TCD0.CTRLFSET	///< Control Register F Set
#define TCD0_CTRLGCLR	TCD0.CTRLGCLR	///< Control Register G Clear
#define TCD0_CTRLGSET	TCD0.CTRLGSET	///< Control Register G Set
#define TCD0_INTFLAGS	TCD0.INTFLAGS	///< Interrupt Flag Register
#define TCD0_TEMP	TCD0.TEMP	///< Temporary Register For 16-bit Access
#define TCD0_CNT	TCD0.CNT	///< Count
#define TCD0_PER	TCD0.PER	///< Period
#define TCD0_CCA	TCD0.CCA	///< Compare or Capture A
#define TCD0_CCB	TCD0.CCB	///< Compare or Capture B
#define TCD0_CCC	TCD0.CCC	///< Compare or Capture C
#define TCD0_CCD	TCD0.CCD	///< Compare or Capture D
#define TCD0_PERBUF	TCD0.PERBUF	///< Period Buffer
#define TCD0_CCABUF	TCD0.CCABUF	///< Compare Or Capture A Buffer
#define TCD0_CCBBUF	TCD0.CCBBUF	///< Compare Or Capture B Buffer
#define TCD0_CCCBUF	TCD0.CCCBUF	///< Compare Or Capture C Buffer
#define TCD0_CCDBUF	TCD0.CCDBUF	///< Compare Or Capture D Buffer

/*
 --------------------------------------------------------------------------
 -- USARTD0 - Universal Asynchronous Receiver-Transmitter D0
 --------------------------------------------------------------------------
*/

#define USARTD0_DATA	USARTD0.DATA	///< Data Register
#define USARTD0_STATUS	USARTD0.STATUS	///< Status Register
#define USARTD0_CTRLA	USARTD0.CTRLA	///< Control Register A
#define USARTD0_CTRLB	USARTD0.CTRLB	///< Control Register B
#define USARTD0_CTRLC	USARTD0.CTRLC	///< Control Register C
#define USARTD0_BAUDCTRLA	USARTD0.BAUDCTRLA	///< Baud Rate Control Register A
#define USARTD0_BAUDCTRLB	USARTD0.BAUDCTRLB	///< Baud Rate Control Register B

/*
 --------------------------------------------------------------------------
 -- SPID - Serial Peripheral Interface D
 --------------------------------------------------------------------------
*/

#define SPID_CTRL	SPID.CTRL	///< Control Register
#define SPID_INTCTRL	SPID.INTCTRL	///< Interrupt Control Register
#define SPID_STATUS	SPID.STATUS	///< Status Register
#define SPID_DATA	SPID.DATA	///< Data Register

/*
 --------------------------------------------------------------------------
 -- TCE0 - Timer/Counter E0
 --------------------------------------------------------------------------
*/

#define TCE0_CTRLA	TCE0.CTRLA	///< Control  Register A
#define TCE0_CTRLB	TCE0.CTRLB	///< Control Register B
#define TCE0_CTRLC	TCE0.CTRLC	///< Control register C
#define TCE0_CTRLD	TCE0.CTRLD	///< Control Register D
#define TCE0_CTRLE	TCE0.CTRLE	///< Control Register E
#define TCE0_INTCTRLA	TCE0.INTCTRLA	///< Interrupt Control Register A
#define TCE0_INTCTRLB	TCE0.INTCTRLB	///< Interrupt Control Register B
#define TCE0_CTRLFCLR	TCE0.CTRLFCLR	///< Control Register F Clear
#define TCE0_CTRLFSET	TCE0.CTRLFSET	///< Control Register F Set
#define TCE0_CTRLGCLR	TCE0.CTRLGCLR	///< Control Register G Clear
#define TCE0_CTRLGSET	TCE0.CTRLGSET	///< Control Register G Set
#define TCE0_INTFLAGS	TCE0.INTFLAGS	///< Interrupt Flag Register
#define TCE0_TEMP	TCE0.TEMP	///< Temporary Register For 16-bit Access
#define TCE0_CNT	TCE0.CNT	///< Count
#define TCE0_PER	TCE0.PER	///< Period
#define TCE0_CCA	TCE0.CCA	///< Compare or Capture A
#define TCE0_CCB	TCE0.CCB	///< Compare or Capture B
#define TCE0_CCC	TCE0.CCC	///< Compare or Capture C
#define TCE0_CCD	TCE0.CCD	///< Compare or Capture D
#define TCE0_PERBUF	TCE0.PERBUF	///< Period Buffer
#define TCE0_CCABUF	TCE0.CCABUF	///< Compare Or Capture A Buffer
#define TCE0_CCBBUF	TCE0.CCBBUF	///< Compare Or Capture B Buffer
#define TCE0_CCCBUF	TCE0.CCCBUF	///< Compare Or Capture C Buffer
#define TCE0_CCDBUF	TCE0.CCDBUF	///< Compare Or Capture D Buffer

/*
 --------------------------------------------------------------------------
 -- IRCOM - IR Communication Module
 --------------------------------------------------------------------------
*/

#define IRCOM_CTRL	IRCOM.CTRL	///< Control Register
#define IRCOM_TXPLCTRL	IRCOM.TXPLCTRL	///< IrDA Transmitter Pulse Length Control Register
#define IRCOM_RXPLCTRL	IRCOM.RXPLCTRL	///< IrDA Receiver Pulse Length Control Register


#endif // defined(__IAR_SYSTEMS_ICC__)



#ifndef __ATxmega32D4P_H
#define __ATxmega32D4P_H


/*
 ---------------------------------------------------------------------------
 ---------------------------------------------------------------------------
 --
 -- Interrupt Vector Definitions
 --
 ----------------------------------------------------------------------------
 ---------------------------------------------------------------------------
*/

/* NB! vectors are specified as byte addresses */

/// Reset vector
#define RESET_vect 0


/// OSC interrupt vectors
#define OSC_XOSCF_vect 0x0004 ///< External Oscillator Failure Interrupt (NMI)

/// PORTC interrupt vectors
#define PORTC_INT0_vect 0x0008 ///< External Interrupt 0
#define PORTC_INT1_vect 0x000C ///< External Interrupt 1

/// PORTR interrupt vectors
#define PORTR_INT0_vect 0x0010 ///< External Interrupt 0
#define PORTR_INT1_vect 0x0014 ///< External Interrupt 1

