dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// RTC interrupt vectors
#define RTC_OVF_vect 0x0028 ///< Overflow Interrupt
#define RTC_COMP_vect 0x002C ///< Compare Interrupt

/// TWIC interrupt vectors
#define TWIC_TWIS_vect 0x0030 ///< TWI Slave Interrupt
#define TWIC_TWIM_vect 0x0034 ///< TWI Master Interrupt

/// TCC0 interrupt vectors
#define TCC0_OVF_vect 0x0038 ///< Overflow Interrupt
#define TCC0_ERR_vect 0x003C ///< Error Interrupt
#define TCC0_CCA_vect 0x0040 ///< Compare or Capture A Interrupt
#define TCC0_CCB_vect 0x0044 ///< Compare or Capture B Interrupt
#define TCC0_CCC_vect 0x0048 ///< Compare or Capture C Interrupt
#define TCC0_CCD_vect 0x004C ///< Compare or Capture D Interrupt

/// TCC1 interrupt vectors
#define TCC1_OVF_vect 0x0050 ///< Overflow Interrupt
#define TCC1_ERR_vect 0x0054 ///< Error Interrupt
#define TCC1_CCA_vect 0x0058 ///< Compare or Capture A Interrupt
#define TCC1_CCB_vect 0x005C ///< Compare or Capture B Interrupt

/// SPIC interrupt vectors
#define SPIC_INT_vect 0x0060 ///< SPI Interrupt

/// USARTC0 interrupt vectors
#define USARTC0_RXC_vect 0x0064 ///< Reception Complete Interrupt
#define USARTC0_DRE_vect 0x0068 ///< Data Register Empty Interrupt
#define USARTC0_TXC_vect 0x006C ///< Transmission Complete Interrupt

/// NVM interrupt vectors
#define NVM_EE_vect 0x0080 ///< EE Interrupt
#define NVM_SPM_vect 0x0084 ///< SPM Interrupt

/// PORTB interrupt vectors
#define PORTB_INT0_vect 0x0088 ///< External Interrupt 0
#define PORTB_INT1_vect 0x008C ///< External Interrupt 1

/// PORTE interrupt vectors
#define PORTE_INT0_vect 0x00AC ///< External Interrupt 0
#define PORTE_INT1_vect 0x00B0 ///< External Interrupt 1

/// TCE0 interrupt vectors
#define TCE0_OVF_vect 0x00BC ///< Overflow Interrupt
#define TCE0_ERR_vect 0x00C0 ///< Error Interrupt
#define TCE0_CCA_vect 0x00C4 ///< Compare or Capture A Interrupt
#define TCE0_CCB_vect 0x00C8 ///< Compare or Capture B Interrupt
#define TCE0_CCC_vect 0x00CC ///< Compare or Capture C Interrupt
#define TCE0_CCD_vect 0x00D0 ///< Compare or Capture D Interrupt

/// TWIE interrupt vectors
#define TWIE_TWIS_vect 0x00B4 ///< TWI Slave Interrupt
#define TWIE_TWIM_vect 0x00B8 ///< TWI Master Interrupt

/// PORTD interrupt vectors
#define PORTD_INT0_vect 0x0100 ///< External Interrupt 0
#define PORTD_INT1_vect 0x0104 ///< External Interrupt 1

/// PORTA interrupt vectors
#define PORTA_INT0_vect 0x0108 ///< External Interrupt 0
#define PORTA_INT1_vect 0x010C ///< External Interrupt 1

/// ACA interrupt vectors
#define ACA_ACW_vect 0x0118 ///< ACW Window Mode Interrupt
#define ACA_AC1_vect 0x0114 ///< AC1 Interrupt
#define ACA_AC0_vect 0x0110 ///< AC0 Interrupt

/// ADCA interrupt vectors
#define ADCA_CH0_vect 0x011C ///< Interrupt 0

/// TCD0 interrupt vectors
#define TCD0_OVF_vect 0x0134 ///< Overflow Interrupt
#define TCD0_ERR_vect 0x0138 ///< Error Interrupt
#define TCD0_CCA_vect 0x013C ///< Compare or Capture A Interrupt
#define TCD0_CCB_vect 0x0140 ///< Compare or Capture B Interrupt
#define TCD0_CCC_vect 0x0144 ///< Compare or Capture C Interrupt
#define TCD0_CCD_vect 0x0148 ///< Compare or Capture D Interrupt

/// SPID interrupt vectors
#define SPID_INT_vect 0x015C ///< SPI Interrupt

/// USARTD0 interrupt vectors
#define USARTD0_RXC_vect 0x0160 ///< Reception Complete Interrupt
#define USARTD0_DRE_vect 0x0164 ///< Data Register Empty Interrupt
#define USARTD0_TXC_vect 0x0168 ///< Transmission Complete Interrupt





#ifdef __IAR_SYSTEMS_ASM__
#ifndef ENABLE_BIT_DEFINITIONS
#define  ENABLE_BIT_DEFINITIONS
#endif // ENABLE_BIT_DEFINITIONS
#endif // __IAR_SYSTEMS_ASM__

#ifdef ENABLE_BIT_DEFINITIONS

/*
 ---------------------------------------------------------------------------
 ---------------------------------------------------------------------------
 --
 -- Bitfield definitions
 --
 ---------------------------------------------------------------------------
 ---------------------------------------------------------------------------
*/


/*
  ---------------------------------------------------------------------------
  -- CPU - CPU IO registers
  ---------------------------------------------------------------------------
*/

// CPU.SREG bit masks and bit positions
#define I_bm 0x80 ///< Global Interrupt Enable Flag bit mask
#define I_bp 7 ///< Global Interrupt Enable Flag bit position
#define T_bm 0x40 ///< Transfer Bit bit mask
#define T_bp 6 ///< Transfer Bit bit position
#define H_bm 0x20 ///< Half Carry Flag bit mask
#define H_bp 5 ///< Half Carry Flag bit position
#define S_bm 0x10 ///< N Exclusive Or V Flag bit mask
#define S_bp 4 ///< N Exclusive Or V Flag bit position
#define V_bm 0x08 ///< Two's Complement Overflow Flag bit mask
#define V_bp 3 ///< Two's Complement Overflow Flag bit position
#define N_bm 0x04 ///< Negative Flag bit mask
#define N_bp 2 ///< Negative Flag bit position
#define Z_bm 0x02 ///< Zero Flag bit mask
#define Z_bp 1 ///< Zero Flag bit position
#define C_bm 0x01 ///< Carry Flag bit mask
#define C_bp 0 ///< Carry Flag bit position




#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup xocd On-Chip Debug System
 *  @{
 */

/** @name OCD.OCDR1
  * @{
  */
#define OCD_OCDRD_bm 0x01 ///< OCDR Dirty bit mask
#define OCD_OCDRD_bp 0 ///< OCDR Dirty bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)



#if defined(__IAR_SYSTEMS_ICC__)

/// CCP signatures

typedef enum CCP_enum {
	CCP_SPM_gc = (0x9D<<0),	///< SPM Instruction Protection
	CCP_IOREG_gc = (0xD8<<0),	///< IO Register Protection
} CCP_t;

#endif // defined(__IAR_SYSTEMS_ICC__)


#if defined(__IAR_SYSTEMS_ASM__)

/// CCP signatures
#define CCP_SPM_gc (0x9D<<0)	///< SPM Instruction Protection
#define CCP_IOREG_gc (0xD8<<0)	///< IO Register Protection

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup clk Clock System
 *  @{
 */

/** @name CLK.CTRL
  * @see CLK_SCLKSEL_enum
  * @{
  */
#define CLK_SCLKSEL_gm 0x07 ///< System Clock Selection group mask
#define CLK_SCLKSEL_gp 0 ///< System Clock Selection group position
#define CLK_SCLKSEL0_bm (1<<0) ///< System Clock Selection bit 0 mask
#define CLK_SCLKSEL0_bp 0 ///< System Clock Selection bit 0 position
#define CLK_SCLKSEL1_bm (1<<1) ///< System Clock Selection bit 1 mask
#define CLK_SCLKSEL1_bp 1 ///< System Clock Selection bit 1 position
#define CLK_SCLKSEL2_bm (1<<2) ///< System Clock Selection bit 2 mask
#define CLK_SCLKSEL2_bp 2 ///< System Clock Selection bit 2 position
/** @} */

/** @name CLK.PSCTRL
  * @see CLK_PSADIV_enum
  * @see CLK_PSBCDIV_enum
  * @{
  */
#define CLK_PSADIV_gm 0x7C ///< Prescaler A Division Factor group mask
#define CLK_PSADIV_gp 2 ///< Prescaler A Division Factor group position
#define CLK_PSADIV0_bm (1<<2) ///< Prescaler A Division Factor bit 0 mask
#define CLK_PSADIV0_bp 2 ///< Prescaler A Division Factor bit 0 position
#define CLK_PSADIV1_bm (1<<3) ///< Prescaler A Division Factor bit 1 mask
#define CLK_PSADIV1_bp 3 ///< Prescaler A Division Factor bit 1 position
#define CLK_PSADIV2_bm (1<<4) ///< Prescaler A Division Factor bit 2 mask
#define CLK_PSADIV2_bp 4 ///< Prescaler A Division Factor bit 2 position
#define CLK_PSADIV3_bm (1<<5) ///< Prescaler A Division Factor bit 3 mask
#define CLK_PSADIV3_bp 5 ///< Prescaler A Division Factor bit 3 position
#define CLK_PSADIV4_bm (1<<6) ///< Prescaler A Division Factor bit 4 mask
#define CLK_PSADIV4_bp 6 ///< Prescaler A Division Factor bit 4 position
#define CLK_PSBCDIV_gm 0x03 ///< Prescaler B and C Division factor group mask
#define CLK_PSBCDIV_gp 0 ///< Prescaler B and C Division factor group position
#define CLK_PSBCDIV0_bm (1<<0) ///< Prescaler B and C Division factor bit 0 mask
#define CLK_PSBCDIV0_bp 0 ///< Prescaler B and C Division factor bit 0 position
#define CLK_PSBCDIV1_bm (1<<1) ///< Prescaler B and C Division factor bit 1 mask
#define CLK_PSBCDIV1_bp 1 ///< Prescaler B and C Division factor bit 1 position
/** @} */

/** @name CLK.LOCK
  * @{
  */
#define CLK_LOCK_bm 0x01 ///< Clock System Lock bit mask
#define CLK_LOCK_bp 0 ///< Clock System Lock bit position
/** @} */

/** @name CLK.RTCCTRL
  * @see CLK_RTCSRC_enum
  * @{
  */
#define CLK_RTCSRC_gm 0x0E ///< RTC Clock Source group mask
#define CLK_RTCSRC_gp 1 ///< RTC Clock Source group position
#define CLK_RTCSRC0_bm (1<<1) ///< RTC Clock Source bit 0 mask
#define CLK_RTCSRC0_bp 1 ///< RTC Clock Source bit 0 position
#define CLK_RTCSRC1_bm (1<<2) ///< RTC Clock Source bit 1 mask
#define CLK_RTCSRC1_bp 2 ///< RTC Clock Source bit 1 position
#define CLK_RTCSRC2_bm (1<<3) ///< RTC Clock Source bit 2 mask
#define CLK_RTCSRC2_bp 3 ///< RTC Clock Source bit 2 position
#define CLK_RTCEN_bm 0x01 ///< RTC Clock Source Enable bit mask
#define CLK_RTCEN_bp 0 ///< RTC Clock Source Enable bit position
/** @} */

/** @name PR.PRGEN
  * @{
  */
#define PR_AES_bm 0x10 ///< AES bit mask
#define PR_AES_bp 4 ///< AES bit position
#define PR_EBI_bm 0x08 ///< External Bus Interface bit mask
#define PR_EBI_bp 3 ///< External Bus Interface bit position
#define PR_RTC_bm 0x04 ///< Real-time Counter bit mask
#define PR_RTC_bp 2 ///< Real-time Counter bit position
#define PR_EVSYS_bm 0x02 ///< Event System bit mask
#define PR_EVSYS_bp 1 ///< Event System bit position
#define PR_DMA_bm 0x01 ///< DMA-Controller bit mask
#define PR_DMA_bp 0 ///< DMA-Controller bit position
/** @} */

/** @name PR.PRPA
  * @{
  */
#define PR_DAC_bm 0x04 ///< Port A DAC bit mask
#define PR_DAC_bp 2 ///< Port A DAC bit position
#define PR_ADC_bm 0x02 ///< Port A ADC bit mask
#define PR_ADC_bp 1 ///< Port A ADC bit position
#define PR_AC_bm 0x01 ///< Port A Analog Comparator bit mask
#define PR_AC_bp 0 ///< Port A Analog Comparator bit position
/** @} */

/** @name PR.PRPB
  * @{
  */
// Masks for DAC aready defined
// Masks for ADC aready defined
// Masks for AC aready defined
/** @} */

/** @name PR.PRPC
  * @{
  */
#define PR_TWI_bm 0x40 ///< Port C Two-wire Interface bit mask
#define PR_TWI_bp 6 ///< Port C Two-wire Interface bit position
#define PR_USART1_bm 0x20 ///< Port C USART1 bit mask
#define PR_USART1_bp 5 ///< Port C USART1 bit position
#define PR_USART0_bm 0x10 ///< Port C USART0 bit mask
#define PR_USART0_bp 4 ///< Port C USART0 bit position
#define PR_SPI_bm 0x08 ///< Port C SPI bit mask
#define PR_SPI_bp 3 ///< Port C SPI bit position
#define PR_HIRES_bm 0x04 ///< Port C AWEX bit mask
#define PR_HIRES_bp 2 ///< Port C AWEX bit position
#define PR_TC1_bm 0x02 ///< Port C Timer/Counter1 bit mask
#define PR_TC1_bp 1 ///< Port C Timer/Counter1 bit position
#define PR_TC0_bm 0x01 ///< Port C Timer/Counter0 bit mask
#define PR_TC0_bp 0 ///< Port C Timer/Counter0 bit position
/** @} */

