dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name PR.PRPD
  * @{
  */
// Masks for TWI aready defined
// Masks for USART1 aready defined
// Masks for USART0 aready defined
// Masks for SPI aready defined
// Masks for HIRES aready defined
// Masks for TC1 aready defined
// Masks for TC0 aready defined
/** @} */

/** @name PR.PRPE
  * @{
  */
// Masks for TWI aready defined
// Masks for USART1 aready defined
// Masks for USART0 aready defined
// Masks for SPI aready defined
// Masks for HIRES aready defined
// Masks for TC1 aready defined
// Masks for TC0 aready defined
/** @} */

/** @name PR.PRPF
  * @{
  */
// Masks for TWI aready defined
// Masks for USART1 aready defined
// Masks for USART0 aready defined
// Masks for SPI aready defined
// Masks for HIRES aready defined
// Masks for TC1 aready defined
// Masks for TC0 aready defined
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// System Clock Selection

typedef enum CLK_SCLKSEL_enum {
	CLK_SCLKSEL_RC2M_gc = (0x00<<0),	///< Internal 2MHz RC Oscillator
	CLK_SCLKSEL_RC32M_gc = (0x01<<0),	///< Internal 32MHz RC Oscillator
	CLK_SCLKSEL_RC32K_gc = (0x02<<0),	///< Internal 32kHz RC Oscillator
	CLK_SCLKSEL_XOSC_gc = (0x03<<0),	///< External Crystal Oscillator or Clock
	CLK_SCLKSEL_PLL_gc = (0x04<<0),	///< Phase Locked Loop
} CLK_SCLKSEL_t;

/// Prescaler A Division Factor

typedef enum CLK_PSADIV_enum {
	CLK_PSADIV_1_gc = (0x00<<2),	///< Divide by 1
	CLK_PSADIV_2_gc = (0x01<<2),	///< Divide by 2
	CLK_PSADIV_4_gc = (0x03<<2),	///< Divide by 4
	CLK_PSADIV_8_gc = (0x05<<2),	///< Divide by 8
	CLK_PSADIV_16_gc = (0x07<<2),	///< Divide by 16
	CLK_PSADIV_32_gc = (0x09<<2),	///< Divide by 32
	CLK_PSADIV_64_gc = (0x0B<<2),	///< Divide by 64
	CLK_PSADIV_128_gc = (0x0D<<2),	///< Divide by 128
	CLK_PSADIV_256_gc = (0x0F<<2),	///< Divide by 256
	CLK_PSADIV_512_gc = (0x11<<2),	///< Divide by 512
} CLK_PSADIV_t;

/// Prescaler B and C Division Factor

typedef enum CLK_PSBCDIV_enum {
	CLK_PSBCDIV_1_1_gc = (0x00<<0),	///< Divide B by 1 and C by 1
	CLK_PSBCDIV_1_2_gc = (0x01<<0),	///< Divide B by 1 and C by 2
	CLK_PSBCDIV_4_1_gc = (0x02<<0),	///< Divide B by 4 and C by 1
	CLK_PSBCDIV_2_2_gc = (0x03<<0),	///< Divide B by 2 and C by 2
} CLK_PSBCDIV_t;

/// RTC Clock Source

typedef enum CLK_RTCSRC_enum {
	CLK_RTCSRC_ULP_gc = (0x00<<1),	///< 1kHz from internal 32kHz ULP
	CLK_RTCSRC_TOSC_gc = (0x01<<1),	///< 1kHz from 32kHz crystal oscillator on TOSC
	CLK_RTCSRC_RCOSC_gc = (0x02<<1),	///< 1kHz from internal 32kHz RC oscillator
	CLK_RTCSRC_TOSC32_gc = (0x05<<1),	///< 32kHz from 32kHz crystal oscillator on TOSC
} CLK_RTCSRC_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// System Clock Selection
#define CLK_SCLKSEL_RC2M_gc (0x00<<0)	///< Internal 2MHz RC Oscillator
#define CLK_SCLKSEL_RC32M_gc (0x01<<0)	///< Internal 32MHz RC Oscillator
#define CLK_SCLKSEL_RC32K_gc (0x02<<0)	///< Internal 32kHz RC Oscillator
#define CLK_SCLKSEL_XOSC_gc (0x03<<0)	///< External Crystal Oscillator or Clock
#define CLK_SCLKSEL_PLL_gc (0x04<<0)	///< Phase Locked Loop

/// Prescaler A Division Factor
#define CLK_PSADIV_1_gc (0x00<<2)	///< Divide by 1
#define CLK_PSADIV_2_gc (0x01<<2)	///< Divide by 2
#define CLK_PSADIV_4_gc (0x03<<2)	///< Divide by 4
#define CLK_PSADIV_8_gc (0x05<<2)	///< Divide by 8
#define CLK_PSADIV_16_gc (0x07<<2)	///< Divide by 16
#define CLK_PSADIV_32_gc (0x09<<2)	///< Divide by 32
#define CLK_PSADIV_64_gc (0x0B<<2)	///< Divide by 64
#define CLK_PSADIV_128_gc (0x0D<<2)	///< Divide by 128
#define CLK_PSADIV_256_gc (0x0F<<2)	///< Divide by 256
#define CLK_PSADIV_512_gc (0x11<<2)	///< Divide by 512

/// Prescaler B and C Division Factor
#define CLK_PSBCDIV_1_1_gc (0x00<<0)	///< Divide B by 1 and C by 1
#define CLK_PSBCDIV_1_2_gc (0x01<<0)	///< Divide B by 1 and C by 2
#define CLK_PSBCDIV_4_1_gc (0x02<<0)	///< Divide B by 4 and C by 1
#define CLK_PSBCDIV_2_2_gc (0x03<<0)	///< Divide B by 2 and C by 2

/// RTC Clock Source
#define CLK_RTCSRC_ULP_gc (0x00<<1)	///< 1kHz from internal 32kHz ULP
#define CLK_RTCSRC_TOSC_gc (0x01<<1)	///< 1kHz from 32kHz crystal oscillator on TOSC
#define CLK_RTCSRC_RCOSC_gc (0x02<<1)	///< 1kHz from internal 32kHz RC oscillator
#define CLK_RTCSRC_TOSC32_gc (0x05<<1)	///< 32kHz from 32kHz crystal oscillator on TOSC

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup sleep Sleep Controller
 *  @{
 */

/** @name SLEEP.CTRL
  * @see SLEEP_SMODE_enum
  * @{
  */
#define SLEEP_SMODE_gm 0x0E ///< Sleep Mode group mask
#define SLEEP_SMODE_gp 1 ///< Sleep Mode group position
#define SLEEP_SMODE0_bm (1<<1) ///< Sleep Mode bit 0 mask
#define SLEEP_SMODE0_bp 1 ///< Sleep Mode bit 0 position
#define SLEEP_SMODE1_bm (1<<2) ///< Sleep Mode bit 1 mask
#define SLEEP_SMODE1_bp 2 ///< Sleep Mode bit 1 position
#define SLEEP_SMODE2_bm (1<<3) ///< Sleep Mode bit 2 mask
#define SLEEP_SMODE2_bp 3 ///< Sleep Mode bit 2 position
#define SLEEP_SEN_bm 0x01 ///< Sleep Enable bit mask
#define SLEEP_SEN_bp 0 ///< Sleep Enable bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Sleep Mode

typedef enum SLEEP_SMODE_enum {
	SLEEP_SMODE_IDLE_gc = (0x00<<1),	///< Idle mode
	SLEEP_SMODE_PDOWN_gc = (0x02<<1),	///< Power-down Mode
	SLEEP_SMODE_PSAVE_gc = (0x03<<1),	///< Power-save Mode
	SLEEP_SMODE_STDBY_gc = (0x06<<1),	///< Standby Mode
	SLEEP_SMODE_ESTDBY_gc = (0x07<<1),	///< Extended Standby Mode
} SLEEP_SMODE_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Sleep Mode
#define SLEEP_SMODE_IDLE_gc (0x00<<1)	///< Idle mode
#define SLEEP_SMODE_PDOWN_gc (0x02<<1)	///< Power-down Mode
#define SLEEP_SMODE_PSAVE_gc (0x03<<1)	///< Power-save Mode
#define SLEEP_SMODE_STDBY_gc (0x06<<1)	///< Standby Mode
#define SLEEP_SMODE_ESTDBY_gc (0x07<<1)	///< Extended Standby Mode

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup osc Oscillator
 *  @{
 */

/** @name OSC.CTRL
  * @{
  */
#define OSC_PLLEN_bm 0x10 ///< PLL Enable bit mask
#define OSC_PLLEN_bp 4 ///< PLL Enable bit position
#define OSC_XOSCEN_bm 0x08 ///< External Oscillator Enable bit mask
#define OSC_XOSCEN_bp 3 ///< External Oscillator Enable bit position
#define OSC_RC32KEN_bm 0x04 ///< Internal 32kHz RC Oscillator Enable bit mask
#define OSC_RC32KEN_bp 2 ///< Internal 32kHz RC Oscillator Enable bit position
#define OSC_RC32MEN_bm 0x02 ///< Internal 32MHz RC Oscillator Enable bit mask
#define OSC_RC32MEN_bp 1 ///< Internal 32MHz RC Oscillator Enable bit position
#define OSC_RC2MEN_bm 0x01 ///< Internal 2MHz RC Oscillator Enable bit mask
#define OSC_RC2MEN_bp 0 ///< Internal 2MHz RC Oscillator Enable bit position
/** @} */

/** @name OSC.STATUS
  * @{
  */
#define OSC_PLLRDY_bm 0x10 ///< PLL Ready bit mask
#define OSC_PLLRDY_bp 4 ///< PLL Ready bit position
#define OSC_XOSCRDY_bm 0x08 ///< External Oscillator Ready bit mask
#define OSC_XOSCRDY_bp 3 ///< External Oscillator Ready bit position
#define OSC_RC32KRDY_bm 0x04 ///< Internal 32kHz RC Oscillator Ready bit mask
#define OSC_RC32KRDY_bp 2 ///< Internal 32kHz RC Oscillator Ready bit position
#define OSC_RC32MRDY_bm 0x02 ///< Internal 32MHz RC Oscillator Ready bit mask
#define OSC_RC32MRDY_bp 1 ///< Internal 32MHz RC Oscillator Ready bit position
#define OSC_RC2MRDY_bm 0x01 ///< Internal 2MHz RC Oscillator Ready bit mask
#define OSC_RC2MRDY_bp 0 ///< Internal 2MHz RC Oscillator Ready bit position
/** @} */

/** @name OSC.XOSCCTRL
  * @see OSC_FRQRANGE_enum
  * @see OSC_XOSCSEL_enum
  * @{
  */
#define OSC_FRQRANGE_gm 0xC0 ///< Frequency Range group mask
#define OSC_FRQRANGE_gp 6 ///< Frequency Range group position
#define OSC_FRQRANGE0_bm (1<<6) ///< Frequency Range bit 0 mask
#define OSC_FRQRANGE0_bp 6 ///< Frequency Range bit 0 position
#define OSC_FRQRANGE1_bm (1<<7) ///< Frequency Range bit 1 mask
#define OSC_FRQRANGE1_bp 7 ///< Frequency Range bit 1 position
#define OSC_X32KLPM_bm 0x20 ///< 32kHz XTAL OSC Low-power Mode bit mask
#define OSC_X32KLPM_bp 5 ///< 32kHz XTAL OSC Low-power Mode bit position
#define OSC_XOSCSEL_gm 0x0F ///< External Oscillator Selection and Startup Time group mask
#define OSC_XOSCSEL_gp 0 ///< External Oscillator Selection and Startup Time group position
#define OSC_XOSCSEL0_bm (1<<0) ///< External Oscillator Selection and Startup Time bit 0 mask
#define OSC_XOSCSEL0_bp 0 ///< External Oscillator Selection and Startup Time bit 0 position
#define OSC_XOSCSEL1_bm (1<<1) ///< External Oscillator Selection and Startup Time bit 1 mask
#define OSC_XOSCSEL1_bp 1 ///< External Oscillator Selection and Startup Time bit 1 position
#define OSC_XOSCSEL2_bm (1<<2) ///< External Oscillator Selection and Startup Time bit 2 mask
#define OSC_XOSCSEL2_bp 2 ///< External Oscillator Selection and Startup Time bit 2 position
#define OSC_XOSCSEL3_bm (1<<3) ///< External Oscillator Selection and Startup Time bit 3 mask
#define OSC_XOSCSEL3_bp 3 ///< External Oscillator Selection and Startup Time bit 3 position
/** @} */

/** @name OSC.XOSCFAIL
  * @{
  */
#define OSC_XOSCFDIF_bm 0x02 ///< Failure Detection Interrupt Flag bit mask
#define OSC_XOSCFDIF_bp 1 ///< Failure Detection Interrupt Flag bit position
#define OSC_XOSCFDEN_bm 0x01 ///< Failure Detection Enable bit mask
#define OSC_XOSCFDEN_bp 0 ///< Failure Detection Enable bit position
/** @} */

/** @name OSC.PLLCTRL
  * @see OSC_PLLSRC_enum
  * @{
  */
#define OSC_PLLSRC_gm 0xC0 ///< Clock Source group mask
#define OSC_PLLSRC_gp 6 ///< Clock Source group position
#define OSC_PLLSRC0_bm (1<<6) ///< Clock Source bit 0 mask
#define OSC_PLLSRC0_bp 6 ///< Clock Source bit 0 position
#define OSC_PLLSRC1_bm (1<<7) ///< Clock Source bit 1 mask
#define OSC_PLLSRC1_bp 7 ///< Clock Source bit 1 position
#define OSC_PLLFAC_gm 0x1F ///< Multiplication Factor group mask
#define OSC_PLLFAC_gp 0 ///< Multiplication Factor group position
#define OSC_PLLFAC0_bm (1<<0) ///< Multiplication Factor bit 0 mask
#define OSC_PLLFAC0_bp 0 ///< Multiplication Factor bit 0 position
#define OSC_PLLFAC1_bm (1<<1) ///< Multiplication Factor bit 1 mask
#define OSC_PLLFAC1_bp 1 ///< Multiplication Factor bit 1 position
#define OSC_PLLFAC2_bm (1<<2) ///< Multiplication Factor bit 2 mask
#define OSC_PLLFAC2_bp 2 ///< Multiplication Factor bit 2 position
#define OSC_PLLFAC3_bm (1<<3) ///< Multiplication Factor bit 3 mask
#define OSC_PLLFAC3_bp 3 ///< Multiplication Factor bit 3 position
#define OSC_PLLFAC4_bm (1<<4) ///< Multiplication Factor bit 4 mask
#define OSC_PLLFAC4_bp 4 ///< Multiplication Factor bit 4 position
/** @} */

/** @name OSC.DFLLCTRL
  * @{
  */
#define OSC_RC32MCREF_bm 0x02 ///< 32MHz Calibration Reference bit mask
#define OSC_RC32MCREF_bp 1 ///< 32MHz Calibration Reference bit position
#define OSC_RC2MCREF_bm 0x01 ///< 2MHz Calibration Reference bit mask
#define OSC_RC2MCREF_bp 0 ///< 2MHz Calibration Reference bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Oscillator Frequency Range

typedef enum OSC_FRQRANGE_enum {
	OSC_FRQRANGE_04TO2_gc = (0x00<<6),	///< 0.4 - 2 MHz
	OSC_FRQRANGE_2TO9_gc = (0x01<<6),	///< 2 - 9 MHz
	OSC_FRQRANGE_9TO12_gc = (0x02<<6),	///< 9 - 12 MHz
	OSC_FRQRANGE_12TO16_gc = (0x03<<6),	///< 12 - 16 MHz
} OSC_FRQRANGE_t;

/// External Oscillator Selection and Startup Time

typedef enum OSC_XOSCSEL_enum {
	OSC_XOSCSEL_EXTCLK_gc = (0x00<<0),	///< External Clock - 6 CLK
	OSC_XOSCSEL_32KHz_gc = (0x02<<0),	///< 32kHz TOSC - 32K CLK
	OSC_XOSCSEL_XTAL_256CLK_gc = (0x03<<0),	///< 0.4-16MHz XTAL - 256 CLK
	OSC_XOSCSEL_XTAL_1KCLK_gc = (0x07<<0),	///< 0.4-16MHz XTAL - 1K CLK
	OSC_XOSCSEL_XTAL_16KCLK_gc = (0x0B<<0),	///< 0.4-16MHz XTAL - 16K CLK
} OSC_XOSCSEL_t;

/// PLL Clock Source

typedef enum OSC_PLLSRC_enum {
	OSC_PLLSRC_RC2M_gc = (0x00<<6),	///< Internal 2MHz RC Oscillator
	OSC_PLLSRC_RC32M_gc = (0x02<<6),	///< Internal 32MHz RC Oscillator
	OSC_PLLSRC_XOSC_gc = (0x03<<6),	///< External Oscillator
} OSC_PLLSRC_t;

