dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Oscillator Frequency Range
#define OSC_FRQRANGE_04TO2_gc (0x00<<6)	///< 0.4 - 2 MHz
#define OSC_FRQRANGE_2TO9_gc (0x01<<6)	///< 2 - 9 MHz
#define OSC_FRQRANGE_9TO12_gc (0x02<<6)	///< 9 - 12 MHz
#define OSC_FRQRANGE_12TO16_gc (0x03<<6)	///< 12 - 16 MHz

/// External Oscillator Selection and Startup Time
#define OSC_XOSCSEL_EXTCLK_gc (0x00<<0)	///< External Clock - 6 CLK
#define OSC_XOSCSEL_32KHz_gc (0x02<<0)	///< 32kHz TOSC - 32K CLK
#define OSC_XOSCSEL_XTAL_256CLK_gc (0x03<<0)	///< 0.4-16MHz XTAL - 256 CLK
#define OSC_XOSCSEL_XTAL_1KCLK_gc (0x07<<0)	///< 0.4-16MHz XTAL - 1K CLK
#define OSC_XOSCSEL_XTAL_16KCLK_gc (0x0B<<0)	///< 0.4-16MHz XTAL - 16K CLK

/// PLL Clock Source
#define OSC_PLLSRC_RC2M_gc (0x00<<6)	///< Internal 2MHz RC Oscillator
#define OSC_PLLSRC_RC32M_gc (0x02<<6)	///< Internal 32MHz RC Oscillator
#define OSC_PLLSRC_XOSC_gc (0x03<<6)	///< External Oscillator

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup dfll DFLL
 *  @{
 */

/** @name DFLL.CTRL
  * @{
  */
#define DFLL_ENABLE_bm 0x01 ///< DFLL Enable bit mask
#define DFLL_ENABLE_bp 0 ///< DFLL Enable bit position
/** @} */

/** @name DFLL.CALA
  * @{
  */
#define DFLL_CALL_gm 0x7F ///< DFLL Calibration bits [6:0] group mask
#define DFLL_CALL_gp 0 ///< DFLL Calibration bits [6:0] group position
#define DFLL_CALL0_bm (1<<0) ///< DFLL Calibration bits [6:0] bit 0 mask
#define DFLL_CALL0_bp 0 ///< DFLL Calibration bits [6:0] bit 0 position
#define DFLL_CALL1_bm (1<<1) ///< DFLL Calibration bits [6:0] bit 1 mask
#define DFLL_CALL1_bp 1 ///< DFLL Calibration bits [6:0] bit 1 position
#define DFLL_CALL2_bm (1<<2) ///< DFLL Calibration bits [6:0] bit 2 mask
#define DFLL_CALL2_bp 2 ///< DFLL Calibration bits [6:0] bit 2 position
#define DFLL_CALL3_bm (1<<3) ///< DFLL Calibration bits [6:0] bit 3 mask
#define DFLL_CALL3_bp 3 ///< DFLL Calibration bits [6:0] bit 3 position
#define DFLL_CALL4_bm (1<<4) ///< DFLL Calibration bits [6:0] bit 4 mask
#define DFLL_CALL4_bp 4 ///< DFLL Calibration bits [6:0] bit 4 position
#define DFLL_CALL5_bm (1<<5) ///< DFLL Calibration bits [6:0] bit 5 mask
#define DFLL_CALL5_bp 5 ///< DFLL Calibration bits [6:0] bit 5 position
#define DFLL_CALL6_bm (1<<6) ///< DFLL Calibration bits [6:0] bit 6 mask
#define DFLL_CALL6_bp 6 ///< DFLL Calibration bits [6:0] bit 6 position
/** @} */

/** @name DFLL.CALB
  * @{
  */
#define DFLL_CALH_gm 0x3F ///< DFLL Calibration bits [12:7] group mask
#define DFLL_CALH_gp 0 ///< DFLL Calibration bits [12:7] group position
#define DFLL_CALH0_bm (1<<0) ///< DFLL Calibration bits [12:7] bit 0 mask
#define DFLL_CALH0_bp 0 ///< DFLL Calibration bits [12:7] bit 0 position
#define DFLL_CALH1_bm (1<<1) ///< DFLL Calibration bits [12:7] bit 1 mask
#define DFLL_CALH1_bp 1 ///< DFLL Calibration bits [12:7] bit 1 position
#define DFLL_CALH2_bm (1<<2) ///< DFLL Calibration bits [12:7] bit 2 mask
#define DFLL_CALH2_bp 2 ///< DFLL Calibration bits [12:7] bit 2 position
#define DFLL_CALH3_bm (1<<3) ///< DFLL Calibration bits [12:7] bit 3 mask
#define DFLL_CALH3_bp 3 ///< DFLL Calibration bits [12:7] bit 3 position
#define DFLL_CALH4_bm (1<<4) ///< DFLL Calibration bits [12:7] bit 4 mask
#define DFLL_CALH4_bp 4 ///< DFLL Calibration bits [12:7] bit 4 position
#define DFLL_CALH5_bm (1<<5) ///< DFLL Calibration bits [12:7] bit 5 mask
#define DFLL_CALH5_bp 5 ///< DFLL Calibration bits [12:7] bit 5 position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup rst Reset
 *  @{
 */

/** @name RST.STATUS
  * @{
  */
#define RST_SDRF_bm 0x40 ///< Spike Detection Reset Flag bit mask
#define RST_SDRF_bp 6 ///< Spike Detection Reset Flag bit position
#define RST_SRF_bm 0x20 ///< Software Reset Flag bit mask
#define RST_SRF_bp 5 ///< Software Reset Flag bit position
#define RST_PDIRF_bm 0x10 ///< Programming and Debug Interface Interface Reset Flag bit mask
#define RST_PDIRF_bp 4 ///< Programming and Debug Interface Interface Reset Flag bit position
#define RST_WDRF_bm 0x08 ///< Watchdog Reset Flag bit mask
#define RST_WDRF_bp 3 ///< Watchdog Reset Flag bit position
#define RST_BORF_bm 0x04 ///< Brown-out Reset Flag bit mask
#define RST_BORF_bp 2 ///< Brown-out Reset Flag bit position
#define RST_EXTRF_bm 0x02 ///< External Reset Flag bit mask
#define RST_EXTRF_bp 1 ///< External Reset Flag bit position
#define RST_PORF_bm 0x01 ///< Power-on Reset Flag bit mask
#define RST_PORF_bp 0 ///< Power-on Reset Flag bit position
/** @} */

/** @name RST.CTRL
  * @{
  */
#define RST_SWRST_bm 0x01 ///< Software Reset bit mask
#define RST_SWRST_bp 0 ///< Software Reset bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup wdt Watch-Dog Timer
 *  @{
 */

/** @name WDT.CTRL
  * @see WDT_PER_enum
  * @{
  */
#define WDT_PER_gm 0x3C ///< Period group mask
#define WDT_PER_gp 2 ///< Period group position
#define WDT_PER0_bm (1<<2) ///< Period bit 0 mask
#define WDT_PER0_bp 2 ///< Period bit 0 position
#define WDT_PER1_bm (1<<3) ///< Period bit 1 mask
#define WDT_PER1_bp 3 ///< Period bit 1 position
#define WDT_PER2_bm (1<<4) ///< Period bit 2 mask
#define WDT_PER2_bp 4 ///< Period bit 2 position
#define WDT_PER3_bm (1<<5) ///< Period bit 3 mask
#define WDT_PER3_bp 5 ///< Period bit 3 position
#define WDT_ENABLE_bm 0x02 ///< Enable bit mask
#define WDT_ENABLE_bp 1 ///< Enable bit position
#define WDT_CEN_bm 0x01 ///< Change Enable bit mask
#define WDT_CEN_bp 0 ///< Change Enable bit position
/** @} */

/** @name WDT.WINCTRL
  * @see WDT_WPER_enum
  * @{
  */
#define WDT_WPER_gm 0x3C ///< Windowed Mode Period group mask
#define WDT_WPER_gp 2 ///< Windowed Mode Period group position
#define WDT_WPER0_bm (1<<2) ///< Windowed Mode Period bit 0 mask
#define WDT_WPER0_bp 2 ///< Windowed Mode Period bit 0 position
#define WDT_WPER1_bm (1<<3) ///< Windowed Mode Period bit 1 mask
#define WDT_WPER1_bp 3 ///< Windowed Mode Period bit 1 position
#define WDT_WPER2_bm (1<<4) ///< Windowed Mode Period bit 2 mask
#define WDT_WPER2_bp 4 ///< Windowed Mode Period bit 2 position
#define WDT_WPER3_bm (1<<5) ///< Windowed Mode Period bit 3 mask
#define WDT_WPER3_bp 5 ///< Windowed Mode Period bit 3 position
#define WDT_WEN_bm 0x02 ///< Windowed Mode Enable bit mask
#define WDT_WEN_bp 1 ///< Windowed Mode Enable bit position
#define WDT_WCEN_bm 0x01 ///< Windowed Mode Change Enable bit mask
#define WDT_WCEN_bp 0 ///< Windowed Mode Change Enable bit position
/** @} */

