dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name WDT.STATUS
  * @{
  */
#define WDT_SYNCBUSY_bm 0x01 ///< Syncronization busy bit mask
#define WDT_SYNCBUSY_bp 0 ///< Syncronization busy bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Period setting

typedef enum WDT_PER_enum {
	WDT_PER_8CLK_gc = (0x00<<2),	///< 8 cycles (8ms @ 3.3V)
	WDT_PER_16CLK_gc = (0x01<<2),	///< 16 cycles (16ms @ 3.3V)
	WDT_PER_32CLK_gc = (0x02<<2),	///< 32 cycles (32ms @ 3.3V)
	WDT_PER_64CLK_gc = (0x03<<2),	///< 64 cycles (64ms @ 3.3V)
	WDT_PER_125CLK_gc = (0x04<<2),	///< 125 cycles (0.125s @ 3.3V)
	WDT_PER_250CLK_gc = (0x05<<2),	///< 250 cycles (0.25s @ 3.3V)
	WDT_PER_500CLK_gc = (0x06<<2),	///< 500 cycles (0.5s @ 3.3V)
	WDT_PER_1KCLK_gc = (0x07<<2),	///< 1K cycles (1s @ 3.3V)
	WDT_PER_2KCLK_gc = (0x08<<2),	///< 2K cycles (2s @ 3.3V)
	WDT_PER_4KCLK_gc = (0x09<<2),	///< 4K cycles (4s @ 3.3V)
	WDT_PER_8KCLK_gc = (0x0A<<2),	///< 8K cycles (8s @ 3.3V)
} WDT_PER_t;

/// Closed window period

typedef enum WDT_WPER_enum {
	WDT_WPER_8CLK_gc = (0x00<<2),	///< 8 cycles (8ms @ 3.3V)
	WDT_WPER_16CLK_gc = (0x01<<2),	///< 16 cycles (16ms @ 3.3V)
	WDT_WPER_32CLK_gc = (0x02<<2),	///< 32 cycles (32ms @ 3.3V)
	WDT_WPER_64CLK_gc = (0x03<<2),	///< 64 cycles (64ms @ 3.3V)
	WDT_WPER_125CLK_gc = (0x04<<2),	///< 125 cycles (0.125s @ 3.3V)
	WDT_WPER_250CLK_gc = (0x05<<2),	///< 250 cycles (0.25s @ 3.3V)
	WDT_WPER_500CLK_gc = (0x06<<2),	///< 500 cycles (0.5s @ 3.3V)
	WDT_WPER_1KCLK_gc = (0x07<<2),	///< 1K cycles (1s @ 3.3V)
	WDT_WPER_2KCLK_gc = (0x08<<2),	///< 2K cycles (2s @ 3.3V)
	WDT_WPER_4KCLK_gc = (0x09<<2),	///< 4K cycles (4s @ 3.3V)
	WDT_WPER_8KCLK_gc = (0x0A<<2),	///< 8K cycles (8s @ 3.3V)
} WDT_WPER_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Period setting
#define WDT_PER_8CLK_gc (0x00<<2)	///< 8 cycles (8ms @ 3.3V)
#define WDT_PER_16CLK_gc (0x01<<2)	///< 16 cycles (16ms @ 3.3V)
#define WDT_PER_32CLK_gc (0x02<<2)	///< 32 cycles (32ms @ 3.3V)
#define WDT_PER_64CLK_gc (0x03<<2)	///< 64 cycles (64ms @ 3.3V)
#define WDT_PER_125CLK_gc (0x04<<2)	///< 125 cycles (0.125s @ 3.3V)
#define WDT_PER_250CLK_gc (0x05<<2)	///< 250 cycles (0.25s @ 3.3V)
#define WDT_PER_500CLK_gc (0x06<<2)	///< 500 cycles (0.5s @ 3.3V)
#define WDT_PER_1KCLK_gc (0x07<<2)	///< 1K cycles (1s @ 3.3V)
#define WDT_PER_2KCLK_gc (0x08<<2)	///< 2K cycles (2s @ 3.3V)
#define WDT_PER_4KCLK_gc (0x09<<2)	///< 4K cycles (4s @ 3.3V)
#define WDT_PER_8KCLK_gc (0x0A<<2)	///< 8K cycles (8s @ 3.3V)

/// Closed window period
#define WDT_WPER_8CLK_gc (0x00<<2)	///< 8 cycles (8ms @ 3.3V)
#define WDT_WPER_16CLK_gc (0x01<<2)	///< 16 cycles (16ms @ 3.3V)
#define WDT_WPER_32CLK_gc (0x02<<2)	///< 32 cycles (32ms @ 3.3V)
#define WDT_WPER_64CLK_gc (0x03<<2)	///< 64 cycles (64ms @ 3.3V)
#define WDT_WPER_125CLK_gc (0x04<<2)	///< 125 cycles (0.125s @ 3.3V)
#define WDT_WPER_250CLK_gc (0x05<<2)	///< 250 cycles (0.25s @ 3.3V)
#define WDT_WPER_500CLK_gc (0x06<<2)	///< 500 cycles (0.5s @ 3.3V)
#define WDT_WPER_1KCLK_gc (0x07<<2)	///< 1K cycles (1s @ 3.3V)
#define WDT_WPER_2KCLK_gc (0x08<<2)	///< 2K cycles (2s @ 3.3V)
#define WDT_WPER_4KCLK_gc (0x09<<2)	///< 4K cycles (4s @ 3.3V)
#define WDT_WPER_8KCLK_gc (0x0A<<2)	///< 8K cycles (8s @ 3.3V)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup mcu MCU Control
 *  @{
 */

/** @name MCU.MCUCR
  * @{
  */
#define MCU_JTAGD_bm 0x01 ///< JTAG Disable bit mask
#define MCU_JTAGD_bp 0 ///< JTAG Disable bit position
/** @} */

/** @name MCU.EVSYSLOCK
  * @{
  */
#define MCU_EVSYS1LOCK_bm 0x10 ///< Event Channel 4-7 Lock bit mask
#define MCU_EVSYS1LOCK_bp 4 ///< Event Channel 4-7 Lock bit position
#define MCU_EVSYS0LOCK_bm 0x01 ///< Event Channel 0-3 Lock bit mask
#define MCU_EVSYS0LOCK_bp 0 ///< Event Channel 0-3 Lock bit position
/** @} */

/** @name MCU.AWEXLOCK
  * @{
  */
#define MCU_AWEXELOCK_bm 0x04 ///< AWeX on T/C E0 Lock bit mask
#define MCU_AWEXELOCK_bp 2 ///< AWeX on T/C E0 Lock bit position
#define MCU_AWEXCLOCK_bm 0x01 ///< AWeX on T/C C0 Lock bit mask
#define MCU_AWEXCLOCK_bp 0 ///< AWeX on T/C C0 Lock bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup pmic Programmable Multi-level Interrupt Controller
 *  @{
 */

/** @name PMIC.STATUS
  * @{
  */
#define PMIC_NMIEX_bm 0x80 ///< Non-maskable Interrupt Executing bit mask
#define PMIC_NMIEX_bp 7 ///< Non-maskable Interrupt Executing bit position
#define PMIC_HILVLEX_bm 0x04 ///< High Level Interrupt Executing bit mask
#define PMIC_HILVLEX_bp 2 ///< High Level Interrupt Executing bit position
#define PMIC_MEDLVLEX_bm 0x02 ///< Medium Level Interrupt Executing bit mask
#define PMIC_MEDLVLEX_bp 1 ///< Medium Level Interrupt Executing bit position
#define PMIC_LOLVLEX_bm 0x01 ///< Low Level Interrupt Executing bit mask
#define PMIC_LOLVLEX_bp 0 ///< Low Level Interrupt Executing bit position
/** @} */

/** @name PMIC.CTRL
  * @{
  */
#define PMIC_RREN_bm 0x80 ///< Round-Robin Priority Enable bit mask
#define PMIC_RREN_bp 7 ///< Round-Robin Priority Enable bit position
#define PMIC_IVSEL_bm 0x40 ///< Interrupt Vector Select bit mask
#define PMIC_IVSEL_bp 6 ///< Interrupt Vector Select bit position
#define PMIC_HILVLEN_bm 0x04 ///< High Level Enable bit mask
#define PMIC_HILVLEN_bp 2 ///< High Level Enable bit position
#define PMIC_MEDLVLEN_bm 0x02 ///< Medium Level Enable bit mask
#define PMIC_MEDLVLEN_bp 1 ///< Medium Level Enable bit position
#define PMIC_LOLVLEN_bm 0x01 ///< Low Level Enable bit mask
#define PMIC_LOLVLEN_bp 0 ///< Low Level Enable bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup evsys Event System
 *  @{
 */

/** @name EVSYS.CH0MUX
  * @see EVSYS_CHMUX_enum
  * @{
  */
#define EVSYS_CHMUX_gm 0xFF ///< Event Channel 0 Multiplexer group mask
#define EVSYS_CHMUX_gp 0 ///< Event Channel 0 Multiplexer group position
#define EVSYS_CHMUX0_bm (1<<0) ///< Event Channel 0 Multiplexer bit 0 mask
#define EVSYS_CHMUX0_bp 0 ///< Event Channel 0 Multiplexer bit 0 position
#define EVSYS_CHMUX1_bm (1<<1) ///< Event Channel 0 Multiplexer bit 1 mask
#define EVSYS_CHMUX1_bp 1 ///< Event Channel 0 Multiplexer bit 1 position
#define EVSYS_CHMUX2_bm (1<<2) ///< Event Channel 0 Multiplexer bit 2 mask
#define EVSYS_CHMUX2_bp 2 ///< Event Channel 0 Multiplexer bit 2 position
#define EVSYS_CHMUX3_bm (1<<3) ///< Event Channel 0 Multiplexer bit 3 mask
#define EVSYS_CHMUX3_bp 3 ///< Event Channel 0 Multiplexer bit 3 position
#define EVSYS_CHMUX4_bm (1<<4) ///< Event Channel 0 Multiplexer bit 4 mask
#define EVSYS_CHMUX4_bp 4 ///< Event Channel 0 Multiplexer bit 4 position
#define EVSYS_CHMUX5_bm (1<<5) ///< Event Channel 0 Multiplexer bit 5 mask
#define EVSYS_CHMUX5_bp 5 ///< Event Channel 0 Multiplexer bit 5 position
#define EVSYS_CHMUX6_bm (1<<6) ///< Event Channel 0 Multiplexer bit 6 mask
#define EVSYS_CHMUX6_bp 6 ///< Event Channel 0 Multiplexer bit 6 position
#define EVSYS_CHMUX7_bm (1<<7) ///< Event Channel 0 Multiplexer bit 7 mask
#define EVSYS_CHMUX7_bp 7 ///< Event Channel 0 Multiplexer bit 7 position
/** @} */

/** @name EVSYS.CH1MUX
  * @see EVSYS_CHMUX_enum
  * @{
  */
// Masks for CHMUX aready defined
/** @} */

