dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Quadrature Decoder Index Recognition Mode
#define EVSYS_QDIRM_00_gc (0x00<<5)	///< QDPH0 = 0, QDPH90 = 0
#define EVSYS_QDIRM_01_gc (0x01<<5)	///< QDPH0 = 0, QDPH90 = 1
#define EVSYS_QDIRM_10_gc (0x02<<5)	///< QDPH0 = 1, QDPH90 = 0
#define EVSYS_QDIRM_11_gc (0x03<<5)	///< QDPH0 = 1, QDPH90 = 1

/// Digital filter coefficient
#define EVSYS_DIGFILT_1SAMPLE_gc (0x00<<0)	///< 1 SAMPLE
#define EVSYS_DIGFILT_2SAMPLES_gc (0x01<<0)	///< 2 SAMPLES
#define EVSYS_DIGFILT_3SAMPLES_gc (0x02<<0)	///< 3 SAMPLES
#define EVSYS_DIGFILT_4SAMPLES_gc (0x03<<0)	///< 4 SAMPLES
#define EVSYS_DIGFILT_5SAMPLES_gc (0x04<<0)	///< 5 SAMPLES
#define EVSYS_DIGFILT_6SAMPLES_gc (0x05<<0)	///< 6 SAMPLES
#define EVSYS_DIGFILT_7SAMPLES_gc (0x06<<0)	///< 7 SAMPLES
#define EVSYS_DIGFILT_8SAMPLES_gc (0x07<<0)	///< 8 SAMPLES

/// Event Channel multiplexer input selection
#define EVSYS_CHMUX_OFF_gc (0x00<<0)	///< Off
#define EVSYS_CHMUX_RTC_OVF_gc (0x08<<0)	///< RTC Overflow
#define EVSYS_CHMUX_RTC_CMP_gc (0x09<<0)	///< RTC Compare Match
#define EVSYS_CHMUX_ACA_CH0_gc (0x10<<0)	///< Analog Comparator A Channel 0
#define EVSYS_CHMUX_ACA_CH1_gc (0x11<<0)	///< Analog Comparator A Channel 1
#define EVSYS_CHMUX_ACA_WIN_gc (0x12<<0)	///< Analog Comparator A Window
#define EVSYS_CHMUX_ADCA_CH0_gc (0x20<<0)	///< ADC A Channel 0
#define EVSYS_CHMUX_PORTA_PIN0_gc (0x50<<0)	///< Port A, Pin0
#define EVSYS_CHMUX_PORTA_PIN1_gc (0x51<<0)	///< Port A, Pin1
#define EVSYS_CHMUX_PORTA_PIN2_gc (0x52<<0)	///< Port A, Pin2
#define EVSYS_CHMUX_PORTA_PIN3_gc (0x53<<0)	///< Port A, Pin3
#define EVSYS_CHMUX_PORTA_PIN4_gc (0x54<<0)	///< Port A, Pin4
#define EVSYS_CHMUX_PORTA_PIN5_gc (0x55<<0)	///< Port A, Pin5
#define EVSYS_CHMUX_PORTA_PIN6_gc (0x56<<0)	///< Port A, Pin6
#define EVSYS_CHMUX_PORTA_PIN7_gc (0x57<<0)	///< Port A, Pin7
#define EVSYS_CHMUX_PORTB_PIN0_gc (0x58<<0)	///< Port B, Pin0
#define EVSYS_CHMUX_PORTB_PIN1_gc (0x59<<0)	///< Port B, Pin1
#define EVSYS_CHMUX_PORTB_PIN2_gc (0x5A<<0)	///< Port B, Pin2
#define EVSYS_CHMUX_PORTB_PIN3_gc (0x5B<<0)	///< Port B, Pin3
#define EVSYS_CHMUX_PORTB_PIN4_gc (0x5C<<0)	///< Port B, Pin4
#define EVSYS_CHMUX_PORTB_PIN5_gc (0x5D<<0)	///< Port B, Pin5
#define EVSYS_CHMUX_PORTB_PIN6_gc (0x5E<<0)	///< Port B, Pin6
#define EVSYS_CHMUX_PORTB_PIN7_gc (0x5F<<0)	///< Port B, Pin7
#define EVSYS_CHMUX_PORTC_PIN0_gc (0x60<<0)	///< Port C, Pin0
#define EVSYS_CHMUX_PORTC_PIN1_gc (0x61<<0)	///< Port C, Pin1
#define EVSYS_CHMUX_PORTC_PIN2_gc (0x62<<0)	///< Port C, Pin2
#define EVSYS_CHMUX_PORTC_PIN3_gc (0x63<<0)	///< Port C, Pin3
#define EVSYS_CHMUX_PORTC_PIN4_gc (0x64<<0)	///< Port C, Pin4
#define EVSYS_CHMUX_PORTC_PIN5_gc (0x65<<0)	///< Port C, Pin5
#define EVSYS_CHMUX_PORTC_PIN6_gc (0x66<<0)	///< Port C, Pin6
#define EVSYS_CHMUX_PORTC_PIN7_gc (0x67<<0)	///< Port C, Pin7
#define EVSYS_CHMUX_PORTD_PIN0_gc (0x68<<0)	///< Port D, Pin0
#define EVSYS_CHMUX_PORTD_PIN1_gc (0x69<<0)	///< Port D, Pin1
#define EVSYS_CHMUX_PORTD_PIN2_gc (0x6A<<0)	///< Port D, Pin2
#define EVSYS_CHMUX_PORTD_PIN3_gc (0x6B<<0)	///< Port D, Pin3
#define EVSYS_CHMUX_PORTD_PIN4_gc (0x6C<<0)	///< Port D, Pin4
#define EVSYS_CHMUX_PORTD_PIN5_gc (0x6D<<0)	///< Port D, Pin5
#define EVSYS_CHMUX_PORTD_PIN6_gc (0x6E<<0)	///< Port D, Pin6
#define EVSYS_CHMUX_PORTD_PIN7_gc (0x6F<<0)	///< Port D, Pin7
#define EVSYS_CHMUX_PORTE_PIN0_gc (0x70<<0)	///< Port E, Pin0
#define EVSYS_CHMUX_PORTE_PIN1_gc (0x71<<0)	///< Port E, Pin1
#define EVSYS_CHMUX_PORTE_PIN2_gc (0x72<<0)	///< Port E, Pin2
#define EVSYS_CHMUX_PORTE_PIN3_gc (0x73<<0)	///< Port E, Pin3
#define EVSYS_CHMUX_PORTE_PIN4_gc (0x74<<0)	///< Port E, Pin4
#define EVSYS_CHMUX_PORTE_PIN5_gc (0x75<<0)	///< Port E, Pin5
#define EVSYS_CHMUX_PORTE_PIN6_gc (0x76<<0)	///< Port E, Pin6
#define EVSYS_CHMUX_PORTE_PIN7_gc (0x77<<0)	///< Port E, Pin7
#define EVSYS_CHMUX_PORTF_PIN0_gc (0x78<<0)	///< Port F, Pin0
#define EVSYS_CHMUX_PORTF_PIN1_gc (0x79<<0)	///< Port F, Pin1
#define EVSYS_CHMUX_PORTF_PIN2_gc (0x7A<<0)	///< Port F, Pin2
#define EVSYS_CHMUX_PORTF_PIN3_gc (0x7B<<0)	///< Port F, Pin3
#define EVSYS_CHMUX_PORTF_PIN4_gc (0x7C<<0)	///< Port F, Pin4
#define EVSYS_CHMUX_PORTF_PIN5_gc (0x7D<<0)	///< Port F, Pin5
#define EVSYS_CHMUX_PORTF_PIN6_gc (0x7E<<0)	///< Port F, Pin6
#define EVSYS_CHMUX_PORTF_PIN7_gc (0x7F<<0)	///< Port F, Pin7
#define EVSYS_CHMUX_PRESCALER_1_gc (0x80<<0)	///< Prescaler, divide by 1
#define EVSYS_CHMUX_PRESCALER_2_gc (0x81<<0)	///< Prescaler, divide by 2
#define EVSYS_CHMUX_PRESCALER_4_gc (0x82<<0)	///< Prescaler, divide by 4
#define EVSYS_CHMUX_PRESCALER_8_gc (0x83<<0)	///< Prescaler, divide by 8
#define EVSYS_CHMUX_PRESCALER_16_gc (0x84<<0)	///< Prescaler, divide by 16
#define EVSYS_CHMUX_PRESCALER_32_gc (0x85<<0)	///< Prescaler, divide by 32
#define EVSYS_CHMUX_PRESCALER_64_gc (0x86<<0)	///< Prescaler, divide by 64
#define EVSYS_CHMUX_PRESCALER_128_gc (0x87<<0)	///< Prescaler, divide by 128
#define EVSYS_CHMUX_PRESCALER_256_gc (0x88<<0)	///< Prescaler, divide by 256
#define EVSYS_CHMUX_PRESCALER_512_gc (0x89<<0)	///< Prescaler, divide by 512
#define EVSYS_CHMUX_PRESCALER_1024_gc (0x8A<<0)	///< Prescaler, divide by 1024
#define EVSYS_CHMUX_PRESCALER_2048_gc (0x8B<<0)	///< Prescaler, divide by 2048
#define EVSYS_CHMUX_PRESCALER_4096_gc (0x8C<<0)	///< Prescaler, divide by 4096
#define EVSYS_CHMUX_PRESCALER_8192_gc (0x8D<<0)	///< Prescaler, divide by 8192
#define EVSYS_CHMUX_PRESCALER_16384_gc (0x8E<<0)	///< Prescaler, divide by 16384
#define EVSYS_CHMUX_PRESCALER_32768_gc (0x8F<<0)	///< Prescaler, divide by 32768
#define EVSYS_CHMUX_TCC0_OVF_gc (0xC0<<0)	///< Timer/Counter C0 Overflow
#define EVSYS_CHMUX_TCC0_ERR_gc (0xC1<<0)	///< Timer/Counter C0 Error
#define EVSYS_CHMUX_TCC0_CCA_gc (0xC4<<0)	///< Timer/Counter C0 Compare or Capture A
#define EVSYS_CHMUX_TCC0_CCB_gc (0xC5<<0)	///< Timer/Counter C0 Compare or Capture B
#define EVSYS_CHMUX_TCC0_CCC_gc (0xC6<<0)	///< Timer/Counter C0 Compare or Capture C
#define EVSYS_CHMUX_TCC0_CCD_gc (0xC7<<0)	///< Timer/Counter C0 Compare or Capture D
#define EVSYS_CHMUX_TCC1_OVF_gc (0xC8<<0)	///< Timer/Counter C1 Overflow
#define EVSYS_CHMUX_TCC1_ERR_gc (0xC9<<0)	///< Timer/Counter C1 Error
#define EVSYS_CHMUX_TCC1_CCA_gc (0xCC<<0)	///< Timer/Counter C1 Compare or Capture A
#define EVSYS_CHMUX_TCC1_CCB_gc (0xCD<<0)	///< Timer/Counter C1 Compare or Capture B
#define EVSYS_CHMUX_TCD0_OVF_gc (0xD0<<0)	///< Timer/Counter D0 Overflow
#define EVSYS_CHMUX_TCD0_ERR_gc (0xD1<<0)	///< Timer/Counter D0 Error
#define EVSYS_CHMUX_TCD0_CCA_gc (0xD4<<0)	///< Timer/Counter D0 Compare or Capture A
#define EVSYS_CHMUX_TCD0_CCB_gc (0xD5<<0)	///< Timer/Counter D0 Compare or Capture B
#define EVSYS_CHMUX_TCD0_CCC_gc (0xD6<<0)	///< Timer/Counter D0 Compare or Capture C
#define EVSYS_CHMUX_TCD0_CCD_gc (0xD7<<0)	///< Timer/Counter D0 Compare or Capture D
#define EVSYS_CHMUX_TCD1_OVF_gc (0xD8<<0)	///< Timer/Counter D1 Overflow
#define EVSYS_CHMUX_TCD1_ERR_gc (0xD9<<0)	///< Timer/Counter D1 Error
#define EVSYS_CHMUX_TCD1_CCA_gc (0xDC<<0)	///< Timer/Counter D1 Compare or Capture A
#define EVSYS_CHMUX_TCD1_CCB_gc (0xDD<<0)	///< Timer/Counter D1 Compare or Capture B
#define EVSYS_CHMUX_TCE0_OVF_gc (0xE0<<0)	///< Timer/Counter E0 Overflow
#define EVSYS_CHMUX_TCE0_ERR_gc (0xE1<<0)	///< Timer/Counter E0 Error
#define EVSYS_CHMUX_TCE0_CCA_gc (0xE4<<0)	///< Timer/Counter E0 Compare or Capture A
#define EVSYS_CHMUX_TCE0_CCB_gc (0xE5<<0)	///< Timer/Counter E0 Compare or Capture B
#define EVSYS_CHMUX_TCE0_CCC_gc (0xE6<<0)	///< Timer/Counter E0 Compare or Capture C
#define EVSYS_CHMUX_TCE0_CCD_gc (0xE7<<0)	///< Timer/Counter E0 Compare or Capture D
#define EVSYS_CHMUX_TCE1_OVF_gc (0xE8<<0)	///< Timer/Counter E1 Overflow
#define EVSYS_CHMUX_TCE1_ERR_gc (0xE9<<0)	///< Timer/Counter E1 Error
#define EVSYS_CHMUX_TCE1_CCA_gc (0xEC<<0)	///< Timer/Counter E1 Compare or Capture A
#define EVSYS_CHMUX_TCE1_CCB_gc (0xED<<0)	///< Timer/Counter E1 Compare or Capture B
#define EVSYS_CHMUX_TCF0_OVF_gc (0xF0<<0)	///< Timer/Counter F0 Overflow
#define EVSYS_CHMUX_TCF0_ERR_gc (0xF1<<0)	///< Timer/Counter F0 Error
#define EVSYS_CHMUX_TCF0_CCA_gc (0xF4<<0)	///< Timer/Counter F0 Compare or Capture A
#define EVSYS_CHMUX_TCF0_CCB_gc (0xF5<<0)	///< Timer/Counter F0 Compare or Capture B
#define EVSYS_CHMUX_TCF0_CCC_gc (0xF6<<0)	///< Timer/Counter F0 Compare or Capture C
#define EVSYS_CHMUX_TCF0_CCD_gc (0xF7<<0)	///< Timer/Counter F0 Compare or Capture D
#define EVSYS_CHMUX_TCF1_OVF_gc (0xF8<<0)	///< Timer/Counter F1 Overflow
#define EVSYS_CHMUX_TCF1_ERR_gc (0xF9<<0)	///< Timer/Counter F1 Error
#define EVSYS_CHMUX_TCF1_CCA_gc (0xFC<<0)	///< Timer/Counter F1 Compare or Capture A
#define EVSYS_CHMUX_TCF1_CCB_gc (0xFD<<0)	///< Timer/Counter F1 Compare or Capture B

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup nvm Non Volatile Memory Controller
 *  @{
 */

