dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name NVM.CMD
  * @see NVM_CMD_enum
  * @{
  */
#define NVM_CMD_gm 0xFF ///< Command group mask
#define NVM_CMD_gp 0 ///< Command group position
#define NVM_CMD0_bm (1<<0) ///< Command bit 0 mask
#define NVM_CMD0_bp 0 ///< Command bit 0 position
#define NVM_CMD1_bm (1<<1) ///< Command bit 1 mask
#define NVM_CMD1_bp 1 ///< Command bit 1 position
#define NVM_CMD2_bm (1<<2) ///< Command bit 2 mask
#define NVM_CMD2_bp 2 ///< Command bit 2 position
#define NVM_CMD3_bm (1<<3) ///< Command bit 3 mask
#define NVM_CMD3_bp 3 ///< Command bit 3 position
#define NVM_CMD4_bm (1<<4) ///< Command bit 4 mask
#define NVM_CMD4_bp 4 ///< Command bit 4 position
#define NVM_CMD5_bm (1<<5) ///< Command bit 5 mask
#define NVM_CMD5_bp 5 ///< Command bit 5 position
#define NVM_CMD6_bm (1<<6) ///< Command bit 6 mask
#define NVM_CMD6_bp 6 ///< Command bit 6 position
#define NVM_CMD7_bm (1<<7) ///< Command bit 7 mask
#define NVM_CMD7_bp 7 ///< Command bit 7 position
/** @} */

/** @name NVM.CTRLA
  * @{
  */
#define NVM_CMDEX_bm 0x01 ///< Command Execute bit mask
#define NVM_CMDEX_bp 0 ///< Command Execute bit position
/** @} */

/** @name NVM.CTRLB
  * @{
  */
#define NVM_EEMAPEN_bm 0x08 ///< EEPROM Mapping Enable bit mask
#define NVM_EEMAPEN_bp 3 ///< EEPROM Mapping Enable bit position
#define NVM_FPRM_bm 0x04 ///< Flash Power Reduction Enable bit mask
#define NVM_FPRM_bp 2 ///< Flash Power Reduction Enable bit position
#define NVM_EPRM_bm 0x02 ///< EEPROM Power Reduction Enable bit mask
#define NVM_EPRM_bp 1 ///< EEPROM Power Reduction Enable bit position
#define NVM_SPMLOCK_bm 0x01 ///< SPM Lock bit mask
#define NVM_SPMLOCK_bp 0 ///< SPM Lock bit position
/** @} */

/** @name NVM.INTCTRL
  * @see NVM_SPMLVL_enum
  * @see NVM_EELVL_enum
  * @{
  */
#define NVM_SPMLVL_gm 0x0C ///< SPM Interrupt Level group mask
#define NVM_SPMLVL_gp 2 ///< SPM Interrupt Level group position
#define NVM_SPMLVL0_bm (1<<2) ///< SPM Interrupt Level bit 0 mask
#define NVM_SPMLVL0_bp 2 ///< SPM Interrupt Level bit 0 position
#define NVM_SPMLVL1_bm (1<<3) ///< SPM Interrupt Level bit 1 mask
#define NVM_SPMLVL1_bp 3 ///< SPM Interrupt Level bit 1 position
#define NVM_EELVL_gm 0x03 ///< EEPROM Interrupt Level group mask
#define NVM_EELVL_gp 0 ///< EEPROM Interrupt Level group position
#define NVM_EELVL0_bm (1<<0) ///< EEPROM Interrupt Level bit 0 mask
#define NVM_EELVL0_bp 0 ///< EEPROM Interrupt Level bit 0 position
#define NVM_EELVL1_bm (1<<1) ///< EEPROM Interrupt Level bit 1 mask
#define NVM_EELVL1_bp 1 ///< EEPROM Interrupt Level bit 1 position
/** @} */

/** @name NVM.STATUS
  * @{
  */
#define NVM_NVMBUSY_bm 0x80 ///< Non-volatile Memory Busy bit mask
#define NVM_NVMBUSY_bp 7 ///< Non-volatile Memory Busy bit position
#define NVM_FBUSY_bm 0x40 ///< Flash Memory Busy bit mask
#define NVM_FBUSY_bp 6 ///< Flash Memory Busy bit position
#define NVM_EELOAD_bm 0x02 ///< EEPROM Page Buffer Active Loading bit mask
#define NVM_EELOAD_bp 1 ///< EEPROM Page Buffer Active Loading bit position
#define NVM_FLOAD_bm 0x01 ///< Flash Page Buffer Active Loading bit mask
#define NVM_FLOAD_bp 0 ///< Flash Page Buffer Active Loading bit position
/** @} */

/** @name NVM.LOCKBITS
  * @see NVM_BLBB_enum
  * @see NVM_BLBA_enum
  * @see NVM_BLBAT_enum
  * @see NVM_LB_enum
  * @{
  */
#define NVM_BLBB_gm 0xC0 ///< Boot Lock Bits - Boot Section group mask
#define NVM_BLBB_gp 6 ///< Boot Lock Bits - Boot Section group position
#define NVM_BLBB0_bm (1<<6) ///< Boot Lock Bits - Boot Section bit 0 mask
#define NVM_BLBB0_bp 6 ///< Boot Lock Bits - Boot Section bit 0 position
#define NVM_BLBB1_bm (1<<7) ///< Boot Lock Bits - Boot Section bit 1 mask
#define NVM_BLBB1_bp 7 ///< Boot Lock Bits - Boot Section bit 1 position
#define NVM_BLBA_gm 0x30 ///< Boot Lock Bits - Application Section group mask
#define NVM_BLBA_gp 4 ///< Boot Lock Bits - Application Section group position
#define NVM_BLBA0_bm (1<<4) ///< Boot Lock Bits - Application Section bit 0 mask
#define NVM_BLBA0_bp 4 ///< Boot Lock Bits - Application Section bit 0 position
#define NVM_BLBA1_bm (1<<5) ///< Boot Lock Bits - Application Section bit 1 mask
#define NVM_BLBA1_bp 5 ///< Boot Lock Bits - Application Section bit 1 position
#define NVM_BLBAT_gm 0x0C ///< Boot Lock Bits - Application Table group mask
#define NVM_BLBAT_gp 2 ///< Boot Lock Bits - Application Table group position
#define NVM_BLBAT0_bm (1<<2) ///< Boot Lock Bits - Application Table bit 0 mask
#define NVM_BLBAT0_bp 2 ///< Boot Lock Bits - Application Table bit 0 position
#define NVM_BLBAT1_bm (1<<3) ///< Boot Lock Bits - Application Table bit 1 mask
#define NVM_BLBAT1_bp 3 ///< Boot Lock Bits - Application Table bit 1 position
#define NVM_LB_gm 0x03 ///< Lock Bits group mask
#define NVM_LB_gp 0 ///< Lock Bits group position
#define NVM_LB0_bm (1<<0) ///< Lock Bits bit 0 mask
#define NVM_LB0_bp 0 ///< Lock Bits bit 0 position
#define NVM_LB1_bm (1<<1) ///< Lock Bits bit 1 mask
#define NVM_LB1_bp 1 ///< Lock Bits bit 1 position
/** @} */

/** @name NVM_LOCKBITS.LOCKBITS
  * @see NVM_BLBB_enum
  * @see NVM_BLBA_enum
  * @see NVM_BLBAT_enum
  * @see NVM_LB_enum
  * @{
  */
#define NVM_LOCKBITS_BLBB_gm 0xC0 ///< Boot Lock Bits - Boot Section group mask
#define NVM_LOCKBITS_BLBB_gp 6 ///< Boot Lock Bits - Boot Section group position
#define NVM_LOCKBITS_BLBB0_bm (1<<6) ///< Boot Lock Bits - Boot Section bit 0 mask
#define NVM_LOCKBITS_BLBB0_bp 6 ///< Boot Lock Bits - Boot Section bit 0 position
#define NVM_LOCKBITS_BLBB1_bm (1<<7) ///< Boot Lock Bits - Boot Section bit 1 mask
#define NVM_LOCKBITS_BLBB1_bp 7 ///< Boot Lock Bits - Boot Section bit 1 position
#define NVM_LOCKBITS_BLBA_gm 0x30 ///< Boot Lock Bits - Application Section group mask
#define NVM_LOCKBITS_BLBA_gp 4 ///< Boot Lock Bits - Application Section group position
#define NVM_LOCKBITS_BLBA0_bm (1<<4) ///< Boot Lock Bits - Application Section bit 0 mask
#define NVM_LOCKBITS_BLBA0_bp 4 ///< Boot Lock Bits - Application Section bit 0 position
#define NVM_LOCKBITS_BLBA1_bm (1<<5) ///< Boot Lock Bits - Application Section bit 1 mask
#define NVM_LOCKBITS_BLBA1_bp 5 ///< Boot Lock Bits - Application Section bit 1 position
#define NVM_LOCKBITS_BLBAT_gm 0x0C ///< Boot Lock Bits - Application Table group mask
#define NVM_LOCKBITS_BLBAT_gp 2 ///< Boot Lock Bits - Application Table group position
#define NVM_LOCKBITS_BLBAT0_bm (1<<2) ///< Boot Lock Bits - Application Table bit 0 mask
#define NVM_LOCKBITS_BLBAT0_bp 2 ///< Boot Lock Bits - Application Table bit 0 position
#define NVM_LOCKBITS_BLBAT1_bm (1<<3) ///< Boot Lock Bits - Application Table bit 1 mask
#define NVM_LOCKBITS_BLBAT1_bp 3 ///< Boot Lock Bits - Application Table bit 1 position
#define NVM_LOCKBITS_LB_gm 0x03 ///< Lock Bits group mask
#define NVM_LOCKBITS_LB_gp 0 ///< Lock Bits group position
#define NVM_LOCKBITS_LB0_bm (1<<0) ///< Lock Bits bit 0 mask
#define NVM_LOCKBITS_LB0_bp 0 ///< Lock Bits bit 0 position
#define NVM_LOCKBITS_LB1_bm (1<<1) ///< Lock Bits bit 1 mask
#define NVM_LOCKBITS_LB1_bp 1 ///< Lock Bits bit 1 position
/** @} */

/** @name NVM_FUSES.FUSEBYTE0
  * @{
  */
#define NVM_FUSES_USERID_gm 0xFF ///< User ID group mask
#define NVM_FUSES_USERID_gp 0 ///< User ID group position
#define NVM_FUSES_USERID0_bm (1<<0) ///< User ID bit 0 mask
#define NVM_FUSES_USERID0_bp 0 ///< User ID bit 0 position
#define NVM_FUSES_USERID1_bm (1<<1) ///< User ID bit 1 mask
#define NVM_FUSES_USERID1_bp 1 ///< User ID bit 1 position
#define NVM_FUSES_USERID2_bm (1<<2) ///< User ID bit 2 mask
#define NVM_FUSES_USERID2_bp 2 ///< User ID bit 2 position
#define NVM_FUSES_USERID3_bm (1<<3) ///< User ID bit 3 mask
#define NVM_FUSES_USERID3_bp 3 ///< User ID bit 3 position
#define NVM_FUSES_USERID4_bm (1<<4) ///< User ID bit 4 mask
#define NVM_FUSES_USERID4_bp 4 ///< User ID bit 4 position
#define NVM_FUSES_USERID5_bm (1<<5) ///< User ID bit 5 mask
#define NVM_FUSES_USERID5_bp 5 ///< User ID bit 5 position
#define NVM_FUSES_USERID6_bm (1<<6) ///< User ID bit 6 mask
#define NVM_FUSES_USERID6_bp 6 ///< User ID bit 6 position
#define NVM_FUSES_USERID7_bm (1<<7) ///< User ID bit 7 mask
#define NVM_FUSES_USERID7_bp 7 ///< User ID bit 7 position
/** @} */

