dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name NVM_FUSES.FUSEBYTE1
  * @see WD_enum
  * @see WD_enum
  * @{
  */
#define NVM_FUSES_WDWP_gm 0xF0 ///< Watchdog Window Timeout Period group mask
#define NVM_FUSES_WDWP_gp 4 ///< Watchdog Window Timeout Period group position
#define NVM_FUSES_WDWP0_bm (1<<4) ///< Watchdog Window Timeout Period bit 0 mask
#define NVM_FUSES_WDWP0_bp 4 ///< Watchdog Window Timeout Period bit 0 position
#define NVM_FUSES_WDWP1_bm (1<<5) ///< Watchdog Window Timeout Period bit 1 mask
#define NVM_FUSES_WDWP1_bp 5 ///< Watchdog Window Timeout Period bit 1 position
#define NVM_FUSES_WDWP2_bm (1<<6) ///< Watchdog Window Timeout Period bit 2 mask
#define NVM_FUSES_WDWP2_bp 6 ///< Watchdog Window Timeout Period bit 2 position
#define NVM_FUSES_WDWP3_bm (1<<7) ///< Watchdog Window Timeout Period bit 3 mask
#define NVM_FUSES_WDWP3_bp 7 ///< Watchdog Window Timeout Period bit 3 position
#define NVM_FUSES_WDP_gm 0x0F ///< Watchdog Timeout Period group mask
#define NVM_FUSES_WDP_gp 0 ///< Watchdog Timeout Period group position
#define NVM_FUSES_WDP0_bm (1<<0) ///< Watchdog Timeout Period bit 0 mask
#define NVM_FUSES_WDP0_bp 0 ///< Watchdog Timeout Period bit 0 position
#define NVM_FUSES_WDP1_bm (1<<1) ///< Watchdog Timeout Period bit 1 mask
#define NVM_FUSES_WDP1_bp 1 ///< Watchdog Timeout Period bit 1 position
#define NVM_FUSES_WDP2_bm (1<<2) ///< Watchdog Timeout Period bit 2 mask
#define NVM_FUSES_WDP2_bp 2 ///< Watchdog Timeout Period bit 2 position
#define NVM_FUSES_WDP3_bm (1<<3) ///< Watchdog Timeout Period bit 3 mask
#define NVM_FUSES_WDP3_bp 3 ///< Watchdog Timeout Period bit 3 position
/** @} */

/** @name NVM_FUSES.FUSEBYTE2
  * @see BOOTRST_enum
  * @see BOD_enum
  * @{
  */
#define NVM_FUSES_DVSDON_bm 0x80 ///< Spike Detector Enable bit mask
#define NVM_FUSES_DVSDON_bp 7 ///< Spike Detector Enable bit position
#define NVM_FUSES_BOOTRST_bm 0x40 ///< Boot Loader Section Reset Vector bit mask
#define NVM_FUSES_BOOTRST_bp 6 ///< Boot Loader Section Reset Vector bit position
#define NVM_FUSES_BODPD_gm 0x03 ///< BOD Operation in Power-Down Mode group mask
#define NVM_FUSES_BODPD_gp 0 ///< BOD Operation in Power-Down Mode group position
#define NVM_FUSES_BODPD0_bm (1<<0) ///< BOD Operation in Power-Down Mode bit 0 mask
#define NVM_FUSES_BODPD0_bp 0 ///< BOD Operation in Power-Down Mode bit 0 position
#define NVM_FUSES_BODPD1_bm (1<<1) ///< BOD Operation in Power-Down Mode bit 1 mask
#define NVM_FUSES_BODPD1_bp 1 ///< BOD Operation in Power-Down Mode bit 1 position
/** @} */

/** @name NVM_FUSES.FUSEBYTE4
  * @see SUT_enum
  * @{
  */
#define NVM_FUSES_RSTDISBL_bm 0x10 ///< External Reset Disable bit mask
#define NVM_FUSES_RSTDISBL_bp 4 ///< External Reset Disable bit position
#define NVM_FUSES_SUT_gm 0x0C ///< Start-up Time group mask
#define NVM_FUSES_SUT_gp 2 ///< Start-up Time group position
#define NVM_FUSES_SUT0_bm (1<<2) ///< Start-up Time bit 0 mask
#define NVM_FUSES_SUT0_bp 2 ///< Start-up Time bit 0 position
#define NVM_FUSES_SUT1_bm (1<<3) ///< Start-up Time bit 1 mask
#define NVM_FUSES_SUT1_bp 3 ///< Start-up Time bit 1 position
#define NVM_FUSES_WDLOCK_bm 0x02 ///< Watchdog Timer Lock bit mask
#define NVM_FUSES_WDLOCK_bp 1 ///< Watchdog Timer Lock bit position
/** @} */

/** @name NVM_FUSES.FUSEBYTE5
  * @see BOD_enum
  * @see BODLVL_enum
  * @{
  */
#define NVM_FUSES_BODACT_gm 0x30 ///< BOD Operation in Active Mode group mask
#define NVM_FUSES_BODACT_gp 4 ///< BOD Operation in Active Mode group position
#define NVM_FUSES_BODACT0_bm (1<<4) ///< BOD Operation in Active Mode bit 0 mask
#define NVM_FUSES_BODACT0_bp 4 ///< BOD Operation in Active Mode bit 0 position
#define NVM_FUSES_BODACT1_bm (1<<5) ///< BOD Operation in Active Mode bit 1 mask
#define NVM_FUSES_BODACT1_bp 5 ///< BOD Operation in Active Mode bit 1 position
#define NVM_FUSES_EESAVE_bm 0x08 ///< Preserve EEPROM Through Chip Erase bit mask
#define NVM_FUSES_EESAVE_bp 3 ///< Preserve EEPROM Through Chip Erase bit position
#define NVM_FUSES_BODLVL_gm 0x07 ///< Brown Out Detection Voltage Level group mask
#define NVM_FUSES_BODLVL_gp 0 ///< Brown Out Detection Voltage Level group position
#define NVM_FUSES_BODLVL0_bm (1<<0) ///< Brown Out Detection Voltage Level bit 0 mask
#define NVM_FUSES_BODLVL0_bp 0 ///< Brown Out Detection Voltage Level bit 0 position
#define NVM_FUSES_BODLVL1_bm (1<<1) ///< Brown Out Detection Voltage Level bit 1 mask
#define NVM_FUSES_BODLVL1_bp 1 ///< Brown Out Detection Voltage Level bit 1 position
#define NVM_FUSES_BODLVL2_bm (1<<2) ///< Brown Out Detection Voltage Level bit 2 mask
#define NVM_FUSES_BODLVL2_bp 2 ///< Brown Out Detection Voltage Level bit 2 position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// NVM Command

typedef enum NVM_CMD_enum {
	NVM_CMD_NO_OPERATION_gc = (0x00<<0),	///< Noop/Ordinary LPM
	NVM_CMD_READ_CALIB_ROW_gc = (0x02<<0),	///< Read calibration row
	NVM_CMD_READ_USER_SIG_ROW_gc = (0x01<<0),	///< Read user signature row
	NVM_CMD_READ_EEPROM_gc = (0x06<<0),	///< Read EEPROM
	NVM_CMD_READ_FUSES_gc = (0x07<<0),	///< Read fuse byte
	NVM_CMD_WRITE_LOCK_BITS_gc = (0x08<<0),	///< Write lock bits
	NVM_CMD_ERASE_USER_SIG_ROW_gc = (0x18<<0),	///< Erase user signature row
	NVM_CMD_WRITE_USER_SIG_ROW_gc = (0x1A<<0),	///< Write user signature row
	NVM_CMD_ERASE_APP_gc = (0x20<<0),	///< Erase Application Section
	NVM_CMD_ERASE_APP_PAGE_gc = (0x22<<0),	///< Erase Application Section page
	NVM_CMD_LOAD_FLASH_BUFFER_gc = (0x23<<0),	///< Load Flash page buffer
	NVM_CMD_WRITE_APP_PAGE_gc = (0x24<<0),	///< Write Application Section page
	NVM_CMD_ERASE_WRITE_APP_PAGE_gc = (0x25<<0),	///< Erase-and-write Application Section page
	NVM_CMD_ERASE_FLASH_BUFFER_gc = (0x26<<0),	///< Erase/flush Flash page buffer
	NVM_CMD_ERASE_BOOT_PAGE_gc = (0x2A<<0),	///< Erase Boot Section page
	NVM_CMD_WRITE_BOOT_PAGE_gc = (0x2C<<0),	///< Write Boot Section page
	NVM_CMD_ERASE_WRITE_BOOT_PAGE_gc = (0x2D<<0),	///< Erase-and-write Boot Section page
	NVM_CMD_ERASE_EEPROM_gc = (0x30<<0),	///< Erase EEPROM
	NVM_CMD_ERASE_EEPROM_PAGE_gc = (0x32<<0),	///< Erase EEPROM page
	NVM_CMD_LOAD_EEPROM_BUFFER_gc = (0x33<<0),	///< Load EEPROM page buffer
	NVM_CMD_WRITE_EEPROM_PAGE_gc = (0x34<<0),	///< Write EEPROM page
	NVM_CMD_ERASE_WRITE_EEPROM_PAGE_gc = (0x35<<0),	///< Erase-and-write EEPROM page
	NVM_CMD_ERASE_EEPROM_BUFFER_gc = (0x36<<0),	///< Erase/flush EEPROM page buffer
	NVM_CMD_APP_CRC_gc = (0x38<<0),	///< Generate Application section CRC
	NVM_CMD_BOOT_CRC_gc = (0x39<<0),	///< Generate Boot Section CRC
	NVM_CMD_FLASH_RANGE_CRC_gc = (0x3A<<0),	///< Generate Flash Range CRC
} NVM_CMD_t;

/// SPM ready interrupt level

typedef enum NVM_SPMLVL_enum {
	NVM_SPMLVL_OFF_gc = (0x00<<2),	///< Interrupt disabled
	NVM_SPMLVL_LO_gc = (0x01<<2),	///< Low level
	NVM_SPMLVL_MED_gc = (0x02<<2),	///< Medium level
	NVM_SPMLVL_HI_gc = (0x03<<2),	///< High level
} NVM_SPMLVL_t;

