dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// EEPROM ready interrupt level

typedef enum NVM_EELVL_enum {
	NVM_EELVL_OFF_gc = (0x00<<0),	///< Interrupt disabled
	NVM_EELVL_LO_gc = (0x01<<0),	///< Low level
	NVM_EELVL_MED_gc = (0x02<<0),	///< Medium level
	NVM_EELVL_HI_gc = (0x03<<0),	///< High level
} NVM_EELVL_t;

/// Boot lock bits - boot setcion

typedef enum NVM_BLBB_enum {
	NVM_BLBB_NOLOCK_gc = (0x03<<6),	///< No locks
	NVM_BLBB_WLOCK_gc = (0x02<<6),	///< Write not allowed
	NVM_BLBB_RLOCK_gc = (0x01<<6),	///< Read not allowed
	NVM_BLBB_RWLOCK_gc = (0x00<<6),	///< Read and write not allowed
} NVM_BLBB_t;

/// Boot lock bits - application section

typedef enum NVM_BLBA_enum {
	NVM_BLBA_NOLOCK_gc = (0x03<<4),	///< No locks
	NVM_BLBA_WLOCK_gc = (0x02<<4),	///< Write not allowed
	NVM_BLBA_RLOCK_gc = (0x01<<4),	///< Read not allowed
	NVM_BLBA_RWLOCK_gc = (0x00<<4),	///< Read and write not allowed
} NVM_BLBA_t;

/// Boot lock bits - application table section

typedef enum NVM_BLBAT_enum {
	NVM_BLBAT_NOLOCK_gc = (0x03<<2),	///< No locks
	NVM_BLBAT_WLOCK_gc = (0x02<<2),	///< Write not allowed
	NVM_BLBAT_RLOCK_gc = (0x01<<2),	///< Read not allowed
	NVM_BLBAT_RWLOCK_gc = (0x00<<2),	///< Read and write not allowed
} NVM_BLBAT_t;

/// Lock bits

typedef enum NVM_LB_enum {
	NVM_LB_NOLOCK_gc = (0x03<<0),	///< No locks
	NVM_LB_WLOCK_gc = (0x02<<0),	///< Write not allowed
	NVM_LB_RWLOCK_gc = (0x00<<0),	///< Read and write not allowed
} NVM_LB_t;

/// Boot Loader Section Reset Vector

typedef enum BOOTRST_enum {
	BOOTRST_BOOTLDR_gc = (0x00<<6),	///< Boot Loader Reset
	BOOTRST_APPLICATION_gc = (0x01<<6),	///< Application Reset
} BOOTRST_t;

/// BOD operation

typedef enum BOD_enum {
	BOD_INSAMPLEDMODE_gc = (0x01<<0),	///< BOD enabled in sampled mode
	BOD_CONTINOUSLY_gc = (0x02<<0),	///< BOD enabled continuously
	BOD_DISABLED_gc = (0x03<<0),	///< BOD Disabled
} BOD_t;

/// Watchdog (Window) Timeout Period

typedef enum WD_enum {
	WD_8CLK_gc = (0x00<<4),	///< 8 cycles (8ms @ 3.3V)
	WD_16CLK_gc = (0x01<<4),	///< 16 cycles (16ms @ 3.3V)
	WD_32CLK_gc = (0x02<<4),	///< 32 cycles (32ms @ 3.3V)
	WD_64CLK_gc = (0x03<<4),	///< 64 cycles (64ms @ 3.3V)
	WD_128CLK_gc = (0x04<<4),	///< 128 cycles (0.125s @ 3.3V)
	WD_256CLK_gc = (0x05<<4),	///< 256 cycles (0.25s @ 3.3V)
	WD_512CLK_gc = (0x06<<4),	///< 512 cycles (0.5s @ 3.3V)
	WD_1KCLK_gc = (0x07<<4),	///< 1K cycles (1s @ 3.3V)
	WD_2KCLK_gc = (0x08<<4),	///< 2K cycles (2s @ 3.3V)
	WD_4KCLK_gc = (0x09<<4),	///< 4K cycles (4s @ 3.3V)
	WD_8KCLK_gc = (0x0A<<4),	///< 8K cycles (8s @ 3.3V)
} WD_t;

/// Start-up Time

typedef enum SUT_enum {
	SUT_0MS_gc = (0x03<<2),	///< 0 ms
	SUT_4MS_gc = (0x01<<2),	///< 4 ms
	SUT_64MS_gc = (0x00<<2),	///< 64 ms
} SUT_t;

/// Brown Out Detection Voltage Level

typedef enum BODLVL_enum {
	BODLVL_1V6_gc = (0x07<<0),	///< 1.6 V
	BODLVL_1V9_gc = (0x06<<0),	///< 1.9 V
	BODLVL_2V1_gc = (0x05<<0),	///< 2.1 V
	BODLVL_2V4_gc = (0x04<<0),	///< 2.4 V
	BODLVL_2V6_gc = (0x03<<0),	///< 2.6 V
	BODLVL_2V9_gc = (0x02<<0),	///< 2.9 V
	BODLVL_3V2_gc = (0x01<<0),	///< 3.2 V
} BODLVL_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// NVM Command
#define NVM_CMD_NO_OPERATION_gc (0x00<<0)	///< Noop/Ordinary LPM
#define NVM_CMD_READ_CALIB_ROW_gc (0x02<<0)	///< Read calibration row
#define NVM_CMD_READ_USER_SIG_ROW_gc (0x01<<0)	///< Read user signature row
#define NVM_CMD_READ_EEPROM_gc (0x06<<0)	///< Read EEPROM
#define NVM_CMD_READ_FUSES_gc (0x07<<0)	///< Read fuse byte
#define NVM_CMD_WRITE_LOCK_BITS_gc (0x08<<0)	///< Write lock bits
#define NVM_CMD_ERASE_USER_SIG_ROW_gc (0x18<<0)	///< Erase user signature row
#define NVM_CMD_WRITE_USER_SIG_ROW_gc (0x1A<<0)	///< Write user signature row
#define NVM_CMD_ERASE_APP_gc (0x20<<0)	///< Erase Application Section
#define NVM_CMD_ERASE_APP_PAGE_gc (0x22<<0)	///< Erase Application Section page
#define NVM_CMD_LOAD_FLASH_BUFFER_gc (0x23<<0)	///< Load Flash page buffer
#define NVM_CMD_WRITE_APP_PAGE_gc (0x24<<0)	///< Write Application Section page
#define NVM_CMD_ERASE_WRITE_APP_PAGE_gc (0x25<<0)	///< Erase-and-write Application Section page
#define NVM_CMD_ERASE_FLASH_BUFFER_gc (0x26<<0)	///< Erase/flush Flash page buffer
#define NVM_CMD_ERASE_BOOT_PAGE_gc (0x2A<<0)	///< Erase Boot Section page
#define NVM_CMD_WRITE_BOOT_PAGE_gc (0x2C<<0)	///< Write Boot Section page
#define NVM_CMD_ERASE_WRITE_BOOT_PAGE_gc (0x2D<<0)	///< Erase-and-write Boot Section page
#define NVM_CMD_ERASE_EEPROM_gc (0x30<<0)	///< Erase EEPROM
#define NVM_CMD_ERASE_EEPROM_PAGE_gc (0x32<<0)	///< Erase EEPROM page
#define NVM_CMD_LOAD_EEPROM_BUFFER_gc (0x33<<0)	///< Load EEPROM page buffer
#define NVM_CMD_WRITE_EEPROM_PAGE_gc (0x34<<0)	///< Write EEPROM page
#define NVM_CMD_ERASE_WRITE_EEPROM_PAGE_gc (0x35<<0)	///< Erase-and-write EEPROM page
#define NVM_CMD_ERASE_EEPROM_BUFFER_gc (0x36<<0)	///< Erase/flush EEPROM page buffer
#define NVM_CMD_APP_CRC_gc (0x38<<0)	///< Generate Application section CRC
#define NVM_CMD_BOOT_CRC_gc (0x39<<0)	///< Generate Boot Section CRC
#define NVM_CMD_FLASH_RANGE_CRC_gc (0x3A<<0)	///< Generate Flash Range CRC

/// SPM ready interrupt level
#define NVM_SPMLVL_OFF_gc (0x00<<2)	///< Interrupt disabled
#define NVM_SPMLVL_LO_gc (0x01<<2)	///< Low level
#define NVM_SPMLVL_MED_gc (0x02<<2)	///< Medium level
#define NVM_SPMLVL_HI_gc (0x03<<2)	///< High level

/// EEPROM ready interrupt level
#define NVM_EELVL_OFF_gc (0x00<<0)	///< Interrupt disabled
#define NVM_EELVL_LO_gc (0x01<<0)	///< Low level
#define NVM_EELVL_MED_gc (0x02<<0)	///< Medium level
#define NVM_EELVL_HI_gc (0x03<<0)	///< High level

/// Boot lock bits - boot setcion
#define NVM_BLBB_NOLOCK_gc (0x03<<6)	///< No locks
#define NVM_BLBB_WLOCK_gc (0x02<<6)	///< Write not allowed
#define NVM_BLBB_RLOCK_gc (0x01<<6)	///< Read not allowed
#define NVM_BLBB_RWLOCK_gc (0x00<<6)	///< Read and write not allowed

/// Boot lock bits - application section
#define NVM_BLBA_NOLOCK_gc (0x03<<4)	///< No locks
#define NVM_BLBA_WLOCK_gc (0x02<<4)	///< Write not allowed
#define NVM_BLBA_RLOCK_gc (0x01<<4)	///< Read not allowed
#define NVM_BLBA_RWLOCK_gc (0x00<<4)	///< Read and write not allowed

/// Boot lock bits - application table section
#define NVM_BLBAT_NOLOCK_gc (0x03<<2)	///< No locks
#define NVM_BLBAT_WLOCK_gc (0x02<<2)	///< Write not allowed
#define NVM_BLBAT_RLOCK_gc (0x01<<2)	///< Read not allowed
#define NVM_BLBAT_RWLOCK_gc (0x00<<2)	///< Read and write not allowed

