dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Lock bits
#define NVM_LB_NOLOCK_gc (0x03<<0)	///< No locks
#define NVM_LB_WLOCK_gc (0x02<<0)	///< Write not allowed
#define NVM_LB_RWLOCK_gc (0x00<<0)	///< Read and write not allowed

/// Boot Loader Section Reset Vector
#define BOOTRST_BOOTLDR_gc (0x00<<6)	///< Boot Loader Reset
#define BOOTRST_APPLICATION_gc (0x01<<6)	///< Application Reset

/// BOD operation
#define BOD_INSAMPLEDMODE_gc (0x01<<0)	///< BOD enabled in sampled mode
#define BOD_CONTINOUSLY_gc (0x02<<0)	///< BOD enabled continuously
#define BOD_DISABLED_gc (0x03<<0)	///< BOD Disabled

/// Watchdog (Window) Timeout Period
#define WD_8CLK_gc (0x00<<4)	///< 8 cycles (8ms @ 3.3V)
#define WD_16CLK_gc (0x01<<4)	///< 16 cycles (16ms @ 3.3V)
#define WD_32CLK_gc (0x02<<4)	///< 32 cycles (32ms @ 3.3V)
#define WD_64CLK_gc (0x03<<4)	///< 64 cycles (64ms @ 3.3V)
#define WD_128CLK_gc (0x04<<4)	///< 128 cycles (0.125s @ 3.3V)
#define WD_256CLK_gc (0x05<<4)	///< 256 cycles (0.25s @ 3.3V)
#define WD_512CLK_gc (0x06<<4)	///< 512 cycles (0.5s @ 3.3V)
#define WD_1KCLK_gc (0x07<<4)	///< 1K cycles (1s @ 3.3V)
#define WD_2KCLK_gc (0x08<<4)	///< 2K cycles (2s @ 3.3V)
#define WD_4KCLK_gc (0x09<<4)	///< 4K cycles (4s @ 3.3V)
#define WD_8KCLK_gc (0x0A<<4)	///< 8K cycles (8s @ 3.3V)

/// Start-up Time
#define SUT_0MS_gc (0x03<<2)	///< 0 ms
#define SUT_4MS_gc (0x01<<2)	///< 4 ms
#define SUT_64MS_gc (0x00<<2)	///< 64 ms

/// Brown Out Detection Voltage Level
#define BODLVL_1V6_gc (0x07<<0)	///< 1.6 V
#define BODLVL_1V9_gc (0x06<<0)	///< 1.9 V
#define BODLVL_2V1_gc (0x05<<0)	///< 2.1 V
#define BODLVL_2V4_gc (0x04<<0)	///< 2.4 V
#define BODLVL_2V6_gc (0x03<<0)	///< 2.6 V
#define BODLVL_2V9_gc (0x02<<0)	///< 2.9 V
#define BODLVL_3V2_gc (0x01<<0)	///< 3.2 V

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup ac Analog Comparator
 *  @{
 */

/** @name AC.AC0CTRL
  * @see AC_INTMODE_enum
  * @see AC_INTLVL_enum
  * @see AC_HYSMODE_enum
  * @{
  */
#define AC_INTMODE_gm 0xC0 ///< Interrupt Mode group mask
#define AC_INTMODE_gp 6 ///< Interrupt Mode group position
#define AC_INTMODE0_bm (1<<6) ///< Interrupt Mode bit 0 mask
#define AC_INTMODE0_bp 6 ///< Interrupt Mode bit 0 position
#define AC_INTMODE1_bm (1<<7) ///< Interrupt Mode bit 1 mask
#define AC_INTMODE1_bp 7 ///< Interrupt Mode bit 1 position
#define AC_INTLVL_gm 0x30 ///< Interrupt Level group mask
#define AC_INTLVL_gp 4 ///< Interrupt Level group position
#define AC_INTLVL0_bm (1<<4) ///< Interrupt Level bit 0 mask
#define AC_INTLVL0_bp 4 ///< Interrupt Level bit 0 position
#define AC_INTLVL1_bm (1<<5) ///< Interrupt Level bit 1 mask
#define AC_INTLVL1_bp 5 ///< Interrupt Level bit 1 position
#define AC_HSMODE_bm 0x08 ///< High-speed Mode bit mask
#define AC_HSMODE_bp 3 ///< High-speed Mode bit position
#define AC_HYSMODE_gm 0x06 ///< Hysteresis Mode group mask
#define AC_HYSMODE_gp 1 ///< Hysteresis Mode group position
#define AC_HYSMODE0_bm (1<<1) ///< Hysteresis Mode bit 0 mask
#define AC_HYSMODE0_bp 1 ///< Hysteresis Mode bit 0 position
#define AC_HYSMODE1_bm (1<<2) ///< Hysteresis Mode bit 1 mask
#define AC_HYSMODE1_bp 2 ///< Hysteresis Mode bit 1 position
#define AC_ENABLE_bm 0x01 ///< Enable bit mask
#define AC_ENABLE_bp 0 ///< Enable bit position
/** @} */

/** @name AC.AC1CTRL
  * @see AC_INTMODE_enum
  * @see AC_INTLVL_enum
  * @see AC_HYSMODE_enum
  * @{
  */
// Masks for INTMODE aready defined
// Masks for INTLVL aready defined
// Masks for HSMODE aready defined
// Masks for HYSMODE aready defined
// Masks for ENABLE aready defined
/** @} */

/** @name AC.AC0MUXCTRL
  * @see AC_MUXPOS_enum
  * @see AC_MUXNEG_enum
  * @{
  */
#define AC_MUXPOS_gm 0x38 ///< MUX Positive Input group mask
#define AC_MUXPOS_gp 3 ///< MUX Positive Input group position
#define AC_MUXPOS0_bm (1<<3) ///< MUX Positive Input bit 0 mask
#define AC_MUXPOS0_bp 3 ///< MUX Positive Input bit 0 position
#define AC_MUXPOS1_bm (1<<4) ///< MUX Positive Input bit 1 mask
#define AC_MUXPOS1_bp 4 ///< MUX Positive Input bit 1 position
#define AC_MUXPOS2_bm (1<<5) ///< MUX Positive Input bit 2 mask
#define AC_MUXPOS2_bp 5 ///< MUX Positive Input bit 2 position
#define AC_MUXNEG_gm 0x07 ///< MUX Negative Input group mask
#define AC_MUXNEG_gp 0 ///< MUX Negative Input group position
#define AC_MUXNEG0_bm (1<<0) ///< MUX Negative Input bit 0 mask
#define AC_MUXNEG0_bp 0 ///< MUX Negative Input bit 0 position
#define AC_MUXNEG1_bm (1<<1) ///< MUX Negative Input bit 1 mask
#define AC_MUXNEG1_bp 1 ///< MUX Negative Input bit 1 position
#define AC_MUXNEG2_bm (1<<2) ///< MUX Negative Input bit 2 mask
#define AC_MUXNEG2_bp 2 ///< MUX Negative Input bit 2 position
/** @} */

/** @name AC.AC1MUXCTRL
  * @see AC_MUXPOS_enum
  * @see AC_MUXNEG_enum
  * @{
  */
// Masks for MUXPOS aready defined
// Masks for MUXNEG aready defined
/** @} */

/** @name AC.CTRLA
  * @{
  */
#define AC_AC0OUT_bm 0x01 ///< Comparator 0 Output Enable bit mask
#define AC_AC0OUT_bp 0 ///< Comparator 0 Output Enable bit position
/** @} */

/** @name AC.CTRLB
  * @{
  */
#define AC_SCALEFAC_gm 0x3F ///< VCC Voltage Scaler Factor group mask
#define AC_SCALEFAC_gp 0 ///< VCC Voltage Scaler Factor group position
#define AC_SCALEFAC0_bm (1<<0) ///< VCC Voltage Scaler Factor bit 0 mask
#define AC_SCALEFAC0_bp 0 ///< VCC Voltage Scaler Factor bit 0 position
#define AC_SCALEFAC1_bm (1<<1) ///< VCC Voltage Scaler Factor bit 1 mask
#define AC_SCALEFAC1_bp 1 ///< VCC Voltage Scaler Factor bit 1 position
#define AC_SCALEFAC2_bm (1<<2) ///< VCC Voltage Scaler Factor bit 2 mask
#define AC_SCALEFAC2_bp 2 ///< VCC Voltage Scaler Factor bit 2 position
#define AC_SCALEFAC3_bm (1<<3) ///< VCC Voltage Scaler Factor bit 3 mask
#define AC_SCALEFAC3_bp 3 ///< VCC Voltage Scaler Factor bit 3 position
#define AC_SCALEFAC4_bm (1<<4) ///< VCC Voltage Scaler Factor bit 4 mask
#define AC_SCALEFAC4_bp 4 ///< VCC Voltage Scaler Factor bit 4 position
#define AC_SCALEFAC5_bm (1<<5) ///< VCC Voltage Scaler Factor bit 5 mask
#define AC_SCALEFAC5_bp 5 ///< VCC Voltage Scaler Factor bit 5 position
/** @} */

/** @name AC.WINCTRL
  * @see AC_WINTMODE_enum
  * @see AC_WINTLVL_enum
  * @{
  */
#define AC_WEN_bm 0x10 ///< Window Mode Enable bit mask
#define AC_WEN_bp 4 ///< Window Mode Enable bit position
#define AC_WINTMODE_gm 0x0C ///< Window Interrupt Mode group mask
#define AC_WINTMODE_gp 2 ///< Window Interrupt Mode group position
#define AC_WINTMODE0_bm (1<<2) ///< Window Interrupt Mode bit 0 mask
#define AC_WINTMODE0_bp 2 ///< Window Interrupt Mode bit 0 position
#define AC_WINTMODE1_bm (1<<3) ///< Window Interrupt Mode bit 1 mask
#define AC_WINTMODE1_bp 3 ///< Window Interrupt Mode bit 1 position
#define AC_WINTLVL_gm 0x03 ///< Window Interrupt Level group mask
#define AC_WINTLVL_gp 0 ///< Window Interrupt Level group position
#define AC_WINTLVL0_bm (1<<0) ///< Window Interrupt Level bit 0 mask
#define AC_WINTLVL0_bp 0 ///< Window Interrupt Level bit 0 position
#define AC_WINTLVL1_bm (1<<1) ///< Window Interrupt Level bit 1 mask
#define AC_WINTLVL1_bp 1 ///< Window Interrupt Level bit 1 position
/** @} */

/** @name AC.STATUS
  * @see AC_WSTATE_enum
  * @{
  */
#define AC_WSTATE_gm 0xC0 ///< Window Mode State group mask
#define AC_WSTATE_gp 6 ///< Window Mode State group position
#define AC_WSTATE0_bm (1<<6) ///< Window Mode State bit 0 mask
#define AC_WSTATE0_bp 6 ///< Window Mode State bit 0 position
#define AC_WSTATE1_bm (1<<7) ///< Window Mode State bit 1 mask
#define AC_WSTATE1_bp 7 ///< Window Mode State bit 1 position
#define AC_AC1STATE_bm 0x20 ///< Comparator 1 State bit mask
#define AC_AC1STATE_bp 5 ///< Comparator 1 State bit position
#define AC_AC0STATE_bm 0x10 ///< Comparator 0 State bit mask
#define AC_AC0STATE_bp 4 ///< Comparator 0 State bit position
#define AC_WIF_bm 0x04 ///< Window Mode Interrupt Flag bit mask
#define AC_WIF_bp 2 ///< Window Mode Interrupt Flag bit position
#define AC_AC1IF_bm 0x02 ///< Comparator 1 Interrupt Flag bit mask
#define AC_AC1IF_bp 1 ///< Comparator 1 Interrupt Flag bit position
#define AC_AC0IF_bm 0x01 ///< Comparator 0 Interrupt Flag bit mask
#define AC_AC0IF_bp 0 ///< Comparator 0 Interrupt Flag bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

