dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Interrupt mode

typedef enum AC_INTMODE_enum {
	AC_INTMODE_BOTHEDGES_gc = (0x00<<6),	///< Interrupt on both edges
	AC_INTMODE_FALLING_gc = (0x02<<6),	///< Interrupt on falling edge
	AC_INTMODE_RISING_gc = (0x03<<6),	///< Interrupt on rising edge
} AC_INTMODE_t;

/// Interrupt level

typedef enum AC_INTLVL_enum {
	AC_INTLVL_OFF_gc = (0x00<<4),	///< Interrupt disabled
	AC_INTLVL_LO_gc = (0x01<<4),	///< Low level
	AC_INTLVL_MED_gc = (0x02<<4),	///< Medium level
	AC_INTLVL_HI_gc = (0x03<<4),	///< High level
} AC_INTLVL_t;

/// Hysteresis mode selection

typedef enum AC_HYSMODE_enum {
	AC_HYSMODE_NO_gc = (0x00<<1),	///< No hysteresis
	AC_HYSMODE_SMALL_gc = (0x01<<1),	///< Small hysteresis
	AC_HYSMODE_LARGE_gc = (0x02<<1),	///< Large hysteresis
} AC_HYSMODE_t;

/// Positive input multiplexer selection

typedef enum AC_MUXPOS_enum {
	AC_MUXPOS_PIN0_gc = (0x00<<3),	///< Pin 0
	AC_MUXPOS_PIN1_gc = (0x01<<3),	///< Pin 1
	AC_MUXPOS_PIN2_gc = (0x02<<3),	///< Pin 2
	AC_MUXPOS_PIN3_gc = (0x03<<3),	///< Pin 3
	AC_MUXPOS_PIN4_gc = (0x04<<3),	///< Pin 4
	AC_MUXPOS_PIN5_gc = (0x05<<3),	///< Pin 5
	AC_MUXPOS_PIN6_gc = (0x06<<3),	///< Pin 6
	AC_MUXPOS_DAC_gc = (0x07<<3),	///< DAC output
} AC_MUXPOS_t;

/// Negative input multiplexer selection

typedef enum AC_MUXNEG_enum {
	AC_MUXNEG_PIN0_gc = (0x00<<0),	///< Pin 0
	AC_MUXNEG_PIN1_gc = (0x01<<0),	///< Pin 1
	AC_MUXNEG_PIN3_gc = (0x02<<0),	///< Pin 3
	AC_MUXNEG_PIN5_gc = (0x03<<0),	///< Pin 5
	AC_MUXNEG_PIN7_gc = (0x04<<0),	///< Pin 7
	AC_MUXNEG_DAC_gc = (0x05<<0),	///< DAC output
	AC_MUXNEG_BANDGAP_gc = (0x06<<0),	///< Bandgap Reference
	AC_MUXNEG_SCALER_gc = (0x07<<0),	///< Internal voltage scaler
} AC_MUXNEG_t;

/// Windows interrupt mode

typedef enum AC_WINTMODE_enum {
	AC_WINTMODE_ABOVE_gc = (0x00<<2),	///< Interrupt on above window
	AC_WINTMODE_INSIDE_gc = (0x01<<2),	///< Interrupt on inside window
	AC_WINTMODE_BELOW_gc = (0x02<<2),	///< Interrupt on below window
	AC_WINTMODE_OUTSIDE_gc = (0x03<<2),	///< Interrupt on outside window
} AC_WINTMODE_t;

/// Window interrupt level

typedef enum AC_WINTLVL_enum {
	AC_WINTLVL_OFF_gc = (0x00<<0),	///< Interrupt disabled
	AC_WINTLVL_LO_gc = (0x01<<0),	///< Low priority
	AC_WINTLVL_MED_gc = (0x02<<0),	///< Medium priority
	AC_WINTLVL_HI_gc = (0x03<<0),	///< High priority
} AC_WINTLVL_t;

/// Window mode state

typedef enum AC_WSTATE_enum {
	AC_WSTATE_ABOVE_gc = (0x00<<6),	///< Signal above window
	AC_WSTATE_INSIDE_gc = (0x01<<6),	///< Signal inside window
	AC_WSTATE_BELOW_gc = (0x02<<6),	///< Signal below window
} AC_WSTATE_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Interrupt mode
#define AC_INTMODE_BOTHEDGES_gc (0x00<<6)	///< Interrupt on both edges
#define AC_INTMODE_FALLING_gc (0x02<<6)	///< Interrupt on falling edge
#define AC_INTMODE_RISING_gc (0x03<<6)	///< Interrupt on rising edge

/// Interrupt level
#define AC_INTLVL_OFF_gc (0x00<<4)	///< Interrupt disabled
#define AC_INTLVL_LO_gc (0x01<<4)	///< Low level
#define AC_INTLVL_MED_gc (0x02<<4)	///< Medium level
#define AC_INTLVL_HI_gc (0x03<<4)	///< High level

/// Hysteresis mode selection
#define AC_HYSMODE_NO_gc (0x00<<1)	///< No hysteresis
#define AC_HYSMODE_SMALL_gc (0x01<<1)	///< Small hysteresis
#define AC_HYSMODE_LARGE_gc (0x02<<1)	///< Large hysteresis

/// Positive input multiplexer selection
#define AC_MUXPOS_PIN0_gc (0x00<<3)	///< Pin 0
#define AC_MUXPOS_PIN1_gc (0x01<<3)	///< Pin 1
#define AC_MUXPOS_PIN2_gc (0x02<<3)	///< Pin 2
#define AC_MUXPOS_PIN3_gc (0x03<<3)	///< Pin 3
#define AC_MUXPOS_PIN4_gc (0x04<<3)	///< Pin 4
#define AC_MUXPOS_PIN5_gc (0x05<<3)	///< Pin 5
#define AC_MUXPOS_PIN6_gc (0x06<<3)	///< Pin 6
#define AC_MUXPOS_DAC_gc (0x07<<3)	///< DAC output

/// Negative input multiplexer selection
#define AC_MUXNEG_PIN0_gc (0x00<<0)	///< Pin 0
#define AC_MUXNEG_PIN1_gc (0x01<<0)	///< Pin 1
#define AC_MUXNEG_PIN3_gc (0x02<<0)	///< Pin 3
#define AC_MUXNEG_PIN5_gc (0x03<<0)	///< Pin 5
#define AC_MUXNEG_PIN7_gc (0x04<<0)	///< Pin 7
#define AC_MUXNEG_DAC_gc (0x05<<0)	///< DAC output
#define AC_MUXNEG_BANDGAP_gc (0x06<<0)	///< Bandgap Reference
#define AC_MUXNEG_SCALER_gc (0x07<<0)	///< Internal voltage scaler

/// Windows interrupt mode
#define AC_WINTMODE_ABOVE_gc (0x00<<2)	///< Interrupt on above window
#define AC_WINTMODE_INSIDE_gc (0x01<<2)	///< Interrupt on inside window
#define AC_WINTMODE_BELOW_gc (0x02<<2)	///< Interrupt on below window
#define AC_WINTMODE_OUTSIDE_gc (0x03<<2)	///< Interrupt on outside window

/// Window interrupt level
#define AC_WINTLVL_OFF_gc (0x00<<0)	///< Interrupt disabled
#define AC_WINTLVL_LO_gc (0x01<<0)	///< Low priority
#define AC_WINTLVL_MED_gc (0x02<<0)	///< Medium priority
#define AC_WINTLVL_HI_gc (0x03<<0)	///< High priority

/// Window mode state
#define AC_WSTATE_ABOVE_gc (0x00<<6)	///< Signal above window
#define AC_WSTATE_INSIDE_gc (0x01<<6)	///< Signal inside window
#define AC_WSTATE_BELOW_gc (0x02<<6)	///< Signal below window

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup adc Analog/Digital Converter
 *  @{
 */

/** @name ADC_CH.CTRL
  * @see ADC_CH_GAIN_enum
  * @see ADC_CH_INPUTMODE_enum
  * @{
  */
#define ADC_CH_START_bm 0x80 ///< Channel Start Conversion bit mask
#define ADC_CH_START_bp 7 ///< Channel Start Conversion bit position
#define ADC_CH_GAINFAC_gm 0x1C ///< Gain Factor group mask
#define ADC_CH_GAINFAC_gp 2 ///< Gain Factor group position
#define ADC_CH_GAINFAC0_bm (1<<2) ///< Gain Factor bit 0 mask
#define ADC_CH_GAINFAC0_bp 2 ///< Gain Factor bit 0 position
#define ADC_CH_GAINFAC1_bm (1<<3) ///< Gain Factor bit 1 mask
#define ADC_CH_GAINFAC1_bp 3 ///< Gain Factor bit 1 position
#define ADC_CH_GAINFAC2_bm (1<<4) ///< Gain Factor bit 2 mask
#define ADC_CH_GAINFAC2_bp 4 ///< Gain Factor bit 2 position
#define ADC_CH_INPUTMODE_gm 0x03 ///< Input Mode Select group mask
#define ADC_CH_INPUTMODE_gp 0 ///< Input Mode Select group position
#define ADC_CH_INPUTMODE0_bm (1<<0) ///< Input Mode Select bit 0 mask
#define ADC_CH_INPUTMODE0_bp 0 ///< Input Mode Select bit 0 position
#define ADC_CH_INPUTMODE1_bm (1<<1) ///< Input Mode Select bit 1 mask
#define ADC_CH_INPUTMODE1_bp 1 ///< Input Mode Select bit 1 position
/** @} */

