dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name ADC_CH.MUXCTRL
  * @see ADC_CH_MUXPOS_enum
  * @see ADC_CH_MUXNEG_enum
  * @{
  */
#define ADC_CH_MUXPOS_gm 0x78 ///< Positive Input Select group mask
#define ADC_CH_MUXPOS_gp 3 ///< Positive Input Select group position
#define ADC_CH_MUXPOS0_bm (1<<3) ///< Positive Input Select bit 0 mask
#define ADC_CH_MUXPOS0_bp 3 ///< Positive Input Select bit 0 position
#define ADC_CH_MUXPOS1_bm (1<<4) ///< Positive Input Select bit 1 mask
#define ADC_CH_MUXPOS1_bp 4 ///< Positive Input Select bit 1 position
#define ADC_CH_MUXPOS2_bm (1<<5) ///< Positive Input Select bit 2 mask
#define ADC_CH_MUXPOS2_bp 5 ///< Positive Input Select bit 2 position
#define ADC_CH_MUXPOS3_bm (1<<6) ///< Positive Input Select bit 3 mask
#define ADC_CH_MUXPOS3_bp 6 ///< Positive Input Select bit 3 position
#define ADC_CH_MUXNEG_gm 0x03 ///< Negative Input Select group mask
#define ADC_CH_MUXNEG_gp 0 ///< Negative Input Select group position
#define ADC_CH_MUXNEG0_bm (1<<0) ///< Negative Input Select bit 0 mask
#define ADC_CH_MUXNEG0_bp 0 ///< Negative Input Select bit 0 position
#define ADC_CH_MUXNEG1_bm (1<<1) ///< Negative Input Select bit 1 mask
#define ADC_CH_MUXNEG1_bp 1 ///< Negative Input Select bit 1 position
/** @} */

/** @name ADC_CH.INTCTRL
  * @see ADC_CH_INTMODE_enum
  * @see ADC_CH_INTLVL_enum
  * @{
  */
#define ADC_CH_INTMODE_gm 0x0C ///< Interrupt Mode group mask
#define ADC_CH_INTMODE_gp 2 ///< Interrupt Mode group position
#define ADC_CH_INTMODE0_bm (1<<2) ///< Interrupt Mode bit 0 mask
#define ADC_CH_INTMODE0_bp 2 ///< Interrupt Mode bit 0 position
#define ADC_CH_INTMODE1_bm (1<<3) ///< Interrupt Mode bit 1 mask
#define ADC_CH_INTMODE1_bp 3 ///< Interrupt Mode bit 1 position
#define ADC_CH_INTLVL_gm 0x03 ///< Interrupt Level group mask
#define ADC_CH_INTLVL_gp 0 ///< Interrupt Level group position
#define ADC_CH_INTLVL0_bm (1<<0) ///< Interrupt Level bit 0 mask
#define ADC_CH_INTLVL0_bp 0 ///< Interrupt Level bit 0 position
#define ADC_CH_INTLVL1_bm (1<<1) ///< Interrupt Level bit 1 mask
#define ADC_CH_INTLVL1_bp 1 ///< Interrupt Level bit 1 position
/** @} */

/** @name ADC_CH.INTFLAGS
  * @{
  */
#define ADC_CH_CHIF_bm 0x01 ///< Channel Interrupt Flag bit mask
#define ADC_CH_CHIF_bp 0 ///< Channel Interrupt Flag bit position
/** @} */

/** @name ADC.CTRLA
  * @{
  */
#define ADC_CH0START_bm 0x04 ///< Channel 0 Start Conversion bit mask
#define ADC_CH0START_bp 2 ///< Channel 0 Start Conversion bit position
#define ADC_FLUSH_bm 0x02 ///< ADC Flush bit mask
#define ADC_FLUSH_bp 1 ///< ADC Flush bit position
#define ADC_ENABLE_bm 0x01 ///< Enable ADC bit mask
#define ADC_ENABLE_bp 0 ///< Enable ADC bit position
/** @} */

/** @name ADC.CTRLB
  * @see ADC_RESOLUTION_enum
  * @{
  */
#define ADC_CONMODE_bm 0x10 ///< Conversion Mode bit mask
#define ADC_CONMODE_bp 4 ///< Conversion Mode bit position
#define ADC_FREERUN_bm 0x08 ///< Free Running Mode Enable bit mask
#define ADC_FREERUN_bp 3 ///< Free Running Mode Enable bit position
#define ADC_RESOLUTION_gm 0x06 ///< Result Resolution group mask
#define ADC_RESOLUTION_gp 1 ///< Result Resolution group position
#define ADC_RESOLUTION0_bm (1<<1) ///< Result Resolution bit 0 mask
#define ADC_RESOLUTION0_bp 1 ///< Result Resolution bit 0 position
#define ADC_RESOLUTION1_bm (1<<2) ///< Result Resolution bit 1 mask
#define ADC_RESOLUTION1_bp 2 ///< Result Resolution bit 1 position
/** @} */

/** @name ADC.REFCTRL
  * @see ADC_REFSEL_enum
  * @{
  */
#define ADC_REFSEL_gm 0x70 ///< Reference Selection group mask
#define ADC_REFSEL_gp 4 ///< Reference Selection group position
#define ADC_REFSEL0_bm (1<<4) ///< Reference Selection bit 0 mask
#define ADC_REFSEL0_bp 4 ///< Reference Selection bit 0 position
#define ADC_REFSEL1_bm (1<<5) ///< Reference Selection bit 1 mask
#define ADC_REFSEL1_bp 5 ///< Reference Selection bit 1 position
#define ADC_REFSEL2_bm (1<<6) ///< Reference Selection bit 2 mask
#define ADC_REFSEL2_bp 6 ///< Reference Selection bit 2 position
#define ADC_BANDGAP_bm 0x02 ///< Bandgap enable bit mask
#define ADC_BANDGAP_bp 1 ///< Bandgap enable bit position
#define ADC_TEMPREF_bm 0x01 ///< Temperature Reference Enable bit mask
#define ADC_TEMPREF_bp 0 ///< Temperature Reference Enable bit position
/** @} */

/** @name ADC.EVCTRL
  * @see ADC_EVSEL_enum
  * @see ADC_EVACT_enum
  * @{
  */
#define ADC_EVSEL_gm 0x38 ///< Event Input Select group mask
#define ADC_EVSEL_gp 3 ///< Event Input Select group position
#define ADC_EVSEL0_bm (1<<3) ///< Event Input Select bit 0 mask
#define ADC_EVSEL0_bp 3 ///< Event Input Select bit 0 position
#define ADC_EVSEL1_bm (1<<4) ///< Event Input Select bit 1 mask
#define ADC_EVSEL1_bp 4 ///< Event Input Select bit 1 position
#define ADC_EVSEL2_bm (1<<5) ///< Event Input Select bit 2 mask
#define ADC_EVSEL2_bp 5 ///< Event Input Select bit 2 position
#define ADC_EVACT_bm 0x01 ///< Event Action Select bit mask
#define ADC_EVACT_bp 0 ///< Event Action Select bit position
/** @} */

/** @name ADC.PRESCALER
  * @see ADC_PRESCALER_enum
  * @{
  */
#define ADC_PRESCALER_gm 0x07 ///< Clock Prescaler Selection group mask
#define ADC_PRESCALER_gp 0 ///< Clock Prescaler Selection group position
#define ADC_PRESCALER0_bm (1<<0) ///< Clock Prescaler Selection bit 0 mask
#define ADC_PRESCALER0_bp 0 ///< Clock Prescaler Selection bit 0 position
#define ADC_PRESCALER1_bm (1<<1) ///< Clock Prescaler Selection bit 1 mask
#define ADC_PRESCALER1_bp 1 ///< Clock Prescaler Selection bit 1 position
#define ADC_PRESCALER2_bm (1<<2) ///< Clock Prescaler Selection bit 2 mask
#define ADC_PRESCALER2_bp 2 ///< Clock Prescaler Selection bit 2 position
/** @} */

/** @name ADC.INTFLAGS
  * @{
  */
#define ADC_CH0IF_bm 0x01 ///< Channel 0 Interrupt Flag bit mask
#define ADC_CH0IF_bp 0 ///< Channel 0 Interrupt Flag bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Positive input multiplexer selection

typedef enum ADC_CH_MUXPOS_enum {
	ADC_CH_MUXPOS_PIN0_gc = (0x00<<3),	///< Input pin 0
	ADC_CH_MUXPOS_PIN1_gc = (0x01<<3),	///< Input pin 1
	ADC_CH_MUXPOS_PIN2_gc = (0x02<<3),	///< Input pin 2
	ADC_CH_MUXPOS_PIN3_gc = (0x03<<3),	///< Input pin 3
	ADC_CH_MUXPOS_PIN4_gc = (0x04<<3),	///< Input pin 4
	ADC_CH_MUXPOS_PIN5_gc = (0x05<<3),	///< Input pin 5
	ADC_CH_MUXPOS_PIN6_gc = (0x06<<3),	///< Input pin 6
	ADC_CH_MUXPOS_PIN7_gc = (0x07<<3),	///< Input pin 7
} ADC_CH_MUXPOS_t;

/// Negative input multiplexer selection

typedef enum ADC_CH_MUXNEG_enum {
	ADC_CH_MUXNEG_PIN0_gc = (0x00<<0),	///< Input pin 0
	ADC_CH_MUXNEG_PIN1_gc = (0x01<<0),	///< Input pin 1
	ADC_CH_MUXNEG_PIN2_gc = (0x02<<0),	///< Input pin 2
	ADC_CH_MUXNEG_PIN3_gc = (0x03<<0),	///< Input pin 3
	ADC_CH_MUXNEG_PIN4_gc = (0x04<<0),	///< Input pin 4
	ADC_CH_MUXNEG_PIN5_gc = (0x05<<0),	///< Input pin 5
	ADC_CH_MUXNEG_PIN6_gc = (0x06<<0),	///< Input pin 6
	ADC_CH_MUXNEG_PIN7_gc = (0x07<<0),	///< Input pin 7
} ADC_CH_MUXNEG_t;

/// Input mode

typedef enum ADC_CH_INPUTMODE_enum {
	ADC_CH_INPUTMODE_INTERNAL_gc = (0x00<<0),	///< Internal inputs, no gain
	ADC_CH_INPUTMODE_SINGLEENDED_gc = (0x01<<0),	///< Single-ended input, no gain
	ADC_CH_INPUTMODE_DIFF_gc = (0x02<<0),	///< Differential input, no gain
	ADC_CH_INPUTMODE_DIFFWGAIN_gc = (0x03<<0),	///< Differential input, with gain
} ADC_CH_INPUTMODE_t;

/// Gain factor

typedef enum ADC_CH_GAIN_enum {
	ADC_CH_GAIN_1X_gc = (0x00<<2),	///< 1x gain
	ADC_CH_GAIN_2X_gc = (0x01<<2),	///< 2x gain
	ADC_CH_GAIN_4X_gc = (0x02<<2),	///< 4x gain
	ADC_CH_GAIN_8X_gc = (0x03<<2),	///< 8x gain
	ADC_CH_GAIN_16X_gc = (0x04<<2),	///< 16x gain
	ADC_CH_GAIN_32X_gc = (0x05<<2),	///< 32x gain
	ADC_CH_GAIN_64X_gc = (0x06<<2),	///< 64x gain
} ADC_CH_GAIN_t;

/// Conversion result resolution

