dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
typedef enum ADC_RESOLUTION_enum {
	ADC_RESOLUTION_12BIT_gc = (0x00<<1),	///< 12-bit right-adjusted result
	ADC_RESOLUTION_8BIT_gc = (0x02<<1),	///< 8-bit right-adjusted result
	ADC_RESOLUTION_LEFT12BIT_gc = (0x03<<1),	///< 12-bit left-adjusted result
} ADC_RESOLUTION_t;

/// Voltage reference selection

typedef enum ADC_REFSEL_enum {
	ADC_REFSEL_INT1V_gc = (0x00<<4),	///< Internal 1V
	ADC_REFSEL_VCC_gc = (0x01<<4),	///< Internal VCC/1.6V
	ADC_REFSEL_AREFA_gc = (0x02<<4),	///< External reference on PORT A
	ADC_REFSEL_AREFB_gc = (0x03<<4),	///< External reference on PORT B
} ADC_REFSEL_t;

/// Event channel input selection

typedef enum ADC_EVSEL_enum {
	ADC_EVSEL_0123_gc = (0x00<<3),	///< Event Channel 0,1,2,3
	ADC_EVSEL_1234_gc = (0x01<<3),	///< Event Channel 1,2,3,4
	ADC_EVSEL_2345_gc = (0x02<<3),	///< Event Channel 2,3,4,5
	ADC_EVSEL_3456_gc = (0x03<<3),	///< Event Channel 3,4,5,6
	ADC_EVSEL_4567_gc = (0x04<<3),	///< Event Channel 4,5,6,7
	ADC_EVSEL_567_gc = (0x05<<3),	///< Event Channel 5,6,7
	ADC_EVSEL_67_gc = (0x06<<3),	///< Event Channel 6,7
	ADC_EVSEL_7_gc = (0x07<<3),	///< Event Channel 7
} ADC_EVSEL_t;

/// Event action selection

typedef enum ADC_EVACT_enum {
	ADC_EVACT_NONE_gc = (0x00<<0),	///< No event action
	ADC_EVACT_CH0_gc = (0x01<<0),	///< First event triggers channel 0
} ADC_EVACT_t;

/// Interupt mode

typedef enum ADC_CH_INTMODE_enum {
	ADC_CH_INTMODE_COMPLETE_gc = (0x00<<2),	///< Interrupt on conversion complete
	ADC_CH_INTMODE_BELOW_gc = (0x01<<2),	///< Interrupt on result below compare value
	ADC_CH_INTMODE_ABOVE_gc = (0x03<<2),	///< Interrupt on result above compare value
} ADC_CH_INTMODE_t;

/// Interrupt level

typedef enum ADC_CH_INTLVL_enum {
	ADC_CH_INTLVL_OFF_gc = (0x00<<0),	///< Interrupt disabled
	ADC_CH_INTLVL_LO_gc = (0x01<<0),	///< Low level
	ADC_CH_INTLVL_MED_gc = (0x02<<0),	///< Medium level
	ADC_CH_INTLVL_HI_gc = (0x03<<0),	///< High level
} ADC_CH_INTLVL_t;

/// Clock prescaler

typedef enum ADC_PRESCALER_enum {
	ADC_PRESCALER_DIV4_gc = (0x00<<0),	///< Divide clock by 4
	ADC_PRESCALER_DIV8_gc = (0x01<<0),	///< Divide clock by 8
	ADC_PRESCALER_DIV16_gc = (0x02<<0),	///< Divide clock by 16
	ADC_PRESCALER_DIV32_gc = (0x03<<0),	///< Divide clock by 32
	ADC_PRESCALER_DIV64_gc = (0x04<<0),	///< Divide clock by 64
	ADC_PRESCALER_DIV128_gc = (0x05<<0),	///< Divide clock by 128
	ADC_PRESCALER_DIV256_gc = (0x06<<0),	///< Divide clock by 256
	ADC_PRESCALER_DIV512_gc = (0x07<<0),	///< Divide clock by 512
} ADC_PRESCALER_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Positive input multiplexer selection
#define ADC_CH_MUXPOS_PIN0_gc (0x00<<3)	///< Input pin 0
#define ADC_CH_MUXPOS_PIN1_gc (0x01<<3)	///< Input pin 1
#define ADC_CH_MUXPOS_PIN2_gc (0x02<<3)	///< Input pin 2
#define ADC_CH_MUXPOS_PIN3_gc (0x03<<3)	///< Input pin 3
#define ADC_CH_MUXPOS_PIN4_gc (0x04<<3)	///< Input pin 4
#define ADC_CH_MUXPOS_PIN5_gc (0x05<<3)	///< Input pin 5
#define ADC_CH_MUXPOS_PIN6_gc (0x06<<3)	///< Input pin 6
#define ADC_CH_MUXPOS_PIN7_gc (0x07<<3)	///< Input pin 7

/// Negative input multiplexer selection
#define ADC_CH_MUXNEG_PIN0_gc (0x00<<0)	///< Input pin 0
#define ADC_CH_MUXNEG_PIN1_gc (0x01<<0)	///< Input pin 1
#define ADC_CH_MUXNEG_PIN2_gc (0x02<<0)	///< Input pin 2
#define ADC_CH_MUXNEG_PIN3_gc (0x03<<0)	///< Input pin 3
#define ADC_CH_MUXNEG_PIN4_gc (0x04<<0)	///< Input pin 4
#define ADC_CH_MUXNEG_PIN5_gc (0x05<<0)	///< Input pin 5
#define ADC_CH_MUXNEG_PIN6_gc (0x06<<0)	///< Input pin 6
#define ADC_CH_MUXNEG_PIN7_gc (0x07<<0)	///< Input pin 7

/// Input mode
#define ADC_CH_INPUTMODE_INTERNAL_gc (0x00<<0)	///< Internal inputs, no gain
#define ADC_CH_INPUTMODE_SINGLEENDED_gc (0x01<<0)	///< Single-ended input, no gain
#define ADC_CH_INPUTMODE_DIFF_gc (0x02<<0)	///< Differential input, no gain
#define ADC_CH_INPUTMODE_DIFFWGAIN_gc (0x03<<0)	///< Differential input, with gain

/// Gain factor
#define ADC_CH_GAIN_1X_gc (0x00<<2)	///< 1x gain
#define ADC_CH_GAIN_2X_gc (0x01<<2)	///< 2x gain
#define ADC_CH_GAIN_4X_gc (0x02<<2)	///< 4x gain
#define ADC_CH_GAIN_8X_gc (0x03<<2)	///< 8x gain
#define ADC_CH_GAIN_16X_gc (0x04<<2)	///< 16x gain
#define ADC_CH_GAIN_32X_gc (0x05<<2)	///< 32x gain
#define ADC_CH_GAIN_64X_gc (0x06<<2)	///< 64x gain

/// Conversion result resolution
#define ADC_RESOLUTION_12BIT_gc (0x00<<1)	///< 12-bit right-adjusted result
#define ADC_RESOLUTION_8BIT_gc (0x02<<1)	///< 8-bit right-adjusted result
#define ADC_RESOLUTION_LEFT12BIT_gc (0x03<<1)	///< 12-bit left-adjusted result

/// Voltage reference selection
#define ADC_REFSEL_INT1V_gc (0x00<<4)	///< Internal 1V
#define ADC_REFSEL_VCC_gc (0x01<<4)	///< Internal VCC/1.6V
#define ADC_REFSEL_AREFA_gc (0x02<<4)	///< External reference on PORT A
#define ADC_REFSEL_AREFB_gc (0x03<<4)	///< External reference on PORT B

/// Event channel input selection
#define ADC_EVSEL_0123_gc (0x00<<3)	///< Event Channel 0,1,2,3
#define ADC_EVSEL_1234_gc (0x01<<3)	///< Event Channel 1,2,3,4
#define ADC_EVSEL_2345_gc (0x02<<3)	///< Event Channel 2,3,4,5
#define ADC_EVSEL_3456_gc (0x03<<3)	///< Event Channel 3,4,5,6
#define ADC_EVSEL_4567_gc (0x04<<3)	///< Event Channel 4,5,6,7
#define ADC_EVSEL_567_gc (0x05<<3)	///< Event Channel 5,6,7
#define ADC_EVSEL_67_gc (0x06<<3)	///< Event Channel 6,7
#define ADC_EVSEL_7_gc (0x07<<3)	///< Event Channel 7

/// Event action selection
#define ADC_EVACT_NONE_gc (0x00<<0)	///< No event action
#define ADC_EVACT_CH0_gc (0x01<<0)	///< First event triggers channel 0

/// Interupt mode
#define ADC_CH_INTMODE_COMPLETE_gc (0x00<<2)	///< Interrupt on conversion complete
#define ADC_CH_INTMODE_BELOW_gc (0x01<<2)	///< Interrupt on result below compare value
#define ADC_CH_INTMODE_ABOVE_gc (0x03<<2)	///< Interrupt on result above compare value

/// Interrupt level
#define ADC_CH_INTLVL_OFF_gc (0x00<<0)	///< Interrupt disabled
#define ADC_CH_INTLVL_LO_gc (0x01<<0)	///< Low level
#define ADC_CH_INTLVL_MED_gc (0x02<<0)	///< Medium level
#define ADC_CH_INTLVL_HI_gc (0x03<<0)	///< High level

