dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Clock prescaler
#define ADC_PRESCALER_DIV4_gc (0x00<<0)	///< Divide clock by 4
#define ADC_PRESCALER_DIV8_gc (0x01<<0)	///< Divide clock by 8
#define ADC_PRESCALER_DIV16_gc (0x02<<0)	///< Divide clock by 16
#define ADC_PRESCALER_DIV32_gc (0x03<<0)	///< Divide clock by 32
#define ADC_PRESCALER_DIV64_gc (0x04<<0)	///< Divide clock by 64
#define ADC_PRESCALER_DIV128_gc (0x05<<0)	///< Divide clock by 128
#define ADC_PRESCALER_DIV256_gc (0x06<<0)	///< Divide clock by 256
#define ADC_PRESCALER_DIV512_gc (0x07<<0)	///< Divide clock by 512

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup rtc Real-Time Clounter
 *  @{
 */

/** @name RTC.CTRL
  * @see RTC_PRESCALER_enum
  * @{
  */
#define RTC_PRESCALER_gm 0x07 ///< Prescaling Factor group mask
#define RTC_PRESCALER_gp 0 ///< Prescaling Factor group position
#define RTC_PRESCALER0_bm (1<<0) ///< Prescaling Factor bit 0 mask
#define RTC_PRESCALER0_bp 0 ///< Prescaling Factor bit 0 position
#define RTC_PRESCALER1_bm (1<<1) ///< Prescaling Factor bit 1 mask
#define RTC_PRESCALER1_bp 1 ///< Prescaling Factor bit 1 position
#define RTC_PRESCALER2_bm (1<<2) ///< Prescaling Factor bit 2 mask
#define RTC_PRESCALER2_bp 2 ///< Prescaling Factor bit 2 position
/** @} */

/** @name RTC.STATUS
  * @{
  */
#define RTC_SYNCBUSY_bm 0x01 ///< Synchronization Busy Flag bit mask
#define RTC_SYNCBUSY_bp 0 ///< Synchronization Busy Flag bit position
/** @} */

/** @name RTC.INTCTRL
  * @see RTC_COMPINTLVL_enum
  * @see RTC_OVFINTLVL_enum
  * @{
  */
#define RTC_COMPINTLVL_gm 0x0C ///< Compare Match Interrupt Level group mask
#define RTC_COMPINTLVL_gp 2 ///< Compare Match Interrupt Level group position
#define RTC_COMPINTLVL0_bm (1<<2) ///< Compare Match Interrupt Level bit 0 mask
#define RTC_COMPINTLVL0_bp 2 ///< Compare Match Interrupt Level bit 0 position
#define RTC_COMPINTLVL1_bm (1<<3) ///< Compare Match Interrupt Level bit 1 mask
#define RTC_COMPINTLVL1_bp 3 ///< Compare Match Interrupt Level bit 1 position
#define RTC_OVFINTLVL_gm 0x03 ///< Overflow Interrupt Level group mask
#define RTC_OVFINTLVL_gp 0 ///< Overflow Interrupt Level group position
#define RTC_OVFINTLVL0_bm (1<<0) ///< Overflow Interrupt Level bit 0 mask
#define RTC_OVFINTLVL0_bp 0 ///< Overflow Interrupt Level bit 0 position
#define RTC_OVFINTLVL1_bm (1<<1) ///< Overflow Interrupt Level bit 1 mask
#define RTC_OVFINTLVL1_bp 1 ///< Overflow Interrupt Level bit 1 position
/** @} */

/** @name RTC.INTFLAGS
  * @{
  */
#define RTC_COMPIF_bm 0x02 ///< Compare Match Interrupt Flag bit mask
#define RTC_COMPIF_bp 1 ///< Compare Match Interrupt Flag bit position
#define RTC_OVFIF_bm 0x01 ///< Overflow Interrupt Flag bit mask
#define RTC_OVFIF_bp 0 ///< Overflow Interrupt Flag bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Prescaler Factor

typedef enum RTC_PRESCALER_enum {
	RTC_PRESCALER_OFF_gc = (0x00<<0),	///< RTC Off
	RTC_PRESCALER_DIV1_gc = (0x01<<0),	///< RTC Clock
	RTC_PRESCALER_DIV2_gc = (0x02<<0),	///< RTC Clock / 2
	RTC_PRESCALER_DIV8_gc = (0x03<<0),	///< RTC Clock / 8
	RTC_PRESCALER_DIV16_gc = (0x04<<0),	///< RTC Clock / 16
	RTC_PRESCALER_DIV64_gc = (0x05<<0),	///< RTC Clock / 64
	RTC_PRESCALER_DIV256_gc = (0x06<<0),	///< RTC Clock / 256
	RTC_PRESCALER_DIV1024_gc = (0x07<<0),	///< RTC Clock / 1024
} RTC_PRESCALER_t;

/// Compare Interrupt level

typedef enum RTC_COMPINTLVL_enum {
	RTC_COMPINTLVL_OFF_gc = (0x00<<2),	///< Interrupt Disabled
	RTC_COMPINTLVL_LO_gc = (0x01<<2),	///< Low Level
	RTC_COMPINTLVL_MED_gc = (0x02<<2),	///< Medium Level
	RTC_COMPINTLVL_HI_gc = (0x03<<2),	///< High Level
} RTC_COMPINTLVL_t;

/// Overflow Interrupt level

typedef enum RTC_OVFINTLVL_enum {
	RTC_OVFINTLVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	RTC_OVFINTLVL_LO_gc = (0x01<<0),	///< Low Level
	RTC_OVFINTLVL_MED_gc = (0x02<<0),	///< Medium Level
	RTC_OVFINTLVL_HI_gc = (0x03<<0),	///< High Level
} RTC_OVFINTLVL_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Prescaler Factor
#define RTC_PRESCALER_OFF_gc (0x00<<0)	///< RTC Off
#define RTC_PRESCALER_DIV1_gc (0x01<<0)	///< RTC Clock
#define RTC_PRESCALER_DIV2_gc (0x02<<0)	///< RTC Clock / 2
#define RTC_PRESCALER_DIV8_gc (0x03<<0)	///< RTC Clock / 8
#define RTC_PRESCALER_DIV16_gc (0x04<<0)	///< RTC Clock / 16
#define RTC_PRESCALER_DIV64_gc (0x05<<0)	///< RTC Clock / 64
#define RTC_PRESCALER_DIV256_gc (0x06<<0)	///< RTC Clock / 256
#define RTC_PRESCALER_DIV1024_gc (0x07<<0)	///< RTC Clock / 1024

/// Compare Interrupt level
#define RTC_COMPINTLVL_OFF_gc (0x00<<2)	///< Interrupt Disabled
#define RTC_COMPINTLVL_LO_gc (0x01<<2)	///< Low Level
#define RTC_COMPINTLVL_MED_gc (0x02<<2)	///< Medium Level
#define RTC_COMPINTLVL_HI_gc (0x03<<2)	///< High Level

/// Overflow Interrupt level
#define RTC_OVFINTLVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define RTC_OVFINTLVL_LO_gc (0x01<<0)	///< Low Level
#define RTC_OVFINTLVL_MED_gc (0x02<<0)	///< Medium Level
#define RTC_OVFINTLVL_HI_gc (0x03<<0)	///< High Level

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup ebi External Bus Interface
 *  @{
 */

/** @name EBI_CS.CTRLA
  * @see EBI_CS_ASIZE_enum
  * @see EBI_CS_MODE_enum
  * @{
  */
#define EBI_CS_ASIZE_gm 0x7C ///< Address Space group mask
#define EBI_CS_ASIZE_gp 2 ///< Address Space group position
#define EBI_CS_ASIZE0_bm (1<<2) ///< Address Space bit 0 mask
#define EBI_CS_ASIZE0_bp 2 ///< Address Space bit 0 position
#define EBI_CS_ASIZE1_bm (1<<3) ///< Address Space bit 1 mask
#define EBI_CS_ASIZE1_bp 3 ///< Address Space bit 1 position
#define EBI_CS_ASIZE2_bm (1<<4) ///< Address Space bit 2 mask
#define EBI_CS_ASIZE2_bp 4 ///< Address Space bit 2 position
#define EBI_CS_ASIZE3_bm (1<<5) ///< Address Space bit 3 mask
#define EBI_CS_ASIZE3_bp 5 ///< Address Space bit 3 position
#define EBI_CS_ASIZE4_bm (1<<6) ///< Address Space bit 4 mask
#define EBI_CS_ASIZE4_bp 6 ///< Address Space bit 4 position
#define EBI_CS_MODE_gm 0x03 ///< Memory Mode group mask
#define EBI_CS_MODE_gp 0 ///< Memory Mode group position
#define EBI_CS_MODE0_bm (1<<0) ///< Memory Mode bit 0 mask
#define EBI_CS_MODE0_bp 0 ///< Memory Mode bit 0 position
#define EBI_CS_MODE1_bm (1<<1) ///< Memory Mode bit 1 mask
#define EBI_CS_MODE1_bp 1 ///< Memory Mode bit 1 position
/** @} */

/** @name EBI_CS.CTRLB
  * @see EBI_CS_SRWS_enum
  * @see EBI_CS_SDMODE_enum
  * @{
  */
#define EBI_CS_SRWS_gm 0x07 ///< SRAM Wait State Cycles group mask
#define EBI_CS_SRWS_gp 0 ///< SRAM Wait State Cycles group position
#define EBI_CS_SRWS0_bm (1<<0) ///< SRAM Wait State Cycles bit 0 mask
#define EBI_CS_SRWS0_bp 0 ///< SRAM Wait State Cycles bit 0 position
#define EBI_CS_SRWS1_bm (1<<1) ///< SRAM Wait State Cycles bit 1 mask
#define EBI_CS_SRWS1_bp 1 ///< SRAM Wait State Cycles bit 1 position
#define EBI_CS_SRWS2_bm (1<<2) ///< SRAM Wait State Cycles bit 2 mask
#define EBI_CS_SRWS2_bp 2 ///< SRAM Wait State Cycles bit 2 position
#define EBI_CS_SDINITDONE_bm 0x80 ///< SDRAM Initialization Done bit mask
#define EBI_CS_SDINITDONE_bp 7 ///< SDRAM Initialization Done bit position
#define EBI_CS_SDSREN_bm 0x04 ///< SDRAM Self-refresh Enable bit mask
#define EBI_CS_SDSREN_bp 2 ///< SDRAM Self-refresh Enable bit position
#define EBI_CS_SDMODE_gm 0x03 ///< SDRAM Mode group mask
#define EBI_CS_SDMODE_gp 0 ///< SDRAM Mode group position
#define EBI_CS_SDMODE0_bm (1<<0) ///< SDRAM Mode bit 0 mask
#define EBI_CS_SDMODE0_bp 0 ///< SDRAM Mode bit 0 position
#define EBI_CS_SDMODE1_bm (1<<1) ///< SDRAM Mode bit 1 mask
#define EBI_CS_SDMODE1_bp 1 ///< SDRAM Mode bit 1 position
/** @} */

/** @name EBI.CTRL
  * @see EBI_SDDATAW_enum
  * @see EBI_LPCMODE_enum
  * @see EBI_SRMODE_enum
  * @see EBI_IFMODE_enum
  * @{
  */
#define EBI_SDDATAW_gm 0xC0 ///< SDRAM Data Width Setting group mask
#define EBI_SDDATAW_gp 6 ///< SDRAM Data Width Setting group position
#define EBI_SDDATAW0_bm (1<<6) ///< SDRAM Data Width Setting bit 0 mask
#define EBI_SDDATAW0_bp 6 ///< SDRAM Data Width Setting bit 0 position
#define EBI_SDDATAW1_bm (1<<7) ///< SDRAM Data Width Setting bit 1 mask
#define EBI_SDDATAW1_bp 7 ///< SDRAM Data Width Setting bit 1 position
#define EBI_LPCMODE_gm 0x30 ///< SRAM LPC Mode group mask
#define EBI_LPCMODE_gp 4 ///< SRAM LPC Mode group position
#define EBI_LPCMODE0_bm (1<<4) ///< SRAM LPC Mode bit 0 mask
#define EBI_LPCMODE0_bp 4 ///< SRAM LPC Mode bit 0 position
#define EBI_LPCMODE1_bm (1<<5) ///< SRAM LPC Mode bit 1 mask
#define EBI_LPCMODE1_bp 5 ///< SRAM LPC Mode bit 1 position
#define EBI_SRMODE_gm 0x0C ///< SRAM Mode group mask
#define EBI_SRMODE_gp 2 ///< SRAM Mode group position
#define EBI_SRMODE0_bm (1<<2) ///< SRAM Mode bit 0 mask
#define EBI_SRMODE0_bp 2 ///< SRAM Mode bit 0 position
#define EBI_SRMODE1_bm (1<<3) ///< SRAM Mode bit 1 mask
#define EBI_SRMODE1_bp 3 ///< SRAM Mode bit 1 position
#define EBI_IFMODE_gm 0x03 ///< Interface Mode group mask
#define EBI_IFMODE_gp 0 ///< Interface Mode group position
#define EBI_IFMODE0_bm (1<<0) ///< Interface Mode bit 0 mask
#define EBI_IFMODE0_bp 0 ///< Interface Mode bit 0 position
#define EBI_IFMODE1_bm (1<<1) ///< Interface Mode bit 1 mask
#define EBI_IFMODE1_bp 1 ///< Interface Mode bit 1 position
/** @} */

