dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name EBI.SDRAMCTRLA
  * @see EBI_SDCOL_enum
  * @{
  */
#define EBI_SDCAS_bm 0x08 ///< SDRAM CAS Latency Setting bit mask
#define EBI_SDCAS_bp 3 ///< SDRAM CAS Latency Setting bit position
#define EBI_SDROW_bm 0x04 ///< SDRAM ROW Bits Setting bit mask
#define EBI_SDROW_bp 2 ///< SDRAM ROW Bits Setting bit position
#define EBI_SDCOL_gm 0x03 ///< SDRAM Column Bits Setting group mask
#define EBI_SDCOL_gp 0 ///< SDRAM Column Bits Setting group position
#define EBI_SDCOL0_bm (1<<0) ///< SDRAM Column Bits Setting bit 0 mask
#define EBI_SDCOL0_bp 0 ///< SDRAM Column Bits Setting bit 0 position
#define EBI_SDCOL1_bm (1<<1) ///< SDRAM Column Bits Setting bit 1 mask
#define EBI_SDCOL1_bp 1 ///< SDRAM Column Bits Setting bit 1 position
/** @} */

/** @name EBI.SDRAMCTRLB
  * @see EBI_MRDLY_enum
  * @see EBI_ROWCYCDLY_enum
  * @see EBI_RPDLY_enum
  * @{
  */
#define EBI_MRDLY_gm 0xC0 ///< SDRAM Mode Register Delay group mask
#define EBI_MRDLY_gp 6 ///< SDRAM Mode Register Delay group position
#define EBI_MRDLY0_bm (1<<6) ///< SDRAM Mode Register Delay bit 0 mask
#define EBI_MRDLY0_bp 6 ///< SDRAM Mode Register Delay bit 0 position
#define EBI_MRDLY1_bm (1<<7) ///< SDRAM Mode Register Delay bit 1 mask
#define EBI_MRDLY1_bp 7 ///< SDRAM Mode Register Delay bit 1 position
#define EBI_ROWCYCDLY_gm 0x38 ///< SDRAM Row Cycle Delay group mask
#define EBI_ROWCYCDLY_gp 3 ///< SDRAM Row Cycle Delay group position
#define EBI_ROWCYCDLY0_bm (1<<3) ///< SDRAM Row Cycle Delay bit 0 mask
#define EBI_ROWCYCDLY0_bp 3 ///< SDRAM Row Cycle Delay bit 0 position
#define EBI_ROWCYCDLY1_bm (1<<4) ///< SDRAM Row Cycle Delay bit 1 mask
#define EBI_ROWCYCDLY1_bp 4 ///< SDRAM Row Cycle Delay bit 1 position
#define EBI_ROWCYCDLY2_bm (1<<5) ///< SDRAM Row Cycle Delay bit 2 mask
#define EBI_ROWCYCDLY2_bp 5 ///< SDRAM Row Cycle Delay bit 2 position
#define EBI_RPDLY_gm 0x07 ///< SDRAM Row-to-Precharge Delay group mask
#define EBI_RPDLY_gp 0 ///< SDRAM Row-to-Precharge Delay group position
#define EBI_RPDLY0_bm (1<<0) ///< SDRAM Row-to-Precharge Delay bit 0 mask
#define EBI_RPDLY0_bp 0 ///< SDRAM Row-to-Precharge Delay bit 0 position
#define EBI_RPDLY1_bm (1<<1) ///< SDRAM Row-to-Precharge Delay bit 1 mask
#define EBI_RPDLY1_bp 1 ///< SDRAM Row-to-Precharge Delay bit 1 position
#define EBI_RPDLY2_bm (1<<2) ///< SDRAM Row-to-Precharge Delay bit 2 mask
#define EBI_RPDLY2_bp 2 ///< SDRAM Row-to-Precharge Delay bit 2 position
/** @} */

/** @name EBI.SDRAMCTRLC
  * @see EBI_WRDLY_enum
  * @see EBI_ESRDLY_enum
  * @see EBI_ROWCOLDLY_enum
  * @{
  */
#define EBI_WRDLY_gm 0xC0 ///< SDRAM Write Recovery Delay group mask
#define EBI_WRDLY_gp 6 ///< SDRAM Write Recovery Delay group position
#define EBI_WRDLY0_bm (1<<6) ///< SDRAM Write Recovery Delay bit 0 mask
#define EBI_WRDLY0_bp 6 ///< SDRAM Write Recovery Delay bit 0 position
#define EBI_WRDLY1_bm (1<<7) ///< SDRAM Write Recovery Delay bit 1 mask
#define EBI_WRDLY1_bp 7 ///< SDRAM Write Recovery Delay bit 1 position
#define EBI_ESRDLY_gm 0x38 ///< SDRAM Exit-Self-refresh-to-Active Delay group mask
#define EBI_ESRDLY_gp 3 ///< SDRAM Exit-Self-refresh-to-Active Delay group position
#define EBI_ESRDLY0_bm (1<<3) ///< SDRAM Exit-Self-refresh-to-Active Delay bit 0 mask
#define EBI_ESRDLY0_bp 3 ///< SDRAM Exit-Self-refresh-to-Active Delay bit 0 position
#define EBI_ESRDLY1_bm (1<<4) ///< SDRAM Exit-Self-refresh-to-Active Delay bit 1 mask
#define EBI_ESRDLY1_bp 4 ///< SDRAM Exit-Self-refresh-to-Active Delay bit 1 position
#define EBI_ESRDLY2_bm (1<<5) ///< SDRAM Exit-Self-refresh-to-Active Delay bit 2 mask
#define EBI_ESRDLY2_bp 5 ///< SDRAM Exit-Self-refresh-to-Active Delay bit 2 position
#define EBI_ROWCOLDLY_gm 0x07 ///< SDRAM Row-to-Column Delay group mask
#define EBI_ROWCOLDLY_gp 0 ///< SDRAM Row-to-Column Delay group position
#define EBI_ROWCOLDLY0_bm (1<<0) ///< SDRAM Row-to-Column Delay bit 0 mask
#define EBI_ROWCOLDLY0_bp 0 ///< SDRAM Row-to-Column Delay bit 0 position
#define EBI_ROWCOLDLY1_bm (1<<1) ///< SDRAM Row-to-Column Delay bit 1 mask
#define EBI_ROWCOLDLY1_bp 1 ///< SDRAM Row-to-Column Delay bit 1 position
#define EBI_ROWCOLDLY2_bm (1<<2) ///< SDRAM Row-to-Column Delay bit 2 mask
#define EBI_ROWCOLDLY2_bp 2 ///< SDRAM Row-to-Column Delay bit 2 position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Chip Select adress space

typedef enum EBI_CS_ASIZE_enum {
	EBI_CS_ASIZE_256B_gc = (0x00<<2),	///< 256 bytes
	EBI_CS_ASIZE_512B_gc = (0x01<<2),	///< 512 bytes
	EBI_CS_ASIZE_1KB_gc = (0x02<<2),	///< 1K bytes
	EBI_CS_ASIZE_2KB_gc = (0x03<<2),	///< 2K bytes
	EBI_CS_ASIZE_4KB_gc = (0x04<<2),	///< 4K bytes
	EBI_CS_ASIZE_8KB_gc = (0x05<<2),	///< 8K bytes
	EBI_CS_ASIZE_16KB_gc = (0x06<<2),	///< 16K bytes
	EBI_CS_ASIZE_32KB_gc = (0x07<<2),	///< 32K bytes
	EBI_CS_ASIZE_64KB_gc = (0x08<<2),	///< 64K bytes
	EBI_CS_ASIZE_128KB_gc = (0x09<<2),	///< 128K bytes
	EBI_CS_ASIZE_256KB_gc = (0x0A<<2),	///< 256K bytes
	EBI_CS_ASIZE_512KB_gc = (0x0B<<2),	///< 512K bytes
	EBI_CS_ASIZE_1MB_gc = (0x0C<<2),	///< 1M bytes
	EBI_CS_ASIZE_2MB_gc = (0x0D<<2),	///< 2M bytes
	EBI_CS_ASIZE_4MB_gc = (0x0E<<2),	///< 4M bytes
	EBI_CS_ASIZE_8MB_gc = (0x0F<<2),	///< 8M bytes
	EBI_CS_ASIZE_16M_gc = (0x10<<2),	///< 16M bytes
} EBI_CS_ASIZE_t;

/// -- no doc!

typedef enum EBI_CS_SRWS_enum {
	EBI_CS_SRWS_0CLK_gc = (0x00<<0),	///< 0 cycles
	EBI_CS_SRWS_1CLK_gc = (0x01<<0),	///< 1 cycle
	EBI_CS_SRWS_2CLK_gc = (0x02<<0),	///< 2 cycles
	EBI_CS_SRWS_3CLK_gc = (0x03<<0),	///< 3 cycles
	EBI_CS_SRWS_4CLK_gc = (0x04<<0),	///< 4 cycles
	EBI_CS_SRWS_5CLK_gc = (0x05<<0),	///< 5 cycle
	EBI_CS_SRWS_6CLK_gc = (0x06<<0),	///< 6 cycles
	EBI_CS_SRWS_7CLK_gc = (0x07<<0),	///< 7 cycles
} EBI_CS_SRWS_t;

/// Chip Select address mode

typedef enum EBI_CS_MODE_enum {
	EBI_CS_MODE_DISABLED_gc = (0x00<<0),	///< Chip Select Disabled
	EBI_CS_MODE_SRAM_gc = (0x01<<0),	///< Chip Select in SRAM mode
	EBI_CS_MODE_LPC_gc = (0x02<<0),	///< Chip Select in SRAM LPC mode
	EBI_CS_MODE_SDRAM_gc = (0x03<<0),	///< Chip Select in SDRAM mode
} EBI_CS_MODE_t;

/// Chip Select SDRAM mode

typedef enum EBI_CS_SDMODE_enum {
	EBI_CS_SDMODE_NORMAL_gc = (0x00<<0),	///< Normal mode
	EBI_CS_SDMODE_LOAD_gc = (0x01<<0),	///< Load Mode Register command mode
} EBI_CS_SDMODE_t;

/// -- no doc!

typedef enum EBI_SDDATAW_enum {
	EBI_SDDATAW_4BIT_gc = (0x00<<6),	///< 4-bit data bus
	EBI_SDDATAW_8BIT_gc = (0x01<<6),	///< 8-bit data bus
} EBI_SDDATAW_t;

/// -- no doc!

typedef enum EBI_LPCMODE_enum {
	EBI_LPCMODE_ALE1_gc = (0x00<<4),	///< Data muxed with addr byte 0
	EBI_LPCMODE_ALE12_gc = (0x02<<4),	///< Data muxed with addr byte 0 and 1
} EBI_LPCMODE_t;

/// -- no doc!

typedef enum EBI_SRMODE_enum {
	EBI_SRMODE_ALE1_gc = (0x00<<2),	///< Addr byte 0 muxed with 1
	EBI_SRMODE_ALE2_gc = (0x01<<2),	///< Addr byte 0 muxed with 2
	EBI_SRMODE_ALE12_gc = (0x02<<2),	///< Addr byte 0 muxed with 1 and 2
	EBI_SRMODE_NOALE_gc = (0x03<<2),	///< No addr muxing
} EBI_SRMODE_t;

/// -- no doc!

