dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
typedef enum EBI_IFMODE_enum {
	EBI_IFMODE_DISABLED_gc = (0x00<<0),	///< EBI Disabled
	EBI_IFMODE_3PORT_gc = (0x01<<0),	///< 3-port mode
	EBI_IFMODE_4PORT_gc = (0x02<<0),	///< 4-port mode
	EBI_IFMODE_2PORT_gc = (0x03<<0),	///< 2-port mode
} EBI_IFMODE_t;

/// -- no doc!

typedef enum EBI_SDCOL_enum {
	EBI_SDCOL_8BIT_gc = (0x00<<0),	///< 8 column bits
	EBI_SDCOL_9BIT_gc = (0x01<<0),	///< 9 column bits
	EBI_SDCOL_10BIT_gc = (0x02<<0),	///< 10 column bits
	EBI_SDCOL_11BIT_gc = (0x03<<0),	///< 11 column bits
} EBI_SDCOL_t;

/// -- no doc!

typedef enum EBI_MRDLY_enum {
	EBI_MRDLY_0CLK_gc = (0x00<<6),	///< 0 cycles
	EBI_MRDLY_1CLK_gc = (0x01<<6),	///< 1 cycle
	EBI_MRDLY_2CLK_gc = (0x02<<6),	///< 2 cycles
	EBI_MRDLY_3CLK_gc = (0x03<<6),	///< 3 cycles
} EBI_MRDLY_t;

/// -- no doc!

typedef enum EBI_ROWCYCDLY_enum {
	EBI_ROWCYCDLY_0CLK_gc = (0x00<<3),	///< 0 cycles
	EBI_ROWCYCDLY_1CLK_gc = (0x01<<3),	///< 1 cycle
	EBI_ROWCYCDLY_2CLK_gc = (0x02<<3),	///< 2 cycles
	EBI_ROWCYCDLY_3CLK_gc = (0x03<<3),	///< 3 cycles
	EBI_ROWCYCDLY_4CLK_gc = (0x04<<3),	///< 4 cycles
	EBI_ROWCYCDLY_5CLK_gc = (0x05<<3),	///< 5 cycle
	EBI_ROWCYCDLY_6CLK_gc = (0x06<<3),	///< 6 cycles
	EBI_ROWCYCDLY_7CLK_gc = (0x07<<3),	///< 7 cycles
} EBI_ROWCYCDLY_t;

/// -- no doc!

typedef enum EBI_RPDLY_enum {
	EBI_RPDLY_0CLK_gc = (0x00<<0),	///< 0 cycles
	EBI_RPDLY_1CLK_gc = (0x01<<0),	///< 1 cycle
	EBI_RPDLY_2CLK_gc = (0x02<<0),	///< 2 cycles
	EBI_RPDLY_3CLK_gc = (0x03<<0),	///< 3 cycles
	EBI_RPDLY_4CLK_gc = (0x04<<0),	///< 4 cycles
	EBI_RPDLY_5CLK_gc = (0x05<<0),	///< 5 cycle
	EBI_RPDLY_6CLK_gc = (0x06<<0),	///< 6 cycles
	EBI_RPDLY_7CLK_gc = (0x07<<0),	///< 7 cycles
} EBI_RPDLY_t;

/// -- no doc!

typedef enum EBI_WRDLY_enum {
	EBI_WRDLY_0CLK_gc = (0x00<<6),	///< 0 cycles
	EBI_WRDLY_1CLK_gc = (0x01<<6),	///< 1 cycle
	EBI_WRDLY_2CLK_gc = (0x02<<6),	///< 2 cycles
	EBI_WRDLY_3CLK_gc = (0x03<<6),	///< 3 cycles
} EBI_WRDLY_t;

/// -- no doc!

typedef enum EBI_ESRDLY_enum {
	EBI_ESRDLY_0CLK_gc = (0x00<<3),	///< 0 cycles
	EBI_ESRDLY_1CLK_gc = (0x01<<3),	///< 1 cycle
	EBI_ESRDLY_2CLK_gc = (0x02<<3),	///< 2 cycles
	EBI_ESRDLY_3CLK_gc = (0x03<<3),	///< 3 cycles
	EBI_ESRDLY_4CLK_gc = (0x04<<3),	///< 4 cycles
	EBI_ESRDLY_5CLK_gc = (0x05<<3),	///< 5 cycle
	EBI_ESRDLY_6CLK_gc = (0x06<<3),	///< 6 cycles
	EBI_ESRDLY_7CLK_gc = (0x07<<3),	///< 7 cycles
} EBI_ESRDLY_t;

/// -- no doc!

typedef enum EBI_ROWCOLDLY_enum {
	EBI_ROWCOLDLY_0CLK_gc = (0x00<<0),	///< 0 cycles
	EBI_ROWCOLDLY_1CLK_gc = (0x01<<0),	///< 1 cycle
	EBI_ROWCOLDLY_2CLK_gc = (0x02<<0),	///< 2 cycles
	EBI_ROWCOLDLY_3CLK_gc = (0x03<<0),	///< 3 cycles
	EBI_ROWCOLDLY_4CLK_gc = (0x04<<0),	///< 4 cycles
	EBI_ROWCOLDLY_5CLK_gc = (0x05<<0),	///< 5 cycle
	EBI_ROWCOLDLY_6CLK_gc = (0x06<<0),	///< 6 cycles
	EBI_ROWCOLDLY_7CLK_gc = (0x07<<0),	///< 7 cycles
} EBI_ROWCOLDLY_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Chip Select adress space
#define EBI_CS_ASIZE_256B_gc (0x00<<2)	///< 256 bytes
#define EBI_CS_ASIZE_512B_gc (0x01<<2)	///< 512 bytes
#define EBI_CS_ASIZE_1KB_gc (0x02<<2)	///< 1K bytes
#define EBI_CS_ASIZE_2KB_gc (0x03<<2)	///< 2K bytes
#define EBI_CS_ASIZE_4KB_gc (0x04<<2)	///< 4K bytes
#define EBI_CS_ASIZE_8KB_gc (0x05<<2)	///< 8K bytes
#define EBI_CS_ASIZE_16KB_gc (0x06<<2)	///< 16K bytes
#define EBI_CS_ASIZE_32KB_gc (0x07<<2)	///< 32K bytes
#define EBI_CS_ASIZE_64KB_gc (0x08<<2)	///< 64K bytes
#define EBI_CS_ASIZE_128KB_gc (0x09<<2)	///< 128K bytes
#define EBI_CS_ASIZE_256KB_gc (0x0A<<2)	///< 256K bytes
#define EBI_CS_ASIZE_512KB_gc (0x0B<<2)	///< 512K bytes
#define EBI_CS_ASIZE_1MB_gc (0x0C<<2)	///< 1M bytes
#define EBI_CS_ASIZE_2MB_gc (0x0D<<2)	///< 2M bytes
#define EBI_CS_ASIZE_4MB_gc (0x0E<<2)	///< 4M bytes
#define EBI_CS_ASIZE_8MB_gc (0x0F<<2)	///< 8M bytes
#define EBI_CS_ASIZE_16M_gc (0x10<<2)	///< 16M bytes

///
#define EBI_CS_SRWS_0CLK_gc (0x00<<0)	///< 0 cycles
#define EBI_CS_SRWS_1CLK_gc (0x01<<0)	///< 1 cycle
#define EBI_CS_SRWS_2CLK_gc (0x02<<0)	///< 2 cycles
#define EBI_CS_SRWS_3CLK_gc (0x03<<0)	///< 3 cycles
#define EBI_CS_SRWS_4CLK_gc (0x04<<0)	///< 4 cycles
#define EBI_CS_SRWS_5CLK_gc (0x05<<0)	///< 5 cycle
#define EBI_CS_SRWS_6CLK_gc (0x06<<0)	///< 6 cycles
#define EBI_CS_SRWS_7CLK_gc (0x07<<0)	///< 7 cycles

/// Chip Select address mode
#define EBI_CS_MODE_DISABLED_gc (0x00<<0)	///< Chip Select Disabled
#define EBI_CS_MODE_SRAM_gc (0x01<<0)	///< Chip Select in SRAM mode
#define EBI_CS_MODE_LPC_gc (0x02<<0)	///< Chip Select in SRAM LPC mode
#define EBI_CS_MODE_SDRAM_gc (0x03<<0)	///< Chip Select in SDRAM mode

/// Chip Select SDRAM mode
#define EBI_CS_SDMODE_NORMAL_gc (0x00<<0)	///< Normal mode
#define EBI_CS_SDMODE_LOAD_gc (0x01<<0)	///< Load Mode Register command mode

///
#define EBI_SDDATAW_4BIT_gc (0x00<<6)	///< 4-bit data bus
#define EBI_SDDATAW_8BIT_gc (0x01<<6)	///< 8-bit data bus

///
#define EBI_LPCMODE_ALE1_gc (0x00<<4)	///< Data muxed with addr byte 0
#define EBI_LPCMODE_ALE12_gc (0x02<<4)	///< Data muxed with addr byte 0 and 1

///
#define EBI_SRMODE_ALE1_gc (0x00<<2)	///< Addr byte 0 muxed with 1
#define EBI_SRMODE_ALE2_gc (0x01<<2)	///< Addr byte 0 muxed with 2
#define EBI_SRMODE_ALE12_gc (0x02<<2)	///< Addr byte 0 muxed with 1 and 2
#define EBI_SRMODE_NOALE_gc (0x03<<2)	///< No addr muxing

///
#define EBI_IFMODE_DISABLED_gc (0x00<<0)	///< EBI Disabled
#define EBI_IFMODE_3PORT_gc (0x01<<0)	///< 3-port mode
#define EBI_IFMODE_4PORT_gc (0x02<<0)	///< 4-port mode
#define EBI_IFMODE_2PORT_gc (0x03<<0)	///< 2-port mode

///
#define EBI_SDCOL_8BIT_gc (0x00<<0)	///< 8 column bits
#define EBI_SDCOL_9BIT_gc (0x01<<0)	///< 9 column bits
#define EBI_SDCOL_10BIT_gc (0x02<<0)	///< 10 column bits
#define EBI_SDCOL_11BIT_gc (0x03<<0)	///< 11 column bits

///
#define EBI_MRDLY_0CLK_gc (0x00<<6)	///< 0 cycles
#define EBI_MRDLY_1CLK_gc (0x01<<6)	///< 1 cycle
#define EBI_MRDLY_2CLK_gc (0x02<<6)	///< 2 cycles
#define EBI_MRDLY_3CLK_gc (0x03<<6)	///< 3 cycles

///
#define EBI_ROWCYCDLY_0CLK_gc (0x00<<3)	///< 0 cycles
#define EBI_ROWCYCDLY_1CLK_gc (0x01<<3)	///< 1 cycle
#define EBI_ROWCYCDLY_2CLK_gc (0x02<<3)	///< 2 cycles
#define EBI_ROWCYCDLY_3CLK_gc (0x03<<3)	///< 3 cycles
#define EBI_ROWCYCDLY_4CLK_gc (0x04<<3)	///< 4 cycles
#define EBI_ROWCYCDLY_5CLK_gc (0x05<<3)	///< 5 cycle
#define EBI_ROWCYCDLY_6CLK_gc (0x06<<3)	///< 6 cycles
#define EBI_ROWCYCDLY_7CLK_gc (0x07<<3)	///< 7 cycles

///
#define EBI_RPDLY_0CLK_gc (0x00<<0)	///< 0 cycles
#define EBI_RPDLY_1CLK_gc (0x01<<0)	///< 1 cycle
#define EBI_RPDLY_2CLK_gc (0x02<<0)	///< 2 cycles
#define EBI_RPDLY_3CLK_gc (0x03<<0)	///< 3 cycles
#define EBI_RPDLY_4CLK_gc (0x04<<0)	///< 4 cycles
#define EBI_RPDLY_5CLK_gc (0x05<<0)	///< 5 cycle
#define EBI_RPDLY_6CLK_gc (0x06<<0)	///< 6 cycles
#define EBI_RPDLY_7CLK_gc (0x07<<0)	///< 7 cycles

///
#define EBI_WRDLY_0CLK_gc (0x00<<6)	///< 0 cycles
#define EBI_WRDLY_1CLK_gc (0x01<<6)	///< 1 cycle
#define EBI_WRDLY_2CLK_gc (0x02<<6)	///< 2 cycles
#define EBI_WRDLY_3CLK_gc (0x03<<6)	///< 3 cycles

///
#define EBI_ESRDLY_0CLK_gc (0x00<<3)	///< 0 cycles
#define EBI_ESRDLY_1CLK_gc (0x01<<3)	///< 1 cycle
#define EBI_ESRDLY_2CLK_gc (0x02<<3)	///< 2 cycles
#define EBI_ESRDLY_3CLK_gc (0x03<<3)	///< 3 cycles
#define EBI_ESRDLY_4CLK_gc (0x04<<3)	///< 4 cycles
#define EBI_ESRDLY_5CLK_gc (0x05<<3)	///< 5 cycle
#define EBI_ESRDLY_6CLK_gc (0x06<<3)	///< 6 cycles
#define EBI_ESRDLY_7CLK_gc (0x07<<3)	///< 7 cycles

///
#define EBI_ROWCOLDLY_0CLK_gc (0x00<<0)	///< 0 cycles
#define EBI_ROWCOLDLY_1CLK_gc (0x01<<0)	///< 1 cycle
#define EBI_ROWCOLDLY_2CLK_gc (0x02<<0)	///< 2 cycles
#define EBI_ROWCOLDLY_3CLK_gc (0x03<<0)	///< 3 cycles
#define EBI_ROWCOLDLY_4CLK_gc (0x04<<0)	///< 4 cycles
#define EBI_ROWCOLDLY_5CLK_gc (0x05<<0)	///< 5 cycle
#define EBI_ROWCOLDLY_6CLK_gc (0x06<<0)	///< 6 cycles
#define EBI_ROWCOLDLY_7CLK_gc (0x07<<0)	///< 7 cycles

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup twi Two-Wire Interface
 *  @{
 */

/** @name TWI_MASTER.CTRLA
  * @see TWI_MASTER_INTLVL_enum
  * @{
  */
#define TWI_MASTER_INTLVL_gm 0xC0 ///< Interrupt Level group mask
#define TWI_MASTER_INTLVL_gp 6 ///< Interrupt Level group position
#define TWI_MASTER_INTLVL0_bm (1<<6) ///< Interrupt Level bit 0 mask
#define TWI_MASTER_INTLVL0_bp 6 ///< Interrupt Level bit 0 position
#define TWI_MASTER_INTLVL1_bm (1<<7) ///< Interrupt Level bit 1 mask
#define TWI_MASTER_INTLVL1_bp 7 ///< Interrupt Level bit 1 position
#define TWI_MASTER_RIEN_bm 0x20 ///< Read Interrupt Enable bit mask
#define TWI_MASTER_RIEN_bp 5 ///< Read Interrupt Enable bit position
#define TWI_MASTER_WIEN_bm 0x10 ///< Write Interrupt Enable bit mask
#define TWI_MASTER_WIEN_bp 4 ///< Write Interrupt Enable bit position
#define TWI_MASTER_ENABLE_bm 0x08 ///< Enable TWI Master bit mask
#define TWI_MASTER_ENABLE_bp 3 ///< Enable TWI Master bit position
/** @} */

/** @name TWI_MASTER.CTRLB
  * @see TWI_MASTER_TIMEOUT_enum
  * @{
  */
#define TWI_MASTER_TIMEOUT_gm 0x0C ///< Inactive Bus Timeout group mask
#define TWI_MASTER_TIMEOUT_gp 2 ///< Inactive Bus Timeout group position
#define TWI_MASTER_TIMEOUT0_bm (1<<2) ///< Inactive Bus Timeout bit 0 mask
#define TWI_MASTER_TIMEOUT0_bp 2 ///< Inactive Bus Timeout bit 0 position
#define TWI_MASTER_TIMEOUT1_bm (1<<3) ///< Inactive Bus Timeout bit 1 mask
#define TWI_MASTER_TIMEOUT1_bp 3 ///< Inactive Bus Timeout bit 1 position
#define TWI_MASTER_QCEN_bm 0x02 ///< Quick Command Enable bit mask
#define TWI_MASTER_QCEN_bp 1 ///< Quick Command Enable bit position
#define TWI_MASTER_SMEN_bm 0x01 ///< Smart Mode Enable bit mask
#define TWI_MASTER_SMEN_bp 0 ///< Smart Mode Enable bit position
/** @} */

/** @name TWI_MASTER.CTRLC
  * @see TWI_MASTER_CMD_enum
  * @{
  */
#define TWI_MASTER_ACKACT_bm 0x04 ///< Acknowledge Action bit mask
#define TWI_MASTER_ACKACT_bp 2 ///< Acknowledge Action bit position
#define TWI_MASTER_CMD_gm 0x03 ///< Command group mask
#define TWI_MASTER_CMD_gp 0 ///< Command group position
#define TWI_MASTER_CMD0_bm (1<<0) ///< Command bit 0 mask
#define TWI_MASTER_CMD0_bp 0 ///< Command bit 0 position
#define TWI_MASTER_CMD1_bm (1<<1) ///< Command bit 1 mask
#define TWI_MASTER_CMD1_bp 1 ///< Command bit 1 position
/** @} */

/** @name TWI_MASTER.STATUS
  * @see TWI_MASTER_BUSSTATE_enum
  * @{
  */
#define TWI_MASTER_RIF_bm 0x80 ///< Read Interrupt Flag bit mask
#define TWI_MASTER_RIF_bp 7 ///< Read Interrupt Flag bit position
#define TWI_MASTER_WIF_bm 0x40 ///< Write Interrupt Flag bit mask
#define TWI_MASTER_WIF_bp 6 ///< Write Interrupt Flag bit position
#define TWI_MASTER_CLKHOLD_bm 0x20 ///< Clock Hold bit mask
#define TWI_MASTER_CLKHOLD_bp 5 ///< Clock Hold bit position
#define TWI_MASTER_RXACK_bm 0x10 ///< Received Acknowledge bit mask
#define TWI_MASTER_RXACK_bp 4 ///< Received Acknowledge bit position
#define TWI_MASTER_ARBLOST_bm 0x08 ///< Arbitration Lost bit mask
#define TWI_MASTER_ARBLOST_bp 3 ///< Arbitration Lost bit position
#define TWI_MASTER_BUSERR_bm 0x04 ///< Bus Error bit mask
#define TWI_MASTER_BUSERR_bp 2 ///< Bus Error bit position
#define TWI_MASTER_BUSSTATE_gm 0x03 ///< Bus State group mask
#define TWI_MASTER_BUSSTATE_gp 0 ///< Bus State group position
#define TWI_MASTER_BUSSTATE0_bm (1<<0) ///< Bus State bit 0 mask
#define TWI_MASTER_BUSSTATE0_bp 0 ///< Bus State bit 0 position
#define TWI_MASTER_BUSSTATE1_bm (1<<1) ///< Bus State bit 1 mask
#define TWI_MASTER_BUSSTATE1_bp 1 ///< Bus State bit 1 position
/** @} */

/** @name TWI_SLAVE.CTRLA
  * @see TWI_SLAVE_INTLVL_enum
  * @{
  */
#define TWI_SLAVE_INTLVL_gm 0xC0 ///< Interrupt Level group mask
#define TWI_SLAVE_INTLVL_gp 6 ///< Interrupt Level group position
#define TWI_SLAVE_INTLVL0_bm (1<<6) ///< Interrupt Level bit 0 mask
#define TWI_SLAVE_INTLVL0_bp 6 ///< Interrupt Level bit 0 position
#define TWI_SLAVE_INTLVL1_bm (1<<7) ///< Interrupt Level bit 1 mask
#define TWI_SLAVE_INTLVL1_bp 7 ///< Interrupt Level bit 1 position
#define TWI_SLAVE_DIEN_bm 0x20 ///< Data Interrupt Enable bit mask
#define TWI_SLAVE_DIEN_bp 5 ///< Data Interrupt Enable bit position
#define TWI_SLAVE_APIEN_bm 0x10 ///< Address/Stop Interrupt Enable bit mask
#define TWI_SLAVE_APIEN_bp 4 ///< Address/Stop Interrupt Enable bit position
#define TWI_SLAVE_ENABLE_bm 0x08 ///< Enable TWI Slave bit mask
#define TWI_SLAVE_ENABLE_bp 3 ///< Enable TWI Slave bit position
#define TWI_SLAVE_PIEN_bm 0x04 ///< Stop Interrupt Enable bit mask
#define TWI_SLAVE_PIEN_bp 2 ///< Stop Interrupt Enable bit position
#define TWI_SLAVE_PMEN_bm 0x02 ///< Promiscuous Mode Enable bit mask
#define TWI_SLAVE_PMEN_bp 1 ///< Promiscuous Mode Enable bit position
#define TWI_SLAVE_SMEN_bm 0x01 ///< Smart Mode Enable bit mask
#define TWI_SLAVE_SMEN_bp 0 ///< Smart Mode Enable bit position
/** @} */

/** @name TWI_SLAVE.CTRLB
  * @see TWI_SLAVE_CMD_enum
  * @{
  */
#define TWI_SLAVE_ACKACT_bm 0x04 ///< Acknowledge Action bit mask
#define TWI_SLAVE_ACKACT_bp 2 ///< Acknowledge Action bit position
#define TWI_SLAVE_CMD_gm 0x03 ///< Command group mask
#define TWI_SLAVE_CMD_gp 0 ///< Command group position
#define TWI_SLAVE_CMD0_bm (1<<0) ///< Command bit 0 mask
#define TWI_SLAVE_CMD0_bp 0 ///< Command bit 0 position
#define TWI_SLAVE_CMD1_bm (1<<1) ///< Command bit 1 mask
#define TWI_SLAVE_CMD1_bp 1 ///< Command bit 1 position
/** @} */

/** @name TWI_SLAVE.STATUS
  * @{
  */
#define TWI_SLAVE_DIF_bm 0x80 ///< Data Interrupt Flag bit mask
#define TWI_SLAVE_DIF_bp 7 ///< Data Interrupt Flag bit position
#define TWI_SLAVE_APIF_bm 0x40 ///< Address/Stop Interrupt Flag bit mask
#define TWI_SLAVE_APIF_bp 6 ///< Address/Stop Interrupt Flag bit position
#define TWI_SLAVE_CLKHOLD_bm 0x20 ///< Clock Hold bit mask
#define TWI_SLAVE_CLKHOLD_bp 5 ///< Clock Hold bit position
#define TWI_SLAVE_RXACK_bm 0x10 ///< Received Acknowledge bit mask
#define TWI_SLAVE_RXACK_bp 4 ///< Received Acknowledge bit position
#define TWI_SLAVE_COLL_bm 0x08 ///< Collision bit mask
#define TWI_SLAVE_COLL_bp 3 ///< Collision bit position
#define TWI_SLAVE_BUSERR_bm 0x04 ///< Bus Error bit mask
#define TWI_SLAVE_BUSERR_bp 2 ///< Bus Error bit position
#define TWI_SLAVE_DIR_bm 0x02 ///< Read/Write Direction bit mask
#define TWI_SLAVE_DIR_bp 1 ///< Read/Write Direction bit position
#define TWI_SLAVE_AP_bm 0x01 ///< Slave Address or Stop bit mask
#define TWI_SLAVE_AP_bp 0 ///< Slave Address or Stop bit position
/** @} */

/** @name TWI_SLAVE.ADDRMASK
  * @{
  */
#define TWI_SLAVE_ADDRMASK_gm 0xFE ///< Address Mask group mask
#define TWI_SLAVE_ADDRMASK_gp 1 ///< Address Mask group position
#define TWI_SLAVE_ADDRMASK0_bm (1<<1) ///< Address Mask bit 0 mask
#define TWI_SLAVE_ADDRMASK0_bp 1 ///< Address Mask bit 0 position
#define TWI_SLAVE_ADDRMASK1_bm (1<<2) ///< Address Mask bit 1 mask
#define TWI_SLAVE_ADDRMASK1_bp 2 ///< Address Mask bit 1 position
#define TWI_SLAVE_ADDRMASK2_bm (1<<3) ///< Address Mask bit 2 mask
#define TWI_SLAVE_ADDRMASK2_bp 3 ///< Address Mask bit 2 position
#define TWI_SLAVE_ADDRMASK3_bm (1<<4) ///< Address Mask bit 3 mask
#define TWI_SLAVE_ADDRMASK3_bp 4 ///< Address Mask bit 3 position
#define TWI_SLAVE_ADDRMASK4_bm (1<<5) ///< Address Mask bit 4 mask
#define TWI_SLAVE_ADDRMASK4_bp 5 ///< Address Mask bit 4 position
#define TWI_SLAVE_ADDRMASK5_bm (1<<6) ///< Address Mask bit 5 mask
#define TWI_SLAVE_ADDRMASK5_bp 6 ///< Address Mask bit 5 position
#define TWI_SLAVE_ADDRMASK6_bm (1<<7) ///< Address Mask bit 6 mask
#define TWI_SLAVE_ADDRMASK6_bp 7 ///< Address Mask bit 6 position
#define TWI_SLAVE_ADDREN_bm 0x01 ///< Address Enable bit mask
#define TWI_SLAVE_ADDREN_bp 0 ///< Address Enable bit position
/** @} */

/** @name TWI.CTRL
  * @{
  */
#define TWI_SDAHOLD_bm 0x02 ///< SDA Hold Time Enable bit mask
#define TWI_SDAHOLD_bp 1 ///< SDA Hold Time Enable bit position
#define TWI_EDIEN_bm 0x01 ///< External Driver Interface Enable bit mask
#define TWI_EDIEN_bp 0 ///< External Driver Interface Enable bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Master Interrupt Level

typedef enum TWI_MASTER_INTLVL_enum {
	TWI_MASTER_INTLVL_OFF_gc = (0x00<<6),	///< Interrupt Disabled
	TWI_MASTER_INTLVL_LO_gc = (0x01<<6),	///< Low Level
	TWI_MASTER_INTLVL_MED_gc = (0x02<<6),	///< Medium Level
	TWI_MASTER_INTLVL_HI_gc = (0x03<<6),	///< High Level
} TWI_MASTER_INTLVL_t;

/// Inactive Timeout

typedef enum TWI_MASTER_TIMEOUT_enum {
	TWI_MASTER_TIMEOUT_DISABLED_gc = (0x00<<2),	///< Bus Timeout Disabled
	TWI_MASTER_TIMEOUT_50US_gc = (0x01<<2),	///< 50 Microseconds
	TWI_MASTER_TIMEOUT_100US_gc = (0x02<<2),	///< 100 Microseconds
	TWI_MASTER_TIMEOUT_200US_gc = (0x03<<2),	///< 200 Microseconds
} TWI_MASTER_TIMEOUT_t;

