dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Master Command

typedef enum TWI_MASTER_CMD_enum {
	TWI_MASTER_CMD_NOACT_gc = (0x00<<0),	///< No Action
	TWI_MASTER_CMD_REPSTART_gc = (0x01<<0),	///< Issue Repeated Start Condition
	TWI_MASTER_CMD_RECVTRANS_gc = (0x02<<0),	///< Receive or Transmit Data
	TWI_MASTER_CMD_STOP_gc = (0x03<<0),	///< Issue Stop Condition
} TWI_MASTER_CMD_t;

/// Master Bus State

typedef enum TWI_MASTER_BUSSTATE_enum {
	TWI_MASTER_BUSSTATE_UNKNOWN_gc = (0x00<<0),	///< Unknown Bus State
	TWI_MASTER_BUSSTATE_IDLE_gc = (0x01<<0),	///< Bus is Idle
	TWI_MASTER_BUSSTATE_OWNER_gc = (0x02<<0),	///< This Module Controls The Bus
	TWI_MASTER_BUSSTATE_BUSY_gc = (0x03<<0),	///< The Bus is Busy
} TWI_MASTER_BUSSTATE_t;

/// Slave Interrupt Level

typedef enum TWI_SLAVE_INTLVL_enum {
	TWI_SLAVE_INTLVL_OFF_gc = (0x00<<6),	///< Interrupt Disabled
	TWI_SLAVE_INTLVL_LO_gc = (0x01<<6),	///< Low Level
	TWI_SLAVE_INTLVL_MED_gc = (0x02<<6),	///< Medium Level
	TWI_SLAVE_INTLVL_HI_gc = (0x03<<6),	///< High Level
} TWI_SLAVE_INTLVL_t;

/// Slave Command

typedef enum TWI_SLAVE_CMD_enum {
	TWI_SLAVE_CMD_NOACT_gc = (0x00<<0),	///< No Action
	TWI_SLAVE_CMD_COMPTRANS_gc = (0x02<<0),	///< Used To Complete a Transaction
	TWI_SLAVE_CMD_RESPONSE_gc = (0x03<<0),	///< Used in Response to Address/Data Interrupt
} TWI_SLAVE_CMD_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Master Interrupt Level
#define TWI_MASTER_INTLVL_OFF_gc (0x00<<6)	///< Interrupt Disabled
#define TWI_MASTER_INTLVL_LO_gc (0x01<<6)	///< Low Level
#define TWI_MASTER_INTLVL_MED_gc (0x02<<6)	///< Medium Level
#define TWI_MASTER_INTLVL_HI_gc (0x03<<6)	///< High Level

/// Inactive Timeout
#define TWI_MASTER_TIMEOUT_DISABLED_gc (0x00<<2)	///< Bus Timeout Disabled
#define TWI_MASTER_TIMEOUT_50US_gc (0x01<<2)	///< 50 Microseconds
#define TWI_MASTER_TIMEOUT_100US_gc (0x02<<2)	///< 100 Microseconds
#define TWI_MASTER_TIMEOUT_200US_gc (0x03<<2)	///< 200 Microseconds

/// Master Command
#define TWI_MASTER_CMD_NOACT_gc (0x00<<0)	///< No Action
#define TWI_MASTER_CMD_REPSTART_gc (0x01<<0)	///< Issue Repeated Start Condition
#define TWI_MASTER_CMD_RECVTRANS_gc (0x02<<0)	///< Receive or Transmit Data
#define TWI_MASTER_CMD_STOP_gc (0x03<<0)	///< Issue Stop Condition

/// Master Bus State
#define TWI_MASTER_BUSSTATE_UNKNOWN_gc (0x00<<0)	///< Unknown Bus State
#define TWI_MASTER_BUSSTATE_IDLE_gc (0x01<<0)	///< Bus is Idle
#define TWI_MASTER_BUSSTATE_OWNER_gc (0x02<<0)	///< This Module Controls The Bus
#define TWI_MASTER_BUSSTATE_BUSY_gc (0x03<<0)	///< The Bus is Busy

/// Slave Interrupt Level
#define TWI_SLAVE_INTLVL_OFF_gc (0x00<<6)	///< Interrupt Disabled
#define TWI_SLAVE_INTLVL_LO_gc (0x01<<6)	///< Low Level
#define TWI_SLAVE_INTLVL_MED_gc (0x02<<6)	///< Medium Level
#define TWI_SLAVE_INTLVL_HI_gc (0x03<<6)	///< High Level

/// Slave Command
#define TWI_SLAVE_CMD_NOACT_gc (0x00<<0)	///< No Action
#define TWI_SLAVE_CMD_COMPTRANS_gc (0x02<<0)	///< Used To Complete a Transaction
#define TWI_SLAVE_CMD_RESPONSE_gc (0x03<<0)	///< Used in Response to Address/Data Interrupt

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup port Port Configuration
 *  @{
 */

/** @name PORTCFG.VPCTRLA
  * @see PORTCFG_VP1MAP_enum
  * @see PORTCFG_VP0MAP_enum
  * @{
  */
#define PORTCFG_VP1MAP_gm 0xF0 ///< Virtual Port 1 Mapping group mask
#define PORTCFG_VP1MAP_gp 4 ///< Virtual Port 1 Mapping group position
#define PORTCFG_VP1MAP0_bm (1<<4) ///< Virtual Port 1 Mapping bit 0 mask
#define PORTCFG_VP1MAP0_bp 4 ///< Virtual Port 1 Mapping bit 0 position
#define PORTCFG_VP1MAP1_bm (1<<5) ///< Virtual Port 1 Mapping bit 1 mask
#define PORTCFG_VP1MAP1_bp 5 ///< Virtual Port 1 Mapping bit 1 position
#define PORTCFG_VP1MAP2_bm (1<<6) ///< Virtual Port 1 Mapping bit 2 mask
#define PORTCFG_VP1MAP2_bp 6 ///< Virtual Port 1 Mapping bit 2 position
#define PORTCFG_VP1MAP3_bm (1<<7) ///< Virtual Port 1 Mapping bit 3 mask
#define PORTCFG_VP1MAP3_bp 7 ///< Virtual Port 1 Mapping bit 3 position
#define PORTCFG_VP0MAP_gm 0x0F ///< Virtual Port 0 Mapping group mask
#define PORTCFG_VP0MAP_gp 0 ///< Virtual Port 0 Mapping group position
#define PORTCFG_VP0MAP0_bm (1<<0) ///< Virtual Port 0 Mapping bit 0 mask
#define PORTCFG_VP0MAP0_bp 0 ///< Virtual Port 0 Mapping bit 0 position
#define PORTCFG_VP0MAP1_bm (1<<1) ///< Virtual Port 0 Mapping bit 1 mask
#define PORTCFG_VP0MAP1_bp 1 ///< Virtual Port 0 Mapping bit 1 position
#define PORTCFG_VP0MAP2_bm (1<<2) ///< Virtual Port 0 Mapping bit 2 mask
#define PORTCFG_VP0MAP2_bp 2 ///< Virtual Port 0 Mapping bit 2 position
#define PORTCFG_VP0MAP3_bm (1<<3) ///< Virtual Port 0 Mapping bit 3 mask
#define PORTCFG_VP0MAP3_bp 3 ///< Virtual Port 0 Mapping bit 3 position
/** @} */

/** @name PORTCFG.VPCTRLB
  * @see PORTCFG_VP3MAP_enum
  * @see PORTCFG_VP2MAP_enum
  * @{
  */
#define PORTCFG_VP3MAP_gm 0xF0 ///< Virtual Port 3 Mapping group mask
#define PORTCFG_VP3MAP_gp 4 ///< Virtual Port 3 Mapping group position
#define PORTCFG_VP3MAP0_bm (1<<4) ///< Virtual Port 3 Mapping bit 0 mask
#define PORTCFG_VP3MAP0_bp 4 ///< Virtual Port 3 Mapping bit 0 position
#define PORTCFG_VP3MAP1_bm (1<<5) ///< Virtual Port 3 Mapping bit 1 mask
#define PORTCFG_VP3MAP1_bp 5 ///< Virtual Port 3 Mapping bit 1 position
#define PORTCFG_VP3MAP2_bm (1<<6) ///< Virtual Port 3 Mapping bit 2 mask
#define PORTCFG_VP3MAP2_bp 6 ///< Virtual Port 3 Mapping bit 2 position
#define PORTCFG_VP3MAP3_bm (1<<7) ///< Virtual Port 3 Mapping bit 3 mask
#define PORTCFG_VP3MAP3_bp 7 ///< Virtual Port 3 Mapping bit 3 position
#define PORTCFG_VP2MAP_gm 0x0F ///< Virtual Port 2 Mapping group mask
#define PORTCFG_VP2MAP_gp 0 ///< Virtual Port 2 Mapping group position
#define PORTCFG_VP2MAP0_bm (1<<0) ///< Virtual Port 2 Mapping bit 0 mask
#define PORTCFG_VP2MAP0_bp 0 ///< Virtual Port 2 Mapping bit 0 position
#define PORTCFG_VP2MAP1_bm (1<<1) ///< Virtual Port 2 Mapping bit 1 mask
#define PORTCFG_VP2MAP1_bp 1 ///< Virtual Port 2 Mapping bit 1 position
#define PORTCFG_VP2MAP2_bm (1<<2) ///< Virtual Port 2 Mapping bit 2 mask
#define PORTCFG_VP2MAP2_bp 2 ///< Virtual Port 2 Mapping bit 2 position
#define PORTCFG_VP2MAP3_bm (1<<3) ///< Virtual Port 2 Mapping bit 3 mask
#define PORTCFG_VP2MAP3_bp 3 ///< Virtual Port 2 Mapping bit 3 position
/** @} */

/** @name PORTCFG.CLKEVOUT
  * @see PORTCFG_CLKOUT_enum
  * @see PORTCFG_EVOUT_enum
  * @{
  */
#define PORTCFG_CLKOUT_gm 0x03 ///< Clock Output Port group mask
#define PORTCFG_CLKOUT_gp 0 ///< Clock Output Port group position
#define PORTCFG_CLKOUT0_bm (1<<0) ///< Clock Output Port bit 0 mask
#define PORTCFG_CLKOUT0_bp 0 ///< Clock Output Port bit 0 position
#define PORTCFG_CLKOUT1_bm (1<<1) ///< Clock Output Port bit 1 mask
#define PORTCFG_CLKOUT1_bp 1 ///< Clock Output Port bit 1 position
#define PORTCFG_EVOUT_gm 0x30 ///< Event Output Port group mask
#define PORTCFG_EVOUT_gp 4 ///< Event Output Port group position
#define PORTCFG_EVOUT0_bm (1<<4) ///< Event Output Port bit 0 mask
#define PORTCFG_EVOUT0_bp 4 ///< Event Output Port bit 0 position
#define PORTCFG_EVOUT1_bm (1<<5) ///< Event Output Port bit 1 mask
#define PORTCFG_EVOUT1_bp 5 ///< Event Output Port bit 1 position
/** @} */

