dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name VPORT.INTFLAGS
  * @{
  */
#define VPORT_INT1IF_bm 0x02 ///< Port Interrupt 1 Flag bit mask
#define VPORT_INT1IF_bp 1 ///< Port Interrupt 1 Flag bit position
#define VPORT_INT0IF_bm 0x01 ///< Port Interrupt 0 Flag bit mask
#define VPORT_INT0IF_bp 0 ///< Port Interrupt 0 Flag bit position
/** @} */

/** @name PORT.INTCTRL
  * @see PORT_INT1LVL_enum
  * @see PORT_INT0LVL_enum
  * @{
  */
#define PORT_INT1LVL_gm 0x0C ///< Port Interrupt 1 Level group mask
#define PORT_INT1LVL_gp 2 ///< Port Interrupt 1 Level group position
#define PORT_INT1LVL0_bm (1<<2) ///< Port Interrupt 1 Level bit 0 mask
#define PORT_INT1LVL0_bp 2 ///< Port Interrupt 1 Level bit 0 position
#define PORT_INT1LVL1_bm (1<<3) ///< Port Interrupt 1 Level bit 1 mask
#define PORT_INT1LVL1_bp 3 ///< Port Interrupt 1 Level bit 1 position
#define PORT_INT0LVL_gm 0x03 ///< Port Interrupt 0 Level group mask
#define PORT_INT0LVL_gp 0 ///< Port Interrupt 0 Level group position
#define PORT_INT0LVL0_bm (1<<0) ///< Port Interrupt 0 Level bit 0 mask
#define PORT_INT0LVL0_bp 0 ///< Port Interrupt 0 Level bit 0 position
#define PORT_INT0LVL1_bm (1<<1) ///< Port Interrupt 0 Level bit 1 mask
#define PORT_INT0LVL1_bp 1 ///< Port Interrupt 0 Level bit 1 position
/** @} */

/** @name PORT.INTFLAGS
  * @{
  */
#define PORT_INT1IF_bm 0x02 ///< Port Interrupt 1 Flag bit mask
#define PORT_INT1IF_bp 1 ///< Port Interrupt 1 Flag bit position
#define PORT_INT0IF_bm 0x01 ///< Port Interrupt 0 Flag bit mask
#define PORT_INT0IF_bp 0 ///< Port Interrupt 0 Flag bit position
/** @} */

/** @name PORT.PIN0CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
#define PORT_SRLEN_bm 0x80 ///< Slew Rate Enable bit mask
#define PORT_SRLEN_bp 7 ///< Slew Rate Enable bit position
#define PORT_INVEN_bm 0x40 ///< Inverted I/O Enable bit mask
#define PORT_INVEN_bp 6 ///< Inverted I/O Enable bit position
#define PORT_OPC_gm 0x38 ///< Output/Pull Configuration group mask
#define PORT_OPC_gp 3 ///< Output/Pull Configuration group position
#define PORT_OPC0_bm (1<<3) ///< Output/Pull Configuration bit 0 mask
#define PORT_OPC0_bp 3 ///< Output/Pull Configuration bit 0 position
#define PORT_OPC1_bm (1<<4) ///< Output/Pull Configuration bit 1 mask
#define PORT_OPC1_bp 4 ///< Output/Pull Configuration bit 1 position
#define PORT_OPC2_bm (1<<5) ///< Output/Pull Configuration bit 2 mask
#define PORT_OPC2_bp 5 ///< Output/Pull Configuration bit 2 position
#define PORT_ISC_gm 0x07 ///< Input/Sense Configuration group mask
#define PORT_ISC_gp 0 ///< Input/Sense Configuration group position
#define PORT_ISC0_bm (1<<0) ///< Input/Sense Configuration bit 0 mask
#define PORT_ISC0_bp 0 ///< Input/Sense Configuration bit 0 position
#define PORT_ISC1_bm (1<<1) ///< Input/Sense Configuration bit 1 mask
#define PORT_ISC1_bp 1 ///< Input/Sense Configuration bit 1 position
#define PORT_ISC2_bm (1<<2) ///< Input/Sense Configuration bit 2 mask
#define PORT_ISC2_bp 2 ///< Input/Sense Configuration bit 2 position
/** @} */

/** @name PORT.PIN1CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN2CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN3CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN4CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN5CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN6CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */

/** @name PORT.PIN7CTRL
  * @see PORT_OPC_enum
  * @see PORT_ISC_enum
  * @{
  */
// Masks for SRLEN aready defined
// Masks for INVEN aready defined
// Masks for OPC aready defined
// Masks for ISC aready defined
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Virtual Port 0 Mapping

typedef enum PORTCFG_VP0MAP_enum {
	PORTCFG_VP0MAP_PORTA_gc = (0x00<<0),	///< Mapped To PORTA
	PORTCFG_VP0MAP_PORTB_gc = (0x01<<0),	///< Mapped To PORTB
	PORTCFG_VP0MAP_PORTC_gc = (0x02<<0),	///< Mapped To PORTC
	PORTCFG_VP0MAP_PORTD_gc = (0x03<<0),	///< Mapped To PORTD
	PORTCFG_VP0MAP_PORTE_gc = (0x04<<0),	///< Mapped To PORTE
	PORTCFG_VP0MAP_PORTF_gc = (0x05<<0),	///< Mapped To PORTF
	PORTCFG_VP0MAP_PORTG_gc = (0x06<<0),	///< Mapped To PORTG
	PORTCFG_VP0MAP_PORTH_gc = (0x07<<0),	///< Mapped To PORTH
	PORTCFG_VP0MAP_PORTJ_gc = (0x08<<0),	///< Mapped To PORTJ
	PORTCFG_VP0MAP_PORTK_gc = (0x09<<0),	///< Mapped To PORTK
	PORTCFG_VP0MAP_PORTL_gc = (0x0A<<0),	///< Mapped To PORTL
	PORTCFG_VP0MAP_PORTM_gc = (0x0B<<0),	///< Mapped To PORTM
	PORTCFG_VP0MAP_PORTN_gc = (0x0C<<0),	///< Mapped To PORTN
	PORTCFG_VP0MAP_PORTP_gc = (0x0D<<0),	///< Mapped To PORTP
	PORTCFG_VP0MAP_PORTQ_gc = (0x0E<<0),	///< Mapped To PORTQ
	PORTCFG_VP0MAP_PORTR_gc = (0x0F<<0),	///< Mapped To PORTR
} PORTCFG_VP0MAP_t;

/// Virtual Port 1 Mapping

typedef enum PORTCFG_VP1MAP_enum {
	PORTCFG_VP1MAP_PORTA_gc = (0x00<<4),	///< Mapped To PORTA
	PORTCFG_VP1MAP_PORTB_gc = (0x01<<4),	///< Mapped To PORTB
	PORTCFG_VP1MAP_PORTC_gc = (0x02<<4),	///< Mapped To PORTC
	PORTCFG_VP1MAP_PORTD_gc = (0x03<<4),	///< Mapped To PORTD
	PORTCFG_VP1MAP_PORTE_gc = (0x04<<4),	///< Mapped To PORTE
	PORTCFG_VP1MAP_PORTF_gc = (0x05<<4),	///< Mapped To PORTF
	PORTCFG_VP1MAP_PORTG_gc = (0x06<<4),	///< Mapped To PORTG
	PORTCFG_VP1MAP_PORTH_gc = (0x07<<4),	///< Mapped To PORTH
	PORTCFG_VP1MAP_PORTJ_gc = (0x08<<4),	///< Mapped To PORTJ
	PORTCFG_VP1MAP_PORTK_gc = (0x09<<4),	///< Mapped To PORTK
	PORTCFG_VP1MAP_PORTL_gc = (0x0A<<4),	///< Mapped To PORTL
	PORTCFG_VP1MAP_PORTM_gc = (0x0B<<4),	///< Mapped To PORTM
	PORTCFG_VP1MAP_PORTN_gc = (0x0C<<4),	///< Mapped To PORTN
	PORTCFG_VP1MAP_PORTP_gc = (0x0D<<4),	///< Mapped To PORTP
	PORTCFG_VP1MAP_PORTQ_gc = (0x0E<<4),	///< Mapped To PORTQ
	PORTCFG_VP1MAP_PORTR_gc = (0x0F<<4),	///< Mapped To PORTR
} PORTCFG_VP1MAP_t;

/// Virtual Port 2 Mapping

