dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
typedef enum PORTCFG_VP2MAP_enum {
	PORTCFG_VP2MAP_PORTA_gc = (0x00<<0),	///< Mapped To PORTA
	PORTCFG_VP2MAP_PORTB_gc = (0x01<<0),	///< Mapped To PORTB
	PORTCFG_VP2MAP_PORTC_gc = (0x02<<0),	///< Mapped To PORTC
	PORTCFG_VP2MAP_PORTD_gc = (0x03<<0),	///< Mapped To PORTD
	PORTCFG_VP2MAP_PORTE_gc = (0x04<<0),	///< Mapped To PORTE
	PORTCFG_VP2MAP_PORTF_gc = (0x05<<0),	///< Mapped To PORTF
	PORTCFG_VP2MAP_PORTG_gc = (0x06<<0),	///< Mapped To PORTG
	PORTCFG_VP2MAP_PORTH_gc = (0x07<<0),	///< Mapped To PORTH
	PORTCFG_VP2MAP_PORTJ_gc = (0x08<<0),	///< Mapped To PORTJ
	PORTCFG_VP2MAP_PORTK_gc = (0x09<<0),	///< Mapped To PORTK
	PORTCFG_VP2MAP_PORTL_gc = (0x0A<<0),	///< Mapped To PORTL
	PORTCFG_VP2MAP_PORTM_gc = (0x0B<<0),	///< Mapped To PORTM
	PORTCFG_VP2MAP_PORTN_gc = (0x0C<<0),	///< Mapped To PORTN
	PORTCFG_VP2MAP_PORTP_gc = (0x0D<<0),	///< Mapped To PORTP
	PORTCFG_VP2MAP_PORTQ_gc = (0x0E<<0),	///< Mapped To PORTQ
	PORTCFG_VP2MAP_PORTR_gc = (0x0F<<0),	///< Mapped To PORTR
} PORTCFG_VP2MAP_t;

/// Virtual Port 3 Mapping

typedef enum PORTCFG_VP3MAP_enum {
	PORTCFG_VP3MAP_PORTA_gc = (0x00<<4),	///< Mapped To PORTA
	PORTCFG_VP3MAP_PORTB_gc = (0x01<<4),	///< Mapped To PORTB
	PORTCFG_VP3MAP_PORTC_gc = (0x02<<4),	///< Mapped To PORTC
	PORTCFG_VP3MAP_PORTD_gc = (0x03<<4),	///< Mapped To PORTD
	PORTCFG_VP3MAP_PORTE_gc = (0x04<<4),	///< Mapped To PORTE
	PORTCFG_VP3MAP_PORTF_gc = (0x05<<4),	///< Mapped To PORTF
	PORTCFG_VP3MAP_PORTG_gc = (0x06<<4),	///< Mapped To PORTG
	PORTCFG_VP3MAP_PORTH_gc = (0x07<<4),	///< Mapped To PORTH
	PORTCFG_VP3MAP_PORTJ_gc = (0x08<<4),	///< Mapped To PORTJ
	PORTCFG_VP3MAP_PORTK_gc = (0x09<<4),	///< Mapped To PORTK
	PORTCFG_VP3MAP_PORTL_gc = (0x0A<<4),	///< Mapped To PORTL
	PORTCFG_VP3MAP_PORTM_gc = (0x0B<<4),	///< Mapped To PORTM
	PORTCFG_VP3MAP_PORTN_gc = (0x0C<<4),	///< Mapped To PORTN
	PORTCFG_VP3MAP_PORTP_gc = (0x0D<<4),	///< Mapped To PORTP
	PORTCFG_VP3MAP_PORTQ_gc = (0x0E<<4),	///< Mapped To PORTQ
	PORTCFG_VP3MAP_PORTR_gc = (0x0F<<4),	///< Mapped To PORTR
} PORTCFG_VP3MAP_t;

/// Clock Output Port

typedef enum PORTCFG_CLKOUT_enum {
	PORTCFG_CLKOUT_OFF_gc = (0x00<<0),	///< Clock Output Disabled
	PORTCFG_CLKOUT_PC7_gc = (0x01<<0),	///< Clock Output on Port C pin 7
	PORTCFG_CLKOUT_PD7_gc = (0x02<<0),	///< Clock Output on Port D pin 7
	PORTCFG_CLKOUT_PE7_gc = (0x03<<0),	///< Clock Output on Port E pin 7
} PORTCFG_CLKOUT_t;

/// Event Output Port

typedef enum PORTCFG_EVOUT_enum {
	PORTCFG_EVOUT_OFF_gc = (0x00<<4),	///< Event Output Disabled
	PORTCFG_EVOUT_PC7_gc = (0x01<<4),	///< Event Channel 7 Output on Port C pin 7
	PORTCFG_EVOUT_PD7_gc = (0x02<<4),	///< Event Channel 7 Output on Port D pin 7
	PORTCFG_EVOUT_PE7_gc = (0x03<<4),	///< Event Channel 7 Output on Port E pin 7
} PORTCFG_EVOUT_t;

/// Port Interrupt 0 Level

typedef enum PORT_INT0LVL_enum {
	PORT_INT0LVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	PORT_INT0LVL_LO_gc = (0x01<<0),	///< Low Level
	PORT_INT0LVL_MED_gc = (0x02<<0),	///< Medium Level
	PORT_INT0LVL_HI_gc = (0x03<<0),	///< High Level
} PORT_INT0LVL_t;

/// Port Interrupt 1 Level

typedef enum PORT_INT1LVL_enum {
	PORT_INT1LVL_OFF_gc = (0x00<<2),	///< Interrupt Disabled
	PORT_INT1LVL_LO_gc = (0x01<<2),	///< Low Level
	PORT_INT1LVL_MED_gc = (0x02<<2),	///< Medium Level
	PORT_INT1LVL_HI_gc = (0x03<<2),	///< High Level
} PORT_INT1LVL_t;

/// Output/Pull Configuration

typedef enum PORT_OPC_enum {
	PORT_OPC_TOTEM_gc = (0x00<<3),	///< Totempole
	PORT_OPC_BUSKEEPER_gc = (0x01<<3),	///< Totempole w/ Bus keeper on Input and Output
	PORT_OPC_PULLDOWN_gc = (0x02<<3),	///< Totempole w/ Pull-down on Input
	PORT_OPC_PULLUP_gc = (0x03<<3),	///< Totempole w/ Pull-up on Input
	PORT_OPC_WIREDOR_gc = (0x04<<3),	///< Wired OR
	PORT_OPC_WIREDAND_gc = (0x05<<3),	///< Wired AND
	PORT_OPC_WIREDORPULL_gc = (0x06<<3),	///< Wired OR w/ Pull-down
	PORT_OPC_WIREDANDPULL_gc = (0x07<<3),	///< Wired AND w/ Pull-up
} PORT_OPC_t;

/// Input/Sense Configuration

typedef enum PORT_ISC_enum {
	PORT_ISC_BOTHEDGES_gc = (0x00<<0),	///< Sense Both Edges
	PORT_ISC_RISING_gc = (0x01<<0),	///< Sense Rising Edge
	PORT_ISC_FALLING_gc = (0x02<<0),	///< Sense Falling Edge
	PORT_ISC_LEVEL_gc = (0x03<<0),	///< Sense Level (Transparent For Events)
	PORT_ISC_INPUT_DISABLE_gc = (0x07<<0),	///< Disable Digital Input Buffer
} PORT_ISC_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Virtual Port 0 Mapping
#define PORTCFG_VP0MAP_PORTA_gc (0x00<<0)	///< Mapped To PORTA
#define PORTCFG_VP0MAP_PORTB_gc (0x01<<0)	///< Mapped To PORTB
#define PORTCFG_VP0MAP_PORTC_gc (0x02<<0)	///< Mapped To PORTC
#define PORTCFG_VP0MAP_PORTD_gc (0x03<<0)	///< Mapped To PORTD
#define PORTCFG_VP0MAP_PORTE_gc (0x04<<0)	///< Mapped To PORTE
#define PORTCFG_VP0MAP_PORTF_gc (0x05<<0)	///< Mapped To PORTF
#define PORTCFG_VP0MAP_PORTG_gc (0x06<<0)	///< Mapped To PORTG
#define PORTCFG_VP0MAP_PORTH_gc (0x07<<0)	///< Mapped To PORTH
#define PORTCFG_VP0MAP_PORTJ_gc (0x08<<0)	///< Mapped To PORTJ
#define PORTCFG_VP0MAP_PORTK_gc (0x09<<0)	///< Mapped To PORTK
#define PORTCFG_VP0MAP_PORTL_gc (0x0A<<0)	///< Mapped To PORTL
#define PORTCFG_VP0MAP_PORTM_gc (0x0B<<0)	///< Mapped To PORTM
#define PORTCFG_VP0MAP_PORTN_gc (0x0C<<0)	///< Mapped To PORTN
#define PORTCFG_VP0MAP_PORTP_gc (0x0D<<0)	///< Mapped To PORTP
#define PORTCFG_VP0MAP_PORTQ_gc (0x0E<<0)	///< Mapped To PORTQ
#define PORTCFG_VP0MAP_PORTR_gc (0x0F<<0)	///< Mapped To PORTR

/// Virtual Port 1 Mapping
#define PORTCFG_VP1MAP_PORTA_gc (0x00<<4)	///< Mapped To PORTA
#define PORTCFG_VP1MAP_PORTB_gc (0x01<<4)	///< Mapped To PORTB
#define PORTCFG_VP1MAP_PORTC_gc (0x02<<4)	///< Mapped To PORTC
#define PORTCFG_VP1MAP_PORTD_gc (0x03<<4)	///< Mapped To PORTD
#define PORTCFG_VP1MAP_PORTE_gc (0x04<<4)	///< Mapped To PORTE
#define PORTCFG_VP1MAP_PORTF_gc (0x05<<4)	///< Mapped To PORTF
#define PORTCFG_VP1MAP_PORTG_gc (0x06<<4)	///< Mapped To PORTG
#define PORTCFG_VP1MAP_PORTH_gc (0x07<<4)	///< Mapped To PORTH
#define PORTCFG_VP1MAP_PORTJ_gc (0x08<<4)	///< Mapped To PORTJ
#define PORTCFG_VP1MAP_PORTK_gc (0x09<<4)	///< Mapped To PORTK
#define PORTCFG_VP1MAP_PORTL_gc (0x0A<<4)	///< Mapped To PORTL
#define PORTCFG_VP1MAP_PORTM_gc (0x0B<<4)	///< Mapped To PORTM
#define PORTCFG_VP1MAP_PORTN_gc (0x0C<<4)	///< Mapped To PORTN
#define PORTCFG_VP1MAP_PORTP_gc (0x0D<<4)	///< Mapped To PORTP
#define PORTCFG_VP1MAP_PORTQ_gc (0x0E<<4)	///< Mapped To PORTQ
#define PORTCFG_VP1MAP_PORTR_gc (0x0F<<4)	///< Mapped To PORTR

/// Virtual Port 2 Mapping
#define PORTCFG_VP2MAP_PORTA_gc (0x00<<0)	///< Mapped To PORTA
#define PORTCFG_VP2MAP_PORTB_gc (0x01<<0)	///< Mapped To PORTB
#define PORTCFG_VP2MAP_PORTC_gc (0x02<<0)	///< Mapped To PORTC
#define PORTCFG_VP2MAP_PORTD_gc (0x03<<0)	///< Mapped To PORTD
#define PORTCFG_VP2MAP_PORTE_gc (0x04<<0)	///< Mapped To PORTE
#define PORTCFG_VP2MAP_PORTF_gc (0x05<<0)	///< Mapped To PORTF
#define PORTCFG_VP2MAP_PORTG_gc (0x06<<0)	///< Mapped To PORTG
#define PORTCFG_VP2MAP_PORTH_gc (0x07<<0)	///< Mapped To PORTH
#define PORTCFG_VP2MAP_PORTJ_gc (0x08<<0)	///< Mapped To PORTJ
#define PORTCFG_VP2MAP_PORTK_gc (0x09<<0)	///< Mapped To PORTK
#define PORTCFG_VP2MAP_PORTL_gc (0x0A<<0)	///< Mapped To PORTL
#define PORTCFG_VP2MAP_PORTM_gc (0x0B<<0)	///< Mapped To PORTM
#define PORTCFG_VP2MAP_PORTN_gc (0x0C<<0)	///< Mapped To PORTN
#define PORTCFG_VP2MAP_PORTP_gc (0x0D<<0)	///< Mapped To PORTP
#define PORTCFG_VP2MAP_PORTQ_gc (0x0E<<0)	///< Mapped To PORTQ
#define PORTCFG_VP2MAP_PORTR_gc (0x0F<<0)	///< Mapped To PORTR

