dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Virtual Port 3 Mapping
#define PORTCFG_VP3MAP_PORTA_gc (0x00<<4)	///< Mapped To PORTA
#define PORTCFG_VP3MAP_PORTB_gc (0x01<<4)	///< Mapped To PORTB
#define PORTCFG_VP3MAP_PORTC_gc (0x02<<4)	///< Mapped To PORTC
#define PORTCFG_VP3MAP_PORTD_gc (0x03<<4)	///< Mapped To PORTD
#define PORTCFG_VP3MAP_PORTE_gc (0x04<<4)	///< Mapped To PORTE
#define PORTCFG_VP3MAP_PORTF_gc (0x05<<4)	///< Mapped To PORTF
#define PORTCFG_VP3MAP_PORTG_gc (0x06<<4)	///< Mapped To PORTG
#define PORTCFG_VP3MAP_PORTH_gc (0x07<<4)	///< Mapped To PORTH
#define PORTCFG_VP3MAP_PORTJ_gc (0x08<<4)	///< Mapped To PORTJ
#define PORTCFG_VP3MAP_PORTK_gc (0x09<<4)	///< Mapped To PORTK
#define PORTCFG_VP3MAP_PORTL_gc (0x0A<<4)	///< Mapped To PORTL
#define PORTCFG_VP3MAP_PORTM_gc (0x0B<<4)	///< Mapped To PORTM
#define PORTCFG_VP3MAP_PORTN_gc (0x0C<<4)	///< Mapped To PORTN
#define PORTCFG_VP3MAP_PORTP_gc (0x0D<<4)	///< Mapped To PORTP
#define PORTCFG_VP3MAP_PORTQ_gc (0x0E<<4)	///< Mapped To PORTQ
#define PORTCFG_VP3MAP_PORTR_gc (0x0F<<4)	///< Mapped To PORTR

/// Clock Output Port
#define PORTCFG_CLKOUT_OFF_gc (0x00<<0)	///< Clock Output Disabled
#define PORTCFG_CLKOUT_PC7_gc (0x01<<0)	///< Clock Output on Port C pin 7
#define PORTCFG_CLKOUT_PD7_gc (0x02<<0)	///< Clock Output on Port D pin 7
#define PORTCFG_CLKOUT_PE7_gc (0x03<<0)	///< Clock Output on Port E pin 7

/// Event Output Port
#define PORTCFG_EVOUT_OFF_gc (0x00<<4)	///< Event Output Disabled
#define PORTCFG_EVOUT_PC7_gc (0x01<<4)	///< Event Channel 7 Output on Port C pin 7
#define PORTCFG_EVOUT_PD7_gc (0x02<<4)	///< Event Channel 7 Output on Port D pin 7
#define PORTCFG_EVOUT_PE7_gc (0x03<<4)	///< Event Channel 7 Output on Port E pin 7

/// Port Interrupt 0 Level
#define PORT_INT0LVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define PORT_INT0LVL_LO_gc (0x01<<0)	///< Low Level
#define PORT_INT0LVL_MED_gc (0x02<<0)	///< Medium Level
#define PORT_INT0LVL_HI_gc (0x03<<0)	///< High Level

/// Port Interrupt 1 Level
#define PORT_INT1LVL_OFF_gc (0x00<<2)	///< Interrupt Disabled
#define PORT_INT1LVL_LO_gc (0x01<<2)	///< Low Level
#define PORT_INT1LVL_MED_gc (0x02<<2)	///< Medium Level
#define PORT_INT1LVL_HI_gc (0x03<<2)	///< High Level

/// Output/Pull Configuration
#define PORT_OPC_TOTEM_gc (0x00<<3)	///< Totempole
#define PORT_OPC_BUSKEEPER_gc (0x01<<3)	///< Totempole w/ Bus keeper on Input and Output
#define PORT_OPC_PULLDOWN_gc (0x02<<3)	///< Totempole w/ Pull-down on Input
#define PORT_OPC_PULLUP_gc (0x03<<3)	///< Totempole w/ Pull-up on Input
#define PORT_OPC_WIREDOR_gc (0x04<<3)	///< Wired OR
#define PORT_OPC_WIREDAND_gc (0x05<<3)	///< Wired AND
#define PORT_OPC_WIREDORPULL_gc (0x06<<3)	///< Wired OR w/ Pull-down
#define PORT_OPC_WIREDANDPULL_gc (0x07<<3)	///< Wired AND w/ Pull-up

/// Input/Sense Configuration
#define PORT_ISC_BOTHEDGES_gc (0x00<<0)	///< Sense Both Edges
#define PORT_ISC_RISING_gc (0x01<<0)	///< Sense Rising Edge
#define PORT_ISC_FALLING_gc (0x02<<0)	///< Sense Falling Edge
#define PORT_ISC_LEVEL_gc (0x03<<0)	///< Sense Level (Transparent For Events)
#define PORT_ISC_INPUT_DISABLE_gc (0x07<<0)	///< Disable Digital Input Buffer

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup tc 16-bit Timer/Counter With PWM
 *  @{
 */

/** @name TC0.CTRLA
  * @see TC_CLKSEL_enum
  * @{
  */
#define TC0_CLKSEL_gm 0x0F ///< Clock Selection group mask
#define TC0_CLKSEL_gp 0 ///< Clock Selection group position
#define TC0_CLKSEL0_bm (1<<0) ///< Clock Selection bit 0 mask
#define TC0_CLKSEL0_bp 0 ///< Clock Selection bit 0 position
#define TC0_CLKSEL1_bm (1<<1) ///< Clock Selection bit 1 mask
#define TC0_CLKSEL1_bp 1 ///< Clock Selection bit 1 position
#define TC0_CLKSEL2_bm (1<<2) ///< Clock Selection bit 2 mask
#define TC0_CLKSEL2_bp 2 ///< Clock Selection bit 2 position
#define TC0_CLKSEL3_bm (1<<3) ///< Clock Selection bit 3 mask
#define TC0_CLKSEL3_bp 3 ///< Clock Selection bit 3 position
/** @} */

/** @name TC0.CTRLB
  * @see TC_WGMODE_enum
  * @{
  */
#define TC0_CCDEN_bm 0x80 ///< Compare or Capture D Enable bit mask
#define TC0_CCDEN_bp 7 ///< Compare or Capture D Enable bit position
#define TC0_CCCEN_bm 0x40 ///< Compare or Capture C Enable bit mask
#define TC0_CCCEN_bp 6 ///< Compare or Capture C Enable bit position
#define TC0_CCBEN_bm 0x20 ///< Compare or Capture B Enable bit mask
#define TC0_CCBEN_bp 5 ///< Compare or Capture B Enable bit position
#define TC0_CCAEN_bm 0x10 ///< Compare or Capture A Enable bit mask
#define TC0_CCAEN_bp 4 ///< Compare or Capture A Enable bit position
#define TC0_WGMODE_gm 0x07 ///< Waveform generation mode group mask
#define TC0_WGMODE_gp 0 ///< Waveform generation mode group position
#define TC0_WGMODE0_bm (1<<0) ///< Waveform generation mode bit 0 mask
#define TC0_WGMODE0_bp 0 ///< Waveform generation mode bit 0 position
#define TC0_WGMODE1_bm (1<<1) ///< Waveform generation mode bit 1 mask
#define TC0_WGMODE1_bp 1 ///< Waveform generation mode bit 1 position
#define TC0_WGMODE2_bm (1<<2) ///< Waveform generation mode bit 2 mask
#define TC0_WGMODE2_bp 2 ///< Waveform generation mode bit 2 position
/** @} */

/** @name TC0.CTRLC
  * @{
  */
#define TC0_CMPD_bm 0x08 ///< Compare D Output Value bit mask
#define TC0_CMPD_bp 3 ///< Compare D Output Value bit position
#define TC0_CMPC_bm 0x04 ///< Compare C Output Value bit mask
#define TC0_CMPC_bp 2 ///< Compare C Output Value bit position
#define TC0_CMPB_bm 0x02 ///< Compare B Output Value bit mask
#define TC0_CMPB_bp 1 ///< Compare B Output Value bit position
#define TC0_CMPA_bm 0x01 ///< Compare A Output Value bit mask
#define TC0_CMPA_bp 0 ///< Compare A Output Value bit position
/** @} */

/** @name TC0.CTRLD
  * @see TC_EVACT_enum
  * @see TC_EVSEL_enum
  * @{
  */
#define TC0_EVACT_gm 0xE0 ///< Event Action group mask
#define TC0_EVACT_gp 5 ///< Event Action group position
#define TC0_EVACT0_bm (1<<5) ///< Event Action bit 0 mask
#define TC0_EVACT0_bp 5 ///< Event Action bit 0 position
#define TC0_EVACT1_bm (1<<6) ///< Event Action bit 1 mask
#define TC0_EVACT1_bp 6 ///< Event Action bit 1 position
#define TC0_EVACT2_bm (1<<7) ///< Event Action bit 2 mask
#define TC0_EVACT2_bp 7 ///< Event Action bit 2 position
#define TC0_EVDLY_bm 0x10 ///< Event Delay bit mask
#define TC0_EVDLY_bp 4 ///< Event Delay bit position
#define TC0_EVSEL_gm 0x0F ///< Event Source Select group mask
#define TC0_EVSEL_gp 0 ///< Event Source Select group position
#define TC0_EVSEL0_bm (1<<0) ///< Event Source Select bit 0 mask
#define TC0_EVSEL0_bp 0 ///< Event Source Select bit 0 position
#define TC0_EVSEL1_bm (1<<1) ///< Event Source Select bit 1 mask
#define TC0_EVSEL1_bp 1 ///< Event Source Select bit 1 position
#define TC0_EVSEL2_bm (1<<2) ///< Event Source Select bit 2 mask
#define TC0_EVSEL2_bp 2 ///< Event Source Select bit 2 position
#define TC0_EVSEL3_bm (1<<3) ///< Event Source Select bit 3 mask
#define TC0_EVSEL3_bp 3 ///< Event Source Select bit 3 position
/** @} */

/** @name TC0.CTRLE
  * @{
  */
#define TC0_BYTEM_bm 0x01 ///< Byte Mode bit mask
#define TC0_BYTEM_bp 0 ///< Byte Mode bit position
/** @} */

/** @name TC0.INTCTRLA
  * @see TC_ERRINTLVL_enum
  * @see TC_OVFINTLVL_enum
  * @{
  */
#define TC0_ERRINTLVL_gm 0x0C ///< Error Interrupt Level group mask
#define TC0_ERRINTLVL_gp 2 ///< Error Interrupt Level group position
#define TC0_ERRINTLVL0_bm (1<<2) ///< Error Interrupt Level bit 0 mask
#define TC0_ERRINTLVL0_bp 2 ///< Error Interrupt Level bit 0 position
#define TC0_ERRINTLVL1_bm (1<<3) ///< Error Interrupt Level bit 1 mask
#define TC0_ERRINTLVL1_bp 3 ///< Error Interrupt Level bit 1 position
#define TC0_OVFINTLVL_gm 0x03 ///< Overflow interrupt level group mask
#define TC0_OVFINTLVL_gp 0 ///< Overflow interrupt level group position
#define TC0_OVFINTLVL0_bm (1<<0) ///< Overflow interrupt level bit 0 mask
#define TC0_OVFINTLVL0_bp 0 ///< Overflow interrupt level bit 0 position
#define TC0_OVFINTLVL1_bm (1<<1) ///< Overflow interrupt level bit 1 mask
#define TC0_OVFINTLVL1_bp 1 ///< Overflow interrupt level bit 1 position
/** @} */

/** @name TC0.INTCTRLB
  * @see TC_CCDINTLVL_enum
  * @see TC_CCCINTLVL_enum
  * @see TC_CCBINTLVL_enum
  * @see TC_CCAINTLVL_enum
  * @{
  */
#define TC0_CCDINTLVL_gm 0xC0 ///< Compare or Capture D Interrupt Level group mask
#define TC0_CCDINTLVL_gp 6 ///< Compare or Capture D Interrupt Level group position
#define TC0_CCDINTLVL0_bm (1<<6) ///< Compare or Capture D Interrupt Level bit 0 mask
#define TC0_CCDINTLVL0_bp 6 ///< Compare or Capture D Interrupt Level bit 0 position
#define TC0_CCDINTLVL1_bm (1<<7) ///< Compare or Capture D Interrupt Level bit 1 mask
#define TC0_CCDINTLVL1_bp 7 ///< Compare or Capture D Interrupt Level bit 1 position
#define TC0_CCCINTLVL_gm 0x30 ///< Compare or Capture C Interrupt Level group mask
#define TC0_CCCINTLVL_gp 4 ///< Compare or Capture C Interrupt Level group position
#define TC0_CCCINTLVL0_bm (1<<4) ///< Compare or Capture C Interrupt Level bit 0 mask
#define TC0_CCCINTLVL0_bp 4 ///< Compare or Capture C Interrupt Level bit 0 position
#define TC0_CCCINTLVL1_bm (1<<5) ///< Compare or Capture C Interrupt Level bit 1 mask
#define TC0_CCCINTLVL1_bp 5 ///< Compare or Capture C Interrupt Level bit 1 position
#define TC0_CCBINTLVL_gm 0x0C ///< Compare or Capture B Interrupt Level group mask
#define TC0_CCBINTLVL_gp 2 ///< Compare or Capture B Interrupt Level group position
#define TC0_CCBINTLVL0_bm (1<<2) ///< Compare or Capture B Interrupt Level bit 0 mask
#define TC0_CCBINTLVL0_bp 2 ///< Compare or Capture B Interrupt Level bit 0 position
#define TC0_CCBINTLVL1_bm (1<<3) ///< Compare or Capture B Interrupt Level bit 1 mask
#define TC0_CCBINTLVL1_bp 3 ///< Compare or Capture B Interrupt Level bit 1 position
#define TC0_CCAINTLVL_gm 0x03 ///< Compare or Capture A Interrupt Level group mask
#define TC0_CCAINTLVL_gp 0 ///< Compare or Capture A Interrupt Level group position
#define TC0_CCAINTLVL0_bm (1<<0) ///< Compare or Capture A Interrupt Level bit 0 mask
#define TC0_CCAINTLVL0_bp 0 ///< Compare or Capture A Interrupt Level bit 0 position
#define TC0_CCAINTLVL1_bm (1<<1) ///< Compare or Capture A Interrupt Level bit 1 mask
#define TC0_CCAINTLVL1_bp 1 ///< Compare or Capture A Interrupt Level bit 1 position
/** @} */

/** @name TC0.CTRLFCLR
  * @{
  */
#define TC0_CMD_gm 0x0C ///< Command group mask
#define TC0_CMD_gp 2 ///< Command group position
#define TC0_CMD0_bm (1<<2) ///< Command bit 0 mask
#define TC0_CMD0_bp 2 ///< Command bit 0 position
#define TC0_CMD1_bm (1<<3) ///< Command bit 1 mask
#define TC0_CMD1_bp 3 ///< Command bit 1 position
#define TC0_LUPD_bm 0x02 ///< Lock Update bit mask
#define TC0_LUPD_bp 1 ///< Lock Update bit position
#define TC0_DIR_bm 0x01 ///< Direction bit mask
#define TC0_DIR_bp 0 ///< Direction bit position
/** @} */

/** @name TC0.CTRLFSET
  * @see TC_CMD_enum
  * @{
  */
// Masks for CMD aready defined
// Masks for LUPD aready defined
// Masks for DIR aready defined
/** @} */

/** @name TC0.CTRLGCLR
  * @{
  */
#define TC0_CCDBV_bm 0x10 ///< Compare or Capture D Buffer Valid bit mask
#define TC0_CCDBV_bp 4 ///< Compare or Capture D Buffer Valid bit position
#define TC0_CCCBV_bm 0x08 ///< Compare or Capture C Buffer Valid bit mask
#define TC0_CCCBV_bp 3 ///< Compare or Capture C Buffer Valid bit position
#define TC0_CCBBV_bm 0x04 ///< Compare or Capture B Buffer Valid bit mask
#define TC0_CCBBV_bp 2 ///< Compare or Capture B Buffer Valid bit position
#define TC0_CCABV_bm 0x02 ///< Compare or Capture A Buffer Valid bit mask
#define TC0_CCABV_bp 1 ///< Compare or Capture A Buffer Valid bit position
#define TC0_PERBV_bm 0x01 ///< Period Buffer Valid bit mask
#define TC0_PERBV_bp 0 ///< Period Buffer Valid bit position
/** @} */

/** @name TC0.CTRLGSET
  * @{
  */
// Masks for CCDBV aready defined
// Masks for CCCBV aready defined
// Masks for CCBBV aready defined
// Masks for CCABV aready defined
// Masks for PERBV aready defined
/** @} */

/** @name TC0.INTFLAGS
  * @{
  */
#define TC0_CCDIF_bm 0x80 ///< Compare or Capture D Interrupt Flag bit mask
#define TC0_CCDIF_bp 7 ///< Compare or Capture D Interrupt Flag bit position
#define TC0_CCCIF_bm 0x40 ///< Compare or Capture C Interrupt Flag bit mask
#define TC0_CCCIF_bp 6 ///< Compare or Capture C Interrupt Flag bit position
#define TC0_CCBIF_bm 0x20 ///< Compare or Capture B Interrupt Flag bit mask
#define TC0_CCBIF_bp 5 ///< Compare or Capture B Interrupt Flag bit position
#define TC0_CCAIF_bm 0x10 ///< Compare or Capture A Interrupt Flag bit mask
#define TC0_CCAIF_bp 4 ///< Compare or Capture A Interrupt Flag bit position
#define TC0_ERRIF_bm 0x02 ///< Error Interrupt Flag bit mask
#define TC0_ERRIF_bp 1 ///< Error Interrupt Flag bit position
#define TC0_OVFIF_bm 0x01 ///< Overflow Interrupt Flag bit mask
#define TC0_OVFIF_bp 0 ///< Overflow Interrupt Flag bit position
/** @} */

/** @name TC1.CTRLA
  * @see TC_CLKSEL_enum
  * @{
  */
#define TC1_CLKSEL_gm 0x0F ///< Clock Selection group mask
#define TC1_CLKSEL_gp 0 ///< Clock Selection group position
#define TC1_CLKSEL0_bm (1<<0) ///< Clock Selection bit 0 mask
#define TC1_CLKSEL0_bp 0 ///< Clock Selection bit 0 position
#define TC1_CLKSEL1_bm (1<<1) ///< Clock Selection bit 1 mask
#define TC1_CLKSEL1_bp 1 ///< Clock Selection bit 1 position
#define TC1_CLKSEL2_bm (1<<2) ///< Clock Selection bit 2 mask
#define TC1_CLKSEL2_bp 2 ///< Clock Selection bit 2 position
#define TC1_CLKSEL3_bm (1<<3) ///< Clock Selection bit 3 mask
#define TC1_CLKSEL3_bp 3 ///< Clock Selection bit 3 position
/** @} */

