dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name TC1.CTRLB
  * @see TC_WGMODE_enum
  * @{
  */
#define TC1_CCBEN_bm 0x20 ///< Compare or Capture B Enable bit mask
#define TC1_CCBEN_bp 5 ///< Compare or Capture B Enable bit position
#define TC1_CCAEN_bm 0x10 ///< Compare or Capture A Enable bit mask
#define TC1_CCAEN_bp 4 ///< Compare or Capture A Enable bit position
#define TC1_WGMODE_gm 0x07 ///< Waveform generation mode group mask
#define TC1_WGMODE_gp 0 ///< Waveform generation mode group position
#define TC1_WGMODE0_bm (1<<0) ///< Waveform generation mode bit 0 mask
#define TC1_WGMODE0_bp 0 ///< Waveform generation mode bit 0 position
#define TC1_WGMODE1_bm (1<<1) ///< Waveform generation mode bit 1 mask
#define TC1_WGMODE1_bp 1 ///< Waveform generation mode bit 1 position
#define TC1_WGMODE2_bm (1<<2) ///< Waveform generation mode bit 2 mask
#define TC1_WGMODE2_bp 2 ///< Waveform generation mode bit 2 position
/** @} */

/** @name TC1.CTRLC
  * @{
  */
#define TC1_CMPB_bm 0x02 ///< Compare B Output Value bit mask
#define TC1_CMPB_bp 1 ///< Compare B Output Value bit position
#define TC1_CMPA_bm 0x01 ///< Compare A Output Value bit mask
#define TC1_CMPA_bp 0 ///< Compare A Output Value bit position
/** @} */

/** @name TC1.CTRLD
  * @see TC_EVACT_enum
  * @see TC_EVSEL_enum
  * @{
  */
#define TC1_EVACT_gm 0xE0 ///< Event Action group mask
#define TC1_EVACT_gp 5 ///< Event Action group position
#define TC1_EVACT0_bm (1<<5) ///< Event Action bit 0 mask
#define TC1_EVACT0_bp 5 ///< Event Action bit 0 position
#define TC1_EVACT1_bm (1<<6) ///< Event Action bit 1 mask
#define TC1_EVACT1_bp 6 ///< Event Action bit 1 position
#define TC1_EVACT2_bm (1<<7) ///< Event Action bit 2 mask
#define TC1_EVACT2_bp 7 ///< Event Action bit 2 position
#define TC1_EVDLY_bm 0x10 ///< Event Delay bit mask
#define TC1_EVDLY_bp 4 ///< Event Delay bit position
#define TC1_EVSEL_gm 0x0F ///< Event Source Select group mask
#define TC1_EVSEL_gp 0 ///< Event Source Select group position
#define TC1_EVSEL0_bm (1<<0) ///< Event Source Select bit 0 mask
#define TC1_EVSEL0_bp 0 ///< Event Source Select bit 0 position
#define TC1_EVSEL1_bm (1<<1) ///< Event Source Select bit 1 mask
#define TC1_EVSEL1_bp 1 ///< Event Source Select bit 1 position
#define TC1_EVSEL2_bm (1<<2) ///< Event Source Select bit 2 mask
#define TC1_EVSEL2_bp 2 ///< Event Source Select bit 2 position
#define TC1_EVSEL3_bm (1<<3) ///< Event Source Select bit 3 mask
#define TC1_EVSEL3_bp 3 ///< Event Source Select bit 3 position
/** @} */

/** @name TC1.CTRLE
  * @{
  */
#define TC1_BYTEM_bm 0x01 ///< Byte Mode bit mask
#define TC1_BYTEM_bp 0 ///< Byte Mode bit position
/** @} */

/** @name TC1.INTCTRLA
  * @see TC_ERRINTLVL_enum
  * @see TC_OVFINTLVL_enum
  * @{
  */
#define TC1_ERRINTLVL_gm 0x0C ///< Error Interrupt Level group mask
#define TC1_ERRINTLVL_gp 2 ///< Error Interrupt Level group position
#define TC1_ERRINTLVL0_bm (1<<2) ///< Error Interrupt Level bit 0 mask
#define TC1_ERRINTLVL0_bp 2 ///< Error Interrupt Level bit 0 position
#define TC1_ERRINTLVL1_bm (1<<3) ///< Error Interrupt Level bit 1 mask
#define TC1_ERRINTLVL1_bp 3 ///< Error Interrupt Level bit 1 position
#define TC1_OVFINTLVL_gm 0x03 ///< Overflow interrupt level group mask
#define TC1_OVFINTLVL_gp 0 ///< Overflow interrupt level group position
#define TC1_OVFINTLVL0_bm (1<<0) ///< Overflow interrupt level bit 0 mask
#define TC1_OVFINTLVL0_bp 0 ///< Overflow interrupt level bit 0 position
#define TC1_OVFINTLVL1_bm (1<<1) ///< Overflow interrupt level bit 1 mask
#define TC1_OVFINTLVL1_bp 1 ///< Overflow interrupt level bit 1 position
/** @} */

/** @name TC1.INTCTRLB
  * @see TC_CCBINTLVL_enum
  * @see TC_CCAINTLVL_enum
  * @{
  */
#define TC1_CCBINTLVL_gm 0x0C ///< Compare or Capture B Interrupt Level group mask
#define TC1_CCBINTLVL_gp 2 ///< Compare or Capture B Interrupt Level group position
#define TC1_CCBINTLVL0_bm (1<<2) ///< Compare or Capture B Interrupt Level bit 0 mask
#define TC1_CCBINTLVL0_bp 2 ///< Compare or Capture B Interrupt Level bit 0 position
#define TC1_CCBINTLVL1_bm (1<<3) ///< Compare or Capture B Interrupt Level bit 1 mask
#define TC1_CCBINTLVL1_bp 3 ///< Compare or Capture B Interrupt Level bit 1 position
#define TC1_CCAINTLVL_gm 0x03 ///< Compare or Capture A Interrupt Level group mask
#define TC1_CCAINTLVL_gp 0 ///< Compare or Capture A Interrupt Level group position
#define TC1_CCAINTLVL0_bm (1<<0) ///< Compare or Capture A Interrupt Level bit 0 mask
#define TC1_CCAINTLVL0_bp 0 ///< Compare or Capture A Interrupt Level bit 0 position
#define TC1_CCAINTLVL1_bm (1<<1) ///< Compare or Capture A Interrupt Level bit 1 mask
#define TC1_CCAINTLVL1_bp 1 ///< Compare or Capture A Interrupt Level bit 1 position
/** @} */

/** @name TC1.CTRLFCLR
  * @{
  */
#define TC1_CMD_gm 0x0C ///< Command group mask
#define TC1_CMD_gp 2 ///< Command group position
#define TC1_CMD0_bm (1<<2) ///< Command bit 0 mask
#define TC1_CMD0_bp 2 ///< Command bit 0 position
#define TC1_CMD1_bm (1<<3) ///< Command bit 1 mask
#define TC1_CMD1_bp 3 ///< Command bit 1 position
#define TC1_LUPD_bm 0x02 ///< Lock Update bit mask
#define TC1_LUPD_bp 1 ///< Lock Update bit position
#define TC1_DIR_bm 0x01 ///< Direction bit mask
#define TC1_DIR_bp 0 ///< Direction bit position
/** @} */

/** @name TC1.CTRLFSET
  * @see TC_CMD_enum
  * @{
  */
// Masks for CMD aready defined
// Masks for LUPD aready defined
// Masks for DIR aready defined
/** @} */

/** @name TC1.CTRLGCLR
  * @{
  */
#define TC1_CCBBV_bm 0x04 ///< Compare or Capture B Buffer Valid bit mask
#define TC1_CCBBV_bp 2 ///< Compare or Capture B Buffer Valid bit position
#define TC1_CCABV_bm 0x02 ///< Compare or Capture A Buffer Valid bit mask
#define TC1_CCABV_bp 1 ///< Compare or Capture A Buffer Valid bit position
#define TC1_PERBV_bm 0x01 ///< Period Buffer Valid bit mask
#define TC1_PERBV_bp 0 ///< Period Buffer Valid bit position
/** @} */

/** @name TC1.CTRLGSET
  * @{
  */
// Masks for CCBBV aready defined
// Masks for CCABV aready defined
// Masks for PERBV aready defined
/** @} */

/** @name TC1.INTFLAGS
  * @{
  */
#define TC1_CCBIF_bm 0x20 ///< Compare or Capture B Interrupt Flag bit mask
#define TC1_CCBIF_bp 5 ///< Compare or Capture B Interrupt Flag bit position
#define TC1_CCAIF_bm 0x10 ///< Compare or Capture A Interrupt Flag bit mask
#define TC1_CCAIF_bp 4 ///< Compare or Capture A Interrupt Flag bit position
#define TC1_ERRIF_bm 0x02 ///< Error Interrupt Flag bit mask
#define TC1_ERRIF_bp 1 ///< Error Interrupt Flag bit position
#define TC1_OVFIF_bm 0x01 ///< Overflow Interrupt Flag bit mask
#define TC1_OVFIF_bp 0 ///< Overflow Interrupt Flag bit position
/** @} */

/** @name AWEX.CTRL
  * @{
  */
#define AWEX_PGM_bm 0x20 ///< Pattern Generation Mode bit mask
#define AWEX_PGM_bp 5 ///< Pattern Generation Mode bit position
#define AWEX_CWCM_bm 0x10 ///< Common Waveform Channel Mode bit mask
#define AWEX_CWCM_bp 4 ///< Common Waveform Channel Mode bit position
#define AWEX_DTICCDEN_bm 0x08 ///< Dead Time Insertion Compare Channel D Enable bit mask
#define AWEX_DTICCDEN_bp 3 ///< Dead Time Insertion Compare Channel D Enable bit position
#define AWEX_DTICCCEN_bm 0x04 ///< Dead Time Insertion Compare Channel C Enable bit mask
#define AWEX_DTICCCEN_bp 2 ///< Dead Time Insertion Compare Channel C Enable bit position
#define AWEX_DTICCBEN_bm 0x02 ///< Dead Time Insertion Compare Channel B Enable bit mask
#define AWEX_DTICCBEN_bp 1 ///< Dead Time Insertion Compare Channel B Enable bit position
#define AWEX_DTICCAEN_bm 0x01 ///< Dead Time Insertion Compare Channel A Enable bit mask
#define AWEX_DTICCAEN_bp 0 ///< Dead Time Insertion Compare Channel A Enable bit position
/** @} */

/** @name AWEX.FDCTRL
  * @see AWEX_FDACT_enum
  * @{
  */
#define AWEX_FDDBD_bm 0x10 ///< Fault Detect on Disable Break Disable bit mask
#define AWEX_FDDBD_bp 4 ///< Fault Detect on Disable Break Disable bit position
#define AWEX_FDMODE_bm 0x04 ///< Fault Detect Mode bit mask
#define AWEX_FDMODE_bp 2 ///< Fault Detect Mode bit position
#define AWEX_FDACT_gm 0x03 ///< Fault Detect Action group mask
#define AWEX_FDACT_gp 0 ///< Fault Detect Action group position
#define AWEX_FDACT0_bm (1<<0) ///< Fault Detect Action bit 0 mask
#define AWEX_FDACT0_bp 0 ///< Fault Detect Action bit 0 position
#define AWEX_FDACT1_bm (1<<1) ///< Fault Detect Action bit 1 mask
#define AWEX_FDACT1_bp 1 ///< Fault Detect Action bit 1 position
/** @} */

/** @name AWEX.STATUS
  * @{
  */
#define AWEX_FDF_bm 0x04 ///< Fault Detect Flag bit mask
#define AWEX_FDF_bp 2 ///< Fault Detect Flag bit position
#define AWEX_DTHSBUFV_bm 0x02 ///< Dead Time High Side Buffer Valid bit mask
#define AWEX_DTHSBUFV_bp 1 ///< Dead Time High Side Buffer Valid bit position
#define AWEX_DTLSBUFV_bm 0x01 ///< Dead Time Low Side Buffer Valid bit mask
#define AWEX_DTLSBUFV_bp 0 ///< Dead Time Low Side Buffer Valid bit position
/** @} */

