dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name HIRES.CTRLA
  * @see HIRES_HREN_enum
  * @{
  */
#define HIRES_HREN_gm 0x03 ///< High Resolution Enable group mask
#define HIRES_HREN_gp 0 ///< High Resolution Enable group position
#define HIRES_HREN0_bm (1<<0) ///< High Resolution Enable bit 0 mask
#define HIRES_HREN0_bp 0 ///< High Resolution Enable bit 0 position
#define HIRES_HREN1_bm (1<<1) ///< High Resolution Enable bit 1 mask
#define HIRES_HREN1_bp 1 ///< High Resolution Enable bit 1 position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Clock Selection

typedef enum TC_CLKSEL_enum {
	TC_CLKSEL_OFF_gc = (0x00<<0),	///< Timer Off
	TC_CLKSEL_DIV1_gc = (0x01<<0),	///< System Clock
	TC_CLKSEL_DIV2_gc = (0x02<<0),	///< System Clock / 2
	TC_CLKSEL_DIV4_gc = (0x03<<0),	///< System Clock / 4
	TC_CLKSEL_DIV8_gc = (0x04<<0),	///< System Clock / 8
	TC_CLKSEL_DIV64_gc = (0x05<<0),	///< System Clock / 64
	TC_CLKSEL_DIV256_gc = (0x06<<0),	///< System Clock / 256
	TC_CLKSEL_DIV1024_gc = (0x07<<0),	///< System Clock / 1024
	TC_CLKSEL_EVCH0_gc = (0x08<<0),	///< Event Channel 0
	TC_CLKSEL_EVCH1_gc = (0x09<<0),	///< Event Channel 1
	TC_CLKSEL_EVCH2_gc = (0x0A<<0),	///< Event Channel 2
	TC_CLKSEL_EVCH3_gc = (0x0B<<0),	///< Event Channel 3
	TC_CLKSEL_EVCH4_gc = (0x0C<<0),	///< Event Channel 4
	TC_CLKSEL_EVCH5_gc = (0x0D<<0),	///< Event Channel 5
	TC_CLKSEL_EVCH6_gc = (0x0E<<0),	///< Event Channel 6
	TC_CLKSEL_EVCH7_gc = (0x0F<<0),	///< Event Channel 7
} TC_CLKSEL_t;

/// Waveform Generation Mode

typedef enum TC_WGMODE_enum {
	TC_WGMODE_NORMAL_gc = (0x00<<0),	///< Normal Mode
	TC_WGMODE_FRQ_gc = (0x01<<0),	///< Frequency Generation Mode
	TC_WGMODE_SS_gc = (0x03<<0),	///< Single Slope
	TC_WGMODE_DS_T_gc = (0x05<<0),	///< Dual Slope, Update on TOP
	TC_WGMODE_DS_TB_gc = (0x06<<0),	///< Dual Slope, Update on TOP and BOTTOM
	TC_WGMODE_DS_B_gc = (0x07<<0),	///< Dual Slope, Update on BOTTOM
} TC_WGMODE_t;

/// Event Action

typedef enum TC_EVACT_enum {
	TC_EVACT_OFF_gc = (0x00<<5),	///< No Event Action
	TC_EVACT_CAPT_gc = (0x01<<5),	///< Input Capture
	TC_EVACT_UPDOWN_gc = (0x02<<5),	///< Externally Controlled Up/Down Count
	TC_EVACT_QDEC_gc = (0x03<<5),	///< Quadrature Decode
	TC_EVACT_RESTART_gc = (0x04<<5),	///< Restart
	TC_EVACT_FRQ_gc = (0x05<<5),	///< Frequency Capture
	TC_EVACT_PW_gc = (0x06<<5),	///< Pulse-width Capture
} TC_EVACT_t;

/// Event Selection

typedef enum TC_EVSEL_enum {
	TC_EVSEL_OFF_gc = (0x00<<0),	///< No Event Source
	TC_EVSEL_CH0_gc = (0x08<<0),	///< Event Channel 0
	TC_EVSEL_CH1_gc = (0x09<<0),	///< Event Channel 1
	TC_EVSEL_CH2_gc = (0x0A<<0),	///< Event Channel 2
	TC_EVSEL_CH3_gc = (0x0B<<0),	///< Event Channel 3
	TC_EVSEL_CH4_gc = (0x0C<<0),	///< Event Channel 4
	TC_EVSEL_CH5_gc = (0x0D<<0),	///< Event Channel 5
	TC_EVSEL_CH6_gc = (0x0E<<0),	///< Event Channel 6
	TC_EVSEL_CH7_gc = (0x0F<<0),	///< Event Channel 7
} TC_EVSEL_t;

/// Error Interrupt Level

typedef enum TC_ERRINTLVL_enum {
	TC_ERRINTLVL_OFF_gc = (0x00<<2),	///< Interrupt Disabled
	TC_ERRINTLVL_LO_gc = (0x01<<2),	///< Low Level
	TC_ERRINTLVL_MED_gc = (0x02<<2),	///< Medium Level
	TC_ERRINTLVL_HI_gc = (0x03<<2),	///< High Level
} TC_ERRINTLVL_t;

/// Overflow Interrupt Level

typedef enum TC_OVFINTLVL_enum {
	TC_OVFINTLVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	TC_OVFINTLVL_LO_gc = (0x01<<0),	///< Low Level
	TC_OVFINTLVL_MED_gc = (0x02<<0),	///< Medium Level
	TC_OVFINTLVL_HI_gc = (0x03<<0),	///< High Level
} TC_OVFINTLVL_t;

/// Compare or Capture D Interrupt Level

typedef enum TC_CCDINTLVL_enum {
	TC_CCDINTLVL_OFF_gc = (0x00<<6),	///< Interrupt Disabled
	TC_CCDINTLVL_LO_gc = (0x01<<6),	///< Low Level
	TC_CCDINTLVL_MED_gc = (0x02<<6),	///< Medium Level
	TC_CCDINTLVL_HI_gc = (0x03<<6),	///< High Level
} TC_CCDINTLVL_t;

/// Compare or Capture C Interrupt Level

typedef enum TC_CCCINTLVL_enum {
	TC_CCCINTLVL_OFF_gc = (0x00<<4),	///< Interrupt Disabled
	TC_CCCINTLVL_LO_gc = (0x01<<4),	///< Low Level
	TC_CCCINTLVL_MED_gc = (0x02<<4),	///< Medium Level
	TC_CCCINTLVL_HI_gc = (0x03<<4),	///< High Level
} TC_CCCINTLVL_t;

/// Compare or Capture B Interrupt Level

typedef enum TC_CCBINTLVL_enum {
	TC_CCBINTLVL_OFF_gc = (0x00<<2),	///< Interrupt Disabled
	TC_CCBINTLVL_LO_gc = (0x01<<2),	///< Low Level
	TC_CCBINTLVL_MED_gc = (0x02<<2),	///< Medium Level
	TC_CCBINTLVL_HI_gc = (0x03<<2),	///< High Level
} TC_CCBINTLVL_t;

/// Compare or Capture A Interrupt Level

typedef enum TC_CCAINTLVL_enum {
	TC_CCAINTLVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	TC_CCAINTLVL_LO_gc = (0x01<<0),	///< Low Level
	TC_CCAINTLVL_MED_gc = (0x02<<0),	///< Medium Level
	TC_CCAINTLVL_HI_gc = (0x03<<0),	///< High Level
} TC_CCAINTLVL_t;

/// Timer/Counter Command

typedef enum TC_CMD_enum {
	TC_CMD_NONE_gc = (0x00<<2),	///< No Command
	TC_CMD_UPDATE_gc = (0x01<<2),	///< Force Update
	TC_CMD_RESTART_gc = (0x02<<2),	///< Force Restart
	TC_CMD_RESET_gc = (0x03<<2),	///< Force Hard Reset
} TC_CMD_t;

/// Fault Detect Action

typedef enum AWEX_FDACT_enum {
	AWEX_FDACT_NONE_gc = (0x00<<0),	///< No Fault Protection
	AWEX_FDACT_CLEAROE_gc = (0x01<<0),	///< Clear Output Enable Bits
	AWEX_FDACT_CLEARDIR_gc = (0x03<<0),	///< Clear I/O Port Direction Bits
} AWEX_FDACT_t;

/// High Resolution Enable

typedef enum HIRES_HREN_enum {
	HIRES_HREN_NONE_gc = (0x00<<0),	///< No Fault Protection
	HIRES_HREN_TC0_gc = (0x01<<0),	///< Enable High Resolution on Timer/Counter 0
	HIRES_HREN_TC1_gc = (0x02<<0),	///< Enable High Resolution on Timer/Counter 1
	HIRES_HREN_BOTH_gc = (0x03<<0),	///< Enable High Resolution both Timer/Counters
} HIRES_HREN_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Clock Selection
#define TC_CLKSEL_OFF_gc (0x00<<0)	///< Timer Off
#define TC_CLKSEL_DIV1_gc (0x01<<0)	///< System Clock
#define TC_CLKSEL_DIV2_gc (0x02<<0)	///< System Clock / 2
#define TC_CLKSEL_DIV4_gc (0x03<<0)	///< System Clock / 4
#define TC_CLKSEL_DIV8_gc (0x04<<0)	///< System Clock / 8
#define TC_CLKSEL_DIV64_gc (0x05<<0)	///< System Clock / 64
#define TC_CLKSEL_DIV256_gc (0x06<<0)	///< System Clock / 256
#define TC_CLKSEL_DIV1024_gc (0x07<<0)	///< System Clock / 1024
#define TC_CLKSEL_EVCH0_gc (0x08<<0)	///< Event Channel 0
#define TC_CLKSEL_EVCH1_gc (0x09<<0)	///< Event Channel 1
#define TC_CLKSEL_EVCH2_gc (0x0A<<0)	///< Event Channel 2
#define TC_CLKSEL_EVCH3_gc (0x0B<<0)	///< Event Channel 3
#define TC_CLKSEL_EVCH4_gc (0x0C<<0)	///< Event Channel 4
#define TC_CLKSEL_EVCH5_gc (0x0D<<0)	///< Event Channel 5
#define TC_CLKSEL_EVCH6_gc (0x0E<<0)	///< Event Channel 6
#define TC_CLKSEL_EVCH7_gc (0x0F<<0)	///< Event Channel 7

/// Waveform Generation Mode
#define TC_WGMODE_NORMAL_gc (0x00<<0)	///< Normal Mode
#define TC_WGMODE_FRQ_gc (0x01<<0)	///< Frequency Generation Mode
#define TC_WGMODE_SS_gc (0x03<<0)	///< Single Slope
#define TC_WGMODE_DS_T_gc (0x05<<0)	///< Dual Slope, Update on TOP
#define TC_WGMODE_DS_TB_gc (0x06<<0)	///< Dual Slope, Update on TOP and BOTTOM
#define TC_WGMODE_DS_B_gc (0x07<<0)	///< Dual Slope, Update on BOTTOM

/// Event Action
#define TC_EVACT_OFF_gc (0x00<<5)	///< No Event Action
#define TC_EVACT_CAPT_gc (0x01<<5)	///< Input Capture
#define TC_EVACT_UPDOWN_gc (0x02<<5)	///< Externally Controlled Up/Down Count
#define TC_EVACT_QDEC_gc (0x03<<5)	///< Quadrature Decode
#define TC_EVACT_RESTART_gc (0x04<<5)	///< Restart
#define TC_EVACT_FRQ_gc (0x05<<5)	///< Frequency Capture
#define TC_EVACT_PW_gc (0x06<<5)	///< Pulse-width Capture

/// Event Selection
#define TC_EVSEL_OFF_gc (0x00<<0)	///< No Event Source
#define TC_EVSEL_CH0_gc (0x08<<0)	///< Event Channel 0
#define TC_EVSEL_CH1_gc (0x09<<0)	///< Event Channel 1
#define TC_EVSEL_CH2_gc (0x0A<<0)	///< Event Channel 2
#define TC_EVSEL_CH3_gc (0x0B<<0)	///< Event Channel 3
#define TC_EVSEL_CH4_gc (0x0C<<0)	///< Event Channel 4
#define TC_EVSEL_CH5_gc (0x0D<<0)	///< Event Channel 5
#define TC_EVSEL_CH6_gc (0x0E<<0)	///< Event Channel 6
#define TC_EVSEL_CH7_gc (0x0F<<0)	///< Event Channel 7

/// Error Interrupt Level
#define TC_ERRINTLVL_OFF_gc (0x00<<2)	///< Interrupt Disabled
#define TC_ERRINTLVL_LO_gc (0x01<<2)	///< Low Level
#define TC_ERRINTLVL_MED_gc (0x02<<2)	///< Medium Level
#define TC_ERRINTLVL_HI_gc (0x03<<2)	///< High Level

/// Overflow Interrupt Level
#define TC_OVFINTLVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define TC_OVFINTLVL_LO_gc (0x01<<0)	///< Low Level
#define TC_OVFINTLVL_MED_gc (0x02<<0)	///< Medium Level
#define TC_OVFINTLVL_HI_gc (0x03<<0)	///< High Level

/// Compare or Capture D Interrupt Level
#define TC_CCDINTLVL_OFF_gc (0x00<<6)	///< Interrupt Disabled
#define TC_CCDINTLVL_LO_gc (0x01<<6)	///< Low Level
#define TC_CCDINTLVL_MED_gc (0x02<<6)	///< Medium Level
#define TC_CCDINTLVL_HI_gc (0x03<<6)	///< High Level

/// Compare or Capture C Interrupt Level
#define TC_CCCINTLVL_OFF_gc (0x00<<4)	///< Interrupt Disabled
#define TC_CCCINTLVL_LO_gc (0x01<<4)	///< Low Level
#define TC_CCCINTLVL_MED_gc (0x02<<4)	///< Medium Level
#define TC_CCCINTLVL_HI_gc (0x03<<4)	///< High Level

/// Compare or Capture B Interrupt Level
#define TC_CCBINTLVL_OFF_gc (0x00<<2)	///< Interrupt Disabled
#define TC_CCBINTLVL_LO_gc (0x01<<2)	///< Low Level
#define TC_CCBINTLVL_MED_gc (0x02<<2)	///< Medium Level
#define TC_CCBINTLVL_HI_gc (0x03<<2)	///< High Level

/// Compare or Capture A Interrupt Level
#define TC_CCAINTLVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define TC_CCAINTLVL_LO_gc (0x01<<0)	///< Low Level
#define TC_CCAINTLVL_MED_gc (0x02<<0)	///< Medium Level
#define TC_CCAINTLVL_HI_gc (0x03<<0)	///< High Level

