dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/// Timer/Counter Command
#define TC_CMD_NONE_gc (0x00<<2)	///< No Command
#define TC_CMD_UPDATE_gc (0x01<<2)	///< Force Update
#define TC_CMD_RESTART_gc (0x02<<2)	///< Force Restart
#define TC_CMD_RESET_gc (0x03<<2)	///< Force Hard Reset

/// Fault Detect Action
#define AWEX_FDACT_NONE_gc (0x00<<0)	///< No Fault Protection
#define AWEX_FDACT_CLEAROE_gc (0x01<<0)	///< Clear Output Enable Bits
#define AWEX_FDACT_CLEARDIR_gc (0x03<<0)	///< Clear I/O Port Direction Bits

/// High Resolution Enable
#define HIRES_HREN_NONE_gc (0x00<<0)	///< No Fault Protection
#define HIRES_HREN_TC0_gc (0x01<<0)	///< Enable High Resolution on Timer/Counter 0
#define HIRES_HREN_TC1_gc (0x02<<0)	///< Enable High Resolution on Timer/Counter 1
#define HIRES_HREN_BOTH_gc (0x03<<0)	///< Enable High Resolution both Timer/Counters

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup usart Universal Asynchronous Receiver-Transmitter
 *  @{
 */

/** @name USART.STATUS
  * @{
  */
#define USART_RXCIF_bm 0x80 ///< Receive Interrupt Flag bit mask
#define USART_RXCIF_bp 7 ///< Receive Interrupt Flag bit position
#define USART_TXCIF_bm 0x40 ///< Transmit Interrupt Flag bit mask
#define USART_TXCIF_bp 6 ///< Transmit Interrupt Flag bit position
#define USART_DREIF_bm 0x20 ///< Data Register Empty Flag bit mask
#define USART_DREIF_bp 5 ///< Data Register Empty Flag bit position
#define USART_FERR_bm 0x10 ///< Frame Error bit mask
#define USART_FERR_bp 4 ///< Frame Error bit position
#define USART_BUFOVF_bm 0x08 ///< Buffer Overflow bit mask
#define USART_BUFOVF_bp 3 ///< Buffer Overflow bit position
#define USART_PERR_bm 0x04 ///< Parity Error bit mask
#define USART_PERR_bp 2 ///< Parity Error bit position
#define USART_RXB8_bm 0x01 ///< Receive Bit 8 bit mask
#define USART_RXB8_bp 0 ///< Receive Bit 8 bit position
/** @} */

/** @name USART.CTRLA
  * @see USART_RXCINTLVL_enum
  * @see USART_TXCINTLVL_enum
  * @see USART_DREINTLVL_enum
  * @{
  */
#define USART_RXCINTLVL_gm 0x30 ///< Receive Interrupt Level group mask
#define USART_RXCINTLVL_gp 4 ///< Receive Interrupt Level group position
#define USART_RXCINTLVL0_bm (1<<4) ///< Receive Interrupt Level bit 0 mask
#define USART_RXCINTLVL0_bp 4 ///< Receive Interrupt Level bit 0 position
#define USART_RXCINTLVL1_bm (1<<5) ///< Receive Interrupt Level bit 1 mask
#define USART_RXCINTLVL1_bp 5 ///< Receive Interrupt Level bit 1 position
#define USART_TXCINTLVL_gm 0x0C ///< Transmit Interrupt Level group mask
#define USART_TXCINTLVL_gp 2 ///< Transmit Interrupt Level group position
#define USART_TXCINTLVL0_bm (1<<2) ///< Transmit Interrupt Level bit 0 mask
#define USART_TXCINTLVL0_bp 2 ///< Transmit Interrupt Level bit 0 position
#define USART_TXCINTLVL1_bm (1<<3) ///< Transmit Interrupt Level bit 1 mask
#define USART_TXCINTLVL1_bp 3 ///< Transmit Interrupt Level bit 1 position
#define USART_DREINTLVL_gm 0x03 ///< Data Register Empty Interrupt Level group mask
#define USART_DREINTLVL_gp 0 ///< Data Register Empty Interrupt Level group position
#define USART_DREINTLVL0_bm (1<<0) ///< Data Register Empty Interrupt Level bit 0 mask
#define USART_DREINTLVL0_bp 0 ///< Data Register Empty Interrupt Level bit 0 position
#define USART_DREINTLVL1_bm (1<<1) ///< Data Register Empty Interrupt Level bit 1 mask
#define USART_DREINTLVL1_bp 1 ///< Data Register Empty Interrupt Level bit 1 position
/** @} */

/** @name USART.CTRLB
  * @{
  */
#define USART_RXEN_bm 0x10 ///< Receiver Enable bit mask
#define USART_RXEN_bp 4 ///< Receiver Enable bit position
#define USART_TXEN_bm 0x08 ///< Transmitter Enable bit mask
#define USART_TXEN_bp 3 ///< Transmitter Enable bit position
#define USART_CLK2X_bm 0x04 ///< Double transmission speed bit mask
#define USART_CLK2X_bp 2 ///< Double transmission speed bit position
#define USART_MPCM_bm 0x02 ///< Multi-processor Communication Mode bit mask
#define USART_MPCM_bp 1 ///< Multi-processor Communication Mode bit position
#define USART_TXB8_bm 0x01 ///< Transmit bit 8 bit mask
#define USART_TXB8_bp 0 ///< Transmit bit 8 bit position
/** @} */

/** @name USART.CTRLC
  * @see USART_CMODE_enum
  * @see USART_PMODE_enum
  * @see USART_CHSIZE_enum
  * @{
  */
#define USART_CMODE_gm 0xC0 ///< Communication Mode group mask
#define USART_CMODE_gp 6 ///< Communication Mode group position
#define USART_CMODE0_bm (1<<6) ///< Communication Mode bit 0 mask
#define USART_CMODE0_bp 6 ///< Communication Mode bit 0 position
#define USART_CMODE1_bm (1<<7) ///< Communication Mode bit 1 mask
#define USART_CMODE1_bp 7 ///< Communication Mode bit 1 position
#define USART_PMODE_gm 0x30 ///< Parity Mode group mask
#define USART_PMODE_gp 4 ///< Parity Mode group position
#define USART_PMODE0_bm (1<<4) ///< Parity Mode bit 0 mask
#define USART_PMODE0_bp 4 ///< Parity Mode bit 0 position
#define USART_PMODE1_bm (1<<5) ///< Parity Mode bit 1 mask
#define USART_PMODE1_bp 5 ///< Parity Mode bit 1 position
#define USART_SBMODE_bm 0x08 ///< Stop Bit Mode bit mask
#define USART_SBMODE_bp 3 ///< Stop Bit Mode bit position
#define USART_CHSIZE_gm 0x07 ///< Character Size group mask
#define USART_CHSIZE_gp 0 ///< Character Size group position
#define USART_CHSIZE0_bm (1<<0) ///< Character Size bit 0 mask
#define USART_CHSIZE0_bp 0 ///< Character Size bit 0 position
#define USART_CHSIZE1_bm (1<<1) ///< Character Size bit 1 mask
#define USART_CHSIZE1_bp 1 ///< Character Size bit 1 position
#define USART_CHSIZE2_bm (1<<2) ///< Character Size bit 2 mask
#define USART_CHSIZE2_bp 2 ///< Character Size bit 2 position
/** @} */

/** @name USART.BAUDCTRLA
  * @{
  */
#define USART_BSEL_gm 0xFF ///< Baud Rate Selection Bits [7:0] group mask
#define USART_BSEL_gp 0 ///< Baud Rate Selection Bits [7:0] group position
#define USART_BSEL0_bm (1<<0) ///< Baud Rate Selection Bits [7:0] bit 0 mask
#define USART_BSEL0_bp 0 ///< Baud Rate Selection Bits [7:0] bit 0 position
#define USART_BSEL1_bm (1<<1) ///< Baud Rate Selection Bits [7:0] bit 1 mask
#define USART_BSEL1_bp 1 ///< Baud Rate Selection Bits [7:0] bit 1 position
#define USART_BSEL2_bm (1<<2) ///< Baud Rate Selection Bits [7:0] bit 2 mask
#define USART_BSEL2_bp 2 ///< Baud Rate Selection Bits [7:0] bit 2 position
#define USART_BSEL3_bm (1<<3) ///< Baud Rate Selection Bits [7:0] bit 3 mask
#define USART_BSEL3_bp 3 ///< Baud Rate Selection Bits [7:0] bit 3 position
#define USART_BSEL4_bm (1<<4) ///< Baud Rate Selection Bits [7:0] bit 4 mask
#define USART_BSEL4_bp 4 ///< Baud Rate Selection Bits [7:0] bit 4 position
#define USART_BSEL5_bm (1<<5) ///< Baud Rate Selection Bits [7:0] bit 5 mask
#define USART_BSEL5_bp 5 ///< Baud Rate Selection Bits [7:0] bit 5 position
#define USART_BSEL6_bm (1<<6) ///< Baud Rate Selection Bits [7:0] bit 6 mask
#define USART_BSEL6_bp 6 ///< Baud Rate Selection Bits [7:0] bit 6 position
#define USART_BSEL7_bm (1<<7) ///< Baud Rate Selection Bits [7:0] bit 7 mask
#define USART_BSEL7_bp 7 ///< Baud Rate Selection Bits [7:0] bit 7 position
/** @} */

