dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
/** @name USART.BAUDCTRLB
  * @{
  */
#define USART_BSCALE_gm 0xF0 ///< Baud Rate Scale group mask
#define USART_BSCALE_gp 4 ///< Baud Rate Scale group position
#define USART_BSCALE0_bm (1<<4) ///< Baud Rate Scale bit 0 mask
#define USART_BSCALE0_bp 4 ///< Baud Rate Scale bit 0 position
#define USART_BSCALE1_bm (1<<5) ///< Baud Rate Scale bit 1 mask
#define USART_BSCALE1_bp 5 ///< Baud Rate Scale bit 1 position
#define USART_BSCALE2_bm (1<<6) ///< Baud Rate Scale bit 2 mask
#define USART_BSCALE2_bp 6 ///< Baud Rate Scale bit 2 position
#define USART_BSCALE3_bm (1<<7) ///< Baud Rate Scale bit 3 mask
#define USART_BSCALE3_bp 7 ///< Baud Rate Scale bit 3 position
// Masks for BSEL aready defined
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Receive Complete Interrupt level

typedef enum USART_RXCINTLVL_enum {
	USART_RXCINTLVL_OFF_gc = (0x00<<4),	///< Interrupt Disabled
	USART_RXCINTLVL_LO_gc = (0x01<<4),	///< Low Level
	USART_RXCINTLVL_MED_gc = (0x02<<4),	///< Medium Level
	USART_RXCINTLVL_HI_gc = (0x03<<4),	///< High Level
} USART_RXCINTLVL_t;

/// Transmit Complete Interrupt level

typedef enum USART_TXCINTLVL_enum {
	USART_TXCINTLVL_OFF_gc = (0x00<<2),	///< Interrupt Disabled
	USART_TXCINTLVL_LO_gc = (0x01<<2),	///< Low Level
	USART_TXCINTLVL_MED_gc = (0x02<<2),	///< Medium Level
	USART_TXCINTLVL_HI_gc = (0x03<<2),	///< High Level
} USART_TXCINTLVL_t;

/// Data Register Empty Interrupt level

typedef enum USART_DREINTLVL_enum {
	USART_DREINTLVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	USART_DREINTLVL_LO_gc = (0x01<<0),	///< Low Level
	USART_DREINTLVL_MED_gc = (0x02<<0),	///< Medium Level
	USART_DREINTLVL_HI_gc = (0x03<<0),	///< High Level
} USART_DREINTLVL_t;

/// Character Size

typedef enum USART_CHSIZE_enum {
	USART_CHSIZE_5BIT_gc = (0x00<<0),	///< Character size: 5 bit
	USART_CHSIZE_6BIT_gc = (0x01<<0),	///< Character size: 6 bit
	USART_CHSIZE_7BIT_gc = (0x02<<0),	///< Character size: 7 bit
	USART_CHSIZE_8BIT_gc = (0x03<<0),	///< Character size: 8 bit
	USART_CHSIZE_9BIT_gc = (0x07<<0),	///< Character size: 9 bit
} USART_CHSIZE_t;

/// Communication Mode

typedef enum USART_CMODE_enum {
	USART_CMODE_ASYNCHRONOUS_gc = (0x00<<6),	///< Asynchronous Mode
	USART_CMODE_SYNCHRONOUS_gc = (0x01<<6),	///< Synchronous Mode
	USART_CMODE_IRDA_gc = (0x02<<6),	///< IrDA Mode
	USART_CMODE_MSPI_gc = (0x03<<6),	///< Master SPI Mode
} USART_CMODE_t;

/// Parity Mode

typedef enum USART_PMODE_enum {
	USART_PMODE_DISABLED_gc = (0x00<<4),	///< No Parity
	USART_PMODE_EVEN_gc = (0x02<<4),	///< Even Parity
	USART_PMODE_ODD_gc = (0x03<<4),	///< Odd Parity
} USART_PMODE_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Receive Complete Interrupt level
#define USART_RXCINTLVL_OFF_gc (0x00<<4)	///< Interrupt Disabled
#define USART_RXCINTLVL_LO_gc (0x01<<4)	///< Low Level
#define USART_RXCINTLVL_MED_gc (0x02<<4)	///< Medium Level
#define USART_RXCINTLVL_HI_gc (0x03<<4)	///< High Level

/// Transmit Complete Interrupt level
#define USART_TXCINTLVL_OFF_gc (0x00<<2)	///< Interrupt Disabled
#define USART_TXCINTLVL_LO_gc (0x01<<2)	///< Low Level
#define USART_TXCINTLVL_MED_gc (0x02<<2)	///< Medium Level
#define USART_TXCINTLVL_HI_gc (0x03<<2)	///< High Level

/// Data Register Empty Interrupt level
#define USART_DREINTLVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define USART_DREINTLVL_LO_gc (0x01<<0)	///< Low Level
#define USART_DREINTLVL_MED_gc (0x02<<0)	///< Medium Level
#define USART_DREINTLVL_HI_gc (0x03<<0)	///< High Level

/// Character Size
#define USART_CHSIZE_5BIT_gc (0x00<<0)	///< Character size: 5 bit
#define USART_CHSIZE_6BIT_gc (0x01<<0)	///< Character size: 6 bit
#define USART_CHSIZE_7BIT_gc (0x02<<0)	///< Character size: 7 bit
#define USART_CHSIZE_8BIT_gc (0x03<<0)	///< Character size: 8 bit
#define USART_CHSIZE_9BIT_gc (0x07<<0)	///< Character size: 9 bit

/// Communication Mode
#define USART_CMODE_ASYNCHRONOUS_gc (0x00<<6)	///< Asynchronous Mode
#define USART_CMODE_SYNCHRONOUS_gc (0x01<<6)	///< Synchronous Mode
#define USART_CMODE_IRDA_gc (0x02<<6)	///< IrDA Mode
#define USART_CMODE_MSPI_gc (0x03<<6)	///< Master SPI Mode

/// Parity Mode
#define USART_PMODE_DISABLED_gc (0x00<<4)	///< No Parity
#define USART_PMODE_EVEN_gc (0x02<<4)	///< Even Parity
#define USART_PMODE_ODD_gc (0x03<<4)	///< Odd Parity

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup spi Serial Peripheral Interface
 *  @{
 */

/** @name SPI.CTRL
  * @see SPI_MODE_enum
  * @see SPI_PRESCALER_enum
  * @{
  */
#define SPI_CLK2X_bm 0x80 ///< Enable Double Speed bit mask
#define SPI_CLK2X_bp 7 ///< Enable Double Speed bit position
#define SPI_ENABLE_bm 0x40 ///< Enable Module bit mask
#define SPI_ENABLE_bp 6 ///< Enable Module bit position
#define SPI_DORD_bm 0x20 ///< Data Order Setting bit mask
#define SPI_DORD_bp 5 ///< Data Order Setting bit position
#define SPI_MASTER_bm 0x10 ///< Master Operation Enable bit mask
#define SPI_MASTER_bp 4 ///< Master Operation Enable bit position
#define SPI_MODE_gm 0x0C ///< SPI Mode group mask
#define SPI_MODE_gp 2 ///< SPI Mode group position
#define SPI_MODE0_bm (1<<2) ///< SPI Mode bit 0 mask
#define SPI_MODE0_bp 2 ///< SPI Mode bit 0 position
#define SPI_MODE1_bm (1<<3) ///< SPI Mode bit 1 mask
#define SPI_MODE1_bp 3 ///< SPI Mode bit 1 position
#define SPI_PRESCALER_gm 0x03 ///< Prescaler group mask
#define SPI_PRESCALER_gp 0 ///< Prescaler group position
#define SPI_PRESCALER0_bm (1<<0) ///< Prescaler bit 0 mask
#define SPI_PRESCALER0_bp 0 ///< Prescaler bit 0 position
#define SPI_PRESCALER1_bm (1<<1) ///< Prescaler bit 1 mask
#define SPI_PRESCALER1_bp 1 ///< Prescaler bit 1 position
/** @} */

/** @name SPI.INTCTRL
  * @see SPI_INTLVL_enum
  * @{
  */
#define SPI_INTLVL_gm 0x03 ///< Interrupt level group mask
#define SPI_INTLVL_gp 0 ///< Interrupt level group position
#define SPI_INTLVL0_bm (1<<0) ///< Interrupt level bit 0 mask
#define SPI_INTLVL0_bp 0 ///< Interrupt level bit 0 position
#define SPI_INTLVL1_bm (1<<1) ///< Interrupt level bit 1 mask
#define SPI_INTLVL1_bp 1 ///< Interrupt level bit 1 position
/** @} */

/** @name SPI.STATUS
  * @{
  */
#define SPI_IF_bm 0x80 ///< Interrupt Flag bit mask
#define SPI_IF_bp 7 ///< Interrupt Flag bit position
#define SPI_WRCOL_bm 0x40 ///< Write Collision bit mask
#define SPI_WRCOL_bp 6 ///< Write Collision bit position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// SPI Mode

