dc7kr/asf/xmega/utils/header_files/iar/ATxmega32D4P.h
typedef enum SPI_MODE_enum {
	SPI_MODE_0_gc = (0x00<<2),	///< SPI Mode 0
	SPI_MODE_1_gc = (0x01<<2),	///< SPI Mode 1
	SPI_MODE_2_gc = (0x02<<2),	///< SPI Mode 2
	SPI_MODE_3_gc = (0x03<<2),	///< SPI Mode 3
} SPI_MODE_t;

/// Prescaler setting

typedef enum SPI_PRESCALER_enum {
	SPI_PRESCALER_DIV4_gc = (0x00<<0),	///< System Clock / 4
	SPI_PRESCALER_DIV16_gc = (0x01<<0),	///< System Clock / 16
	SPI_PRESCALER_DIV64_gc = (0x02<<0),	///< System Clock / 64
	SPI_PRESCALER_DIV128_gc = (0x03<<0),	///< System Clock / 128
} SPI_PRESCALER_t;

/// Interrupt level

typedef enum SPI_INTLVL_enum {
	SPI_INTLVL_OFF_gc = (0x00<<0),	///< Interrupt Disabled
	SPI_INTLVL_LO_gc = (0x01<<0),	///< Low Level
	SPI_INTLVL_MED_gc = (0x02<<0),	///< Medium Level
	SPI_INTLVL_HI_gc = (0x03<<0),	///< High Level
} SPI_INTLVL_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// SPI Mode
#define SPI_MODE_0_gc (0x00<<2)	///< SPI Mode 0
#define SPI_MODE_1_gc (0x01<<2)	///< SPI Mode 1
#define SPI_MODE_2_gc (0x02<<2)	///< SPI Mode 2
#define SPI_MODE_3_gc (0x03<<2)	///< SPI Mode 3

/// Prescaler setting
#define SPI_PRESCALER_DIV4_gc (0x00<<0)	///< System Clock / 4
#define SPI_PRESCALER_DIV16_gc (0x01<<0)	///< System Clock / 16
#define SPI_PRESCALER_DIV64_gc (0x02<<0)	///< System Clock / 64
#define SPI_PRESCALER_DIV128_gc (0x03<<0)	///< System Clock / 128

/// Interrupt level
#define SPI_INTLVL_OFF_gc (0x00<<0)	///< Interrupt Disabled
#define SPI_INTLVL_LO_gc (0x01<<0)	///< Low Level
#define SPI_INTLVL_MED_gc (0x02<<0)	///< Medium Level
#define SPI_INTLVL_HI_gc (0x03<<0)	///< High Level

#endif //defined(__IAR_SYSTEMS_ASM__)


/** @addtogroup ircom IR Communication Module
 *  @{
 */

/** @name IRCOM.CTRL
  * @see IRDA_EVSEL_enum
  * @{
  */
#define IRCOM_EVSEL_gm 0x0F ///< Event Channel Select group mask
#define IRCOM_EVSEL_gp 0 ///< Event Channel Select group position
#define IRCOM_EVSEL0_bm (1<<0) ///< Event Channel Select bit 0 mask
#define IRCOM_EVSEL0_bp 0 ///< Event Channel Select bit 0 position
#define IRCOM_EVSEL1_bm (1<<1) ///< Event Channel Select bit 1 mask
#define IRCOM_EVSEL1_bp 1 ///< Event Channel Select bit 1 position
#define IRCOM_EVSEL2_bm (1<<2) ///< Event Channel Select bit 2 mask
#define IRCOM_EVSEL2_bp 2 ///< Event Channel Select bit 2 position
#define IRCOM_EVSEL3_bm (1<<3) ///< Event Channel Select bit 3 mask
#define IRCOM_EVSEL3_bp 3 ///< Event Channel Select bit 3 position
/** @} */


#if defined(__IAR_SYSTEMS_ICC__)

/// Event channel selection

typedef enum IRDA_EVSEL_enum {
	IRDA_EVSEL_OFF_gc = (0x00<<0),	///< No Event Source
	IRDA_EVSEL_0_gc = (0x08<<0),	///< Event Channel 0
	IRDA_EVSEL_1_gc = (0x09<<0),	///< Event Channel 1
	IRDA_EVSEL_2_gc = (0x0A<<0),	///< Event Channel 2
	IRDA_EVSEL_3_gc = (0x0B<<0),	///< Event Channel 3
	IRDA_EVSEL_4_gc = (0x0C<<0),	///< Event Channel 4
	IRDA_EVSEL_5_gc = (0x0D<<0),	///< Event Channel 5
	IRDA_EVSEL_6_gc = (0x0E<<0),	///< Event Channel 6
	IRDA_EVSEL_7_gc = (0x0F<<0),	///< Event Channel 7
} IRDA_EVSEL_t;

#endif // defined(__IAR_SYSTEMS_ICC__)

/** @} */


#if defined(__IAR_SYSTEMS_ASM__)

/// Event channel selection
#define IRDA_EVSEL_OFF_gc (0x00<<0)	///< No Event Source
#define IRDA_EVSEL_0_gc (0x08<<0)	///< Event Channel 0
#define IRDA_EVSEL_1_gc (0x09<<0)	///< Event Channel 1
#define IRDA_EVSEL_2_gc (0x0A<<0)	///< Event Channel 2
#define IRDA_EVSEL_3_gc (0x0B<<0)	///< Event Channel 3
#define IRDA_EVSEL_4_gc (0x0C<<0)	///< Event Channel 4
#define IRDA_EVSEL_5_gc (0x0D<<0)	///< Event Channel 5
#define IRDA_EVSEL_6_gc (0x0E<<0)	///< Event Channel 6
#define IRDA_EVSEL_7_gc (0x0F<<0)	///< Event Channel 7

#endif //defined(__IAR_SYSTEMS_ASM__)



// Port pins

#define PIN0_bm 0x01
#define PIN0_bp 0
#define PIN1_bm 0x02
#define PIN1_bp 1
#define PIN2_bm 0x04
#define PIN2_bp 2
#define PIN3_bm 0x08
#define PIN3_bp 3
#define PIN4_bm 0x10
#define PIN4_bp 4
#define PIN5_bm 0x20
#define PIN5_bp 5
#define PIN6_bm 0x40
#define PIN6_bp 6
#define PIN7_bm 0x80
#define PIN7_bp 7


/*============================================================*/
/* Other definitions                                          */
/*============================================================*/

/* Pointer definitions */
#define    XL     r26
#define    XH     r27
#define    YL     r28
#define    YH     r29
#define    ZL     r30
#define    ZH     r31

#if defined(__IAR_SYSTEMS_ICC__)

/* Offset definitions for Production Signatures */
typedef enum NVM_PROD_SIGNATURES_offsets {
	RCOSC2M_offset = 0x00, ///< RCOSC 2MHz Calibration Value
	RCOSC32K_offset = 0x02, ///< RCOSC 32kHz Calibration Value
	RCOSC32M_offset = 0x03, ///< RCOSC 32MHz Calibration Value
	LOTNUM0_offset = 0x08, ///< Lot Number Byte 0, ASCII
	LOTNUM1_offset = 0x09, ///< Lot Number Byte 1, ASCII
	LOTNUM2_offset = 0x0A, ///< Lot Number Byte 2, ASCII
	LOTNUM3_offset = 0x0B, ///< Lot Number Byte 3, ASCII
	LOTNUM4_offset = 0x0C, ///< Lot Number Byte 4, ASCII
	LOTNUM5_offset = 0x0D, ///< Lot Number Byte 5, ASCII
	WAFNUM_offset = 0x10, ///< Wafer Number
	COORDX0_offset = 0x12, ///< Wafer Coordinate X Byte 0
	COORDX1_offset = 0x13, ///< Wafer Coordinate X Byte 1
	COORDY0_offset = 0x14, ///< Wafer Coordinate Y Byte 0
	COORDY1_offset = 0x15, ///< Wafer Coordinate Y Byte 1
	ADCACAL0_offset = 0x20, ///< ADCA Calibration Byte 0
	ADCACAL1_offset = 0x21, ///< ADCA Calibration Byte 1
	ADCBCAL0_offset = 0x24, ///< ADCB Calibration Byte 0
	ADCBCAL1_offset = 0x25, ///< ADCB Calibration Byte 1
	TEMPSENSE0_offset = 0x2E, ///< Temperature Sensor Calibration Byte 0
	TEMPSENSE1_offset = 0x2F, ///< Temperature Sensor Calibration Byte 0
} NVM_PROD_SIGNATURES_offsets_t;

#endif //defined(__IAR_SYSTEMS_ICC__)


/* Contants */

#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x9000
#define PROGMEM_END (0x0000 + 0x9000 - 1)

#define APP_SECTION_START 0x0000
#define APP_SECTION_SIZE 0x8000
#define APP_SECTION_END (0x0000 + 0x8000 - 1)

#define APPTABLE_SECTION_START 0x7000
#define APPTABLE_SECTION_SIZE 0x1000
#define APPTABLE_SECTION_END (0x7000 + 0x1000 - 1)

#define BOOT_SECTION_START 0x8000
#define BOOT_SECTION_SIZE 0x1000
#define BOOT_SECTION_END (0x8000 + 0x1000 - 1)

#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x3000
#define DATAMEM_END (0x0000 + 0x3000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x1000
#define IO_END (0x0000 + 0x1000 - 1)

#define MAPPED_EEPROM_START 0x1000
#define MAPPED_EEPROM_SIZE 0x0400
#define MAPPED_EEPROM_END (0x1000 + 0x0400 - 1)

#define INTERNAL_SRAM_START 0x2000
#define INTERNAL_SRAM_SIZE 0x1000
#define INTERNAL_SRAM_END (0x2000 + 0x1000 - 1)

#define EEPROM_START 0x0000
#define EEPROM_SIZE 0x0400
#define EEPROM_END (0x0000 + 0x0400 - 1)

#define FUSE_START 0x0000
#define FUSE_SIZE 0x0006
#define FUSE_END (0x0000 + 0x0006 - 1)

#define LOCKBIT_START 0x0000
#define LOCKBIT_SIZE 0x0001
#define LOCKBIT_END (0x0000 + 0x0001 - 1)

#define SIGNATURES_START 0x0000
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x0000 + 0x0003 - 1)

#define USER_SIGNATURES_START 0x0000
#define USER_SIGNATURES_SIZE 0x0100
#define USER_SIGNATURES_END (0x0000 + 0x0100 - 1)

#define PROD_SIGNATURES_START 0x0000
#define PROD_SIGNATURES_SIZE 0x0034
#define PROD_SIGNATURES_END (0x0000 + 0x0034 - 1)

#define    RAMEND     INTERNAL_SRAM_END
#define    XRAMEND    EXTERNAL_SRAM_END
#define    E2END      EEPROM_END
#define    FLASHEND   PROGMEM_END


#endif /* ENABLE_BIT_DEFINITIONS */
#endif /* __ATxmega32D4P_H (define part) */
#endif /* __ATxmega32D4P_H (SFR part) */


#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif
